{"Afrika Bambaataa &amp; The Soulsonic Force": {"Planet Rock - The Album": {"Renegades of Funk": "\nNo matter how hard you try, you can't stop this now\nNo matter how hard you try, you can't stop this now\n\nRenegades of this atomic age\nThis atomic age for renegades\nRenegades of this atomic age\nThis atomic age for renegades\n\nPrehistoric ages and the days of ancient Greece \nOn down through the Middle Ages\nWhen the earth kept going through changes\nThere's a business going on, cars continue to change \nNothing stays the same, there were always renegades \nLike Chief Sitting Bull, Tom Payne \nLike Martin Luther King, Malcom X\nThey were renegades of the atomic age \nSo many renegades\n\nHand clap, hand clap, the renegades \n\nFrom a different solar system many many galaxies away\nWe are the force of another creation\nA new musical revelation \nAnd we're on this musical message to help the others listen \nImprove momentum and seek the electonic chance\nLike astrology \nLike technology\nLike God's Creation \nLike the Zulu station \nLike to the nation \nLike destroy all nations\nLike militants\nLike down in sand \nLike through changes ,nothing stays the same\nOh renegades\n\nNow renegades are people with their own philosophy\nThey change the course of history\nEveryday people like you and me \nYou know they have their secret notions\nAnd time is endless motion\nAll people of the moderate ages here in this twentieth century\nYou have to keep up in time with the moderate time\nA state of mind and a sense of pride\nA renegade, yes a renegade \nOf this time and age\nSo many renegades\nWho's that \nNow hand clap\nThe renegades\n\nWe're the renegades of funk \nWe're the renegades of funk \nWe're the renegades of funk \nWe're the renegades of funk \nPoppin', sockin', rockin' with a side of hip-hop\nBecause where we're goin' there ain't no stoppin'\nYou know we're poppin', sockin', with a side of hip-hop\nBecause where we're goin' there ain't no stoppin'\nPoppin', sockin', rockin' with a side of hip-hop\nBecause where we're goin' there ain't no stoppin'\n(Repeat)\n\nWe're teachers of the funk\nAnd not of empty popping\nWe're blessed with the Force and the sight of\nelectronics\nWith the bass, and the treble\nThe horns and our vocals\nYou know everytime we pop into the beat we get fresh\n\nThere was a time when our music \nWas something called the Bay Street beat\nPeople would gather from all around\nTo get down on the Bay sound \nYou had to be a renegade those days\nTo take a man on the dance floor\nLike Afrika Bambattaa and the Soulsonic Force\nWe're talking about Mr. B, Pow Wow, G-L-O-B-E\nWas a renegade, yes, a renegade of the atomic age\nSo many renegades\nWhat's that\nIt's a hand clap\nThe renegade\n\nJust jam sucker\nSay jam sucker\nSay groove, sucker\nSay groove, sucker\nSay dance, sucker\nSay dance, sucker\nNow move, sucker\nNow move, sucker\n\nEverybody say \nWe're the renegades of funk\nWe're the renegades of funk\nWe're the renegades of funk\nWe're the renegades of funk\nWe're the renegades of funk\nWe're the renegades of funk\nWe're the renegades of funk\nWe're the renegades of funk\n\nShake that thing\nThat makes me swing\nI got some great \nHe's a renegade of funk \nMr. Biggs\nHe's a renegade of funk \nBambaataa\nHe's a renegade of funk \nPow Wow\nHe's a renegade of funk \nAnd  MC Globe"}, "Looking for the Perfect Beat 12\"": {"Looking for the Perfect Beat": "\n   Universal b-boy, looking for the perfect beat\n   Mortal motivations, looking for the perfect beat\n   Mighty Zulu Nation, they have found the perfect beat\n   Afrika Bambaataa, I present the perfect beat beat beat beat\n\nLooking for the perfect beat (Searching for the perfect beat)\nLooking for the perfect beat (Seeking for the perfect beat)\nI must get mine (I'm out to get it)\nI must get mine (I'm out to get it)\n\nNow in this world of music, there are many different tones (Tell 'em)\nIf there's no satisfaction, just pay for some action (Listen up)\nOn your radio, you hear perfect beats playing (Hey)\nIf it makes you satisfied, just get a pony and ride! (Giddy up!)\n\nWell if you're looking for the perfect beat, people\nWell here's a perfect beat for ya\nSo ??? with a chorus you can sing, round up!\n\nLooking for the perfect beat (Searching for the perfect beat)\nLooking for the perfect beat (Seeking for the perfect beat)\nI must get mine (I'm out to get it)\nI must get mine (I'm out to get it)\n\n      Looking for the perfect beat (Repeat 4x)\n\nSay we like to body rock the parties\nSay we like to body rock the parties\n\nYou like to body rock the parties?\nWe like to instant pop the parties\n\nStudents, of the music, at every single age\nMust exercise the quotes of Shakespeare, with this life upon a stage\nWhen we say life you know that's right, has a meaning\nOur music does complete it\nAnd all the things that we wanna keep teasing, teasing, teasing\n\nLooking for the perfect beat, people\nWell here's a perfect beat for ya\n\n      Looking for the perfect beat (Repeat 4x)\n\nLooking for the perfect beat party, the one with the top sure shot mix\nStop a futuristic hit dance, just party (Get loose, get loose)\nEvery time we get into it, makes us wheel and deal\nBrings out the very best in us, that is for real\n\nNow this is what you gotta do (This is what you gotta do)\nThis is a thing you must to, round up!\n\nMusic is a must, the rhythm moves the women\nTo a spacy romantic ocean that's ???\nPerfer or every moment, is a space on the parade\nWith the psychadelic shades, make you party party, everybody\n\nNow this is what you gotta do (This is what you gotta do)\nThis is a thing you must to, round up!\n\nMr. Biggs!     (Looking for the perfect beat)\nNow Pow Wow    (Looking for the perfect beat)\nThe G.L.O.B.E. (Now found the perfect beat)\n\nPeople of the world    (We're looking for the perfect beat)\nAll the boys and girls (Looking for the perfect beat)\nThe Soul Sonic Force   (Has found the perfect beat)\n\n\tBeat this! (Repeat 3x)\n\nLooking for the perfect beat, people\nWell here's a perfect beat for ya\nSoulsonic stay aim, with a chorus you can sing, round up!\n\n      Looking for the perfect beat (Repeat 4x)\n\nGet up on this now, or you'll be left behind\nNow say say say \"Round up!\" (Round up!) Say \"Round up!\" (Round up!)\n\nSay \"Get that beat\" (Get that beat)\n\"That perfect beat\" (That perfect beat)\n\"I gotta get mine\"  (I gotta get mine)\n\"I gotta get mine\"  (I gotta get mine)\n\"It's working\"      (It's working)\n\"It's working\"      (It's working)\n\nSay \"We like to body rock the party\" (We like to body rock the party)\nSay \"We like to body rock the party\" (We like to body rock the party)\nYou like to body rock the party? We like to insti pop the party\n\nLooking, looking, looking, Soulsonic Force\n\nWe are the future, you are the past\nWe are your future, you are the past\n\n\tIt's working (Repeat 8x)\n\nKeep looking, searching, seeking, finding\nLooking, searching, seeking, finding (Repeat 8x)\n\nKeep looking for the perfect beat\nAnd it'll help you reach your peak\nKeep dancing to our perfect beat\nAnd it'll help you reach your peak\nKeep looking for the perfect beat\nAnd it'll help you reach your peak\nKeep dancing to our perfect beat\nAnd it'll help you reach your peak\nKeep looking for the perfect beat\nAnd it'll help you reach your peak\nKeep dancing to our perfect beat\nAnd it'll help you reach your peak\n"}, "Planet Rock -The Album": {"Frantic Situation": "\nHey, hey, hey, hey, hey, hey, hey........\n\nThe Soulsonic Force, Mr. Biggs, Pow Wow and MC Globe\nShakin' your soul and it's sort of mad\nWhen the music is frantic and the spirit is happenin\nState of mind, it's a reminisce\nIn a musical sense if you get right to it\nIt's timely situation\nWith your own creation\nShould be electric, cause it's frantic\n\nIsn't it a wonder \nWe are the gun and thunder \nWe're on the same mission\nCome on everybody listen\nPeople all across the nation\nWho thinks they have imagination\nEveryone wants to see you groove \nAnd cause your frantic body to move\n\nIt's a frantic situation\nIt's a frantic situation\nIt's a frantic situation\nIt's a frantic situation\n\nZing zang zing zang zang zang......\n\nSo come on everybody\nEverybody come on\nLet's all get together and rock along\nTwist and scream and shout\nShout\nTwist and scream and shout\n\nNow do what you came here to\nIn order to get ready you gotta get loose\nSay !\nSay what ?\nEverybody say\nSay !\nSay what ?\nIt's a frantic, it's a frantic situation\nSituation\n\nWorlwide, worldwide\nIt's a musical drive\nAin't masterbation\nIt's a proclamation\nAll across the nation\nIt's a happy situation\n\nNow say \nZing zang zing zang zang zang ......\n\nIt's a frantic situation\nIt's a frantic situation\nIt's a frantic situation\nIt's a frantic situation......"}}, "raw_song_0": "\nArtist: Afrika Bambaata and the Jazzy 5\nAlbum:  Tommy Boy 12\"\nSong:   Jazzy Sensation (Bronx Version)\n\nIntro\n-----\n\nNow all the ladies in the house (The ladies! The ladies!)\nThe ladies in the house (C'mon, let me hear you say ahh-oww!) \"Ahh-oww!\"\n(Say Ahh-oww!) C'mon, c'mon \"Ahh-oww!\"\nThe homeboys in the house (The boys! The boys!)\nThe boys in the house (C'mon, let me hear you say ho!) \"Ho!\"\n(Say ho!) \"Ho!\"\n(Give it up!)\n\nVerses\n------\n\nHey, party people just (bust this)\nWe got a little somethin' (that you can't resist)\nWe wanna say a little somethin' (to the other MC's)\nWho said we don't have no quality\n(We got) quality and sophistication\n(And all we need is your co-operation)\nTo rock the house and with the greatest of ease\nThe Masters Ice! (Gee!) B! I'm Lest (and Mr Freeze)\nSo come on y'all, let's go to work\nWith Bambaataa, Jazzy Jay (and Red Alert)\n(With others we form the Zulu Nation)\n(Now check us out with our Jazzy Sensation)\n(Huh!) Can you feel it?\n\nNow I'm the Master Ice and I'm twice as nicer\nAnd the dedicated prince of the disco slice\nAs you can see I'm formally known\nAs the rodeo rock of the microphone\n\nAnd I'm Mr Freeze, and to you the tell you the truth\nThat my quality rank's about 100 Proof\nAnd for all of y'all who like to duplicate\nI had to return to set the story straight\n\nC'mon everybody and start to clap\n(Because we are the kings of the Body Rock rap)\nOur names (Our names are at the top of the list)\n(And we're the best MC's that could ever exist)\nSo let's party! (Let's party till you can't no more)\nAnd if you can't (And if you can't, just walk out the door)\nBut if you could (If you could, you deserve a crew)\nAnd like the five (Like the five MC's from Sound View)\nWe're the once (We're the once divided reunited)\nHere we go (Here we go) You know we go (You know we go)\n(We go by the names down in the Hall of Fame\n No other guy or dame could ever play the game\n We're the flyest, the flyest, known to be the highest\n Cos we're at the top and we can't be stopped\n We're the sweetest, the neatest, the latest, the greatest\n The best MC's to ever arrive!)\n\nWell I'm the hip hip-hopper and the MC topper\nBut everybody knows me as the ladies' grand rocker\nMC Master Gee and I'm the singer of the crew\nSo tell me young ladies, what you wanna do?\n\nAnd I'm the Master B as you will see\nI hold the key to the door of society\nBut if you listen up close you will agree\n(A-baby doll, he's the best of the century)\n\nAnd I'm AJ Lest at your request\nA presidential rapper with a lot of finesse\nCos you could call me AJ, but they call me Lester\nThe mic rocker, the woman possessor\n\nAnd everybody calls me Chuckie Chuck\nChuck-a-luck a-luck a-lucka-lucka-luck\nInstead of passin' the mic I had to pass the buck\n(And now it's time to go amok, huh!)\nFunk it up!\n...Just get on down!\n\nSo, listen everybody (Listen everybody)\nListen up everybody (Listen everybody)\nCos we got a surprise (Got a surprise)\nWe got a surprise (Got a surprise)\nYes indeedy, New York City lookin' pretty, have no pity\nCos I'm the Master Ice and I'm in your city, hey\n(Hey!) Now it's time to throw\nGo high and low and do The Gigolo\nShake your body to the left (Shake your body to the right)\nGo down to the floor, now you're lookin' out of sight\nThen you come back up and look your partner in the eyes\nYou'll find yourself headin' for a big surprise\nBecause you split your pants a-when you went real low\n(And that's why we called it The Gigolo)\nHa ha! (Gigolo Gig-Gigolo Gigolo) Serious, serious, c'mon to c'mon\nI say clap your hands and do The Gigolo (Gigolo!)\n(Clap your hands and do The Gigolo, Gigolo!)\nListen party people all across the nation\nAll we want from you (Is your co-operation)\nAnd if you're gettin' down with no (Limitations)\nEverybody say (Jazzy Sensation) \"Jazzy Sensation!\"\n(Jazzy Sensation) \"Jazzy Sensation!\"\nAnd you don't stop that Body Rock\nIt's on, it's on, it's on, it's on (yah ha haa!)\nAnd if you know the words (brrr!) why don't you sing along (c'mon)\n\nCan you feel it? Can you feel it? Our Jazzy Sensation\nCan you feel it? Can you feel it? Our Jazzy Sensation\n\nCan you feel it? Can you feel it? Our Jazzy Sensation\nI say Jazzy (Jazzy) \nJazzy Sensation (Jazzy Sensation)\nC'mon, cos it's the Jazzy (It's the Jazzy) \nJazzy Sensation (Jazzy Sensation) Ah yeah, ha (Shep Pettibone!)\nC'mon c'mon c'mon c'mon c'mon...\nLean left, ha! Lean right\n(Lean front) You gotta (Lean back)\nAnd c'mon c'mon a-c'mon, you gotta rock with it\nOw! Yeah, baby, ha ha!\n\nThat's it, aha, ain't it funky now?\nHa ha ha ha, that's it\nHuh! Ain't it funky now\nUh! Uh! Uh!\nAin't it, ain't it funky now?\nHa ha ha ha, ain't it funky-uh?\nIt's that beat y'all, that beat-beat the beat, y'all!\nC'mon, say James Browwwwwn (James Browwwwwn)\n(James Browwwwwn, say James Browwwwwn) Yo!\nSay nobody gives more music (Ain't nobody gives more music) Aha ha!\n(I say nobody gives more music) Say what?\n", "Afrika Bambaataa Zulu Nation Cosmic Force": {"Looking for the Perfect Beat 1980-1985": {"Zulu Nation Throwdown": "\nSay what's the name of this Nation? \nZulus\nZulus\nAnd who's gonna get on down? \nThe Cosmic Force \nThe Cosmic Force\n\nChitty-chitty-bang-bang, we are your main thing\nYou listen to the song that she is gonna sing-sing\nWe party all night to the people's delight\nCause everybody knows that we rock out of sight\nSay we are the best in the creation\nWe go by the name of the Mighty Zulu Nation\nWe're the Mighty Zulus, we're one of a crew\nWe're comin by, we're comin through\nWe're worldwide and we're citywide\nCause we shock the house, we shock it right\nWe'll say a little somethin to let you know\nThat my mellow Smitty D is on the echo\nWe do a routine and put on a show\nAnd we dedicate it to the people we know\nWe're one of a kind, we're easin the mind\nThe Zulu Nation say time after time\n\nTo the party people out there, we want y'all just to know\nThat we are the four MC's and we are the star of the show\nAha, at every Zulu Throwdown, say this is what you see\nAnd hear the voice (I'm Chubby Chub) (Ice-Ice) (Little Ikey C) (Lisa Lee)\nWe rock in the sunlight or any kind of weather\nCause we are the Force (everybody) that has our act together\nWe wanna party (party) dance (dance) and boogie all damn night\nDo-do-do-do, do, do, do-do-do-do\nWe got to amaze all you people that we're one hell of a sight\nDo-do-do-do, do, do, do-do-do-do\nSay standin up here are the four MC's that's devine\nDo-do-do-do, do, do, do-do-do-do\nWhile the people at the door are just standin in one big line\nDo-do-do-do, do, do, do-do-do-do\nNow some of our voices are high, some are low\nDo-do-do-do, do, do, do-do-do-do\nBut it don't make no difference, we can still all yell \"ho!\"\nDo-do-do-do, do, do, do-do-do-do\nWell, the song is almost over, and emceein is an art\nDo-do-do-do, do, do, do-do-do-do\nBecause when the party's jumpin, that's when the four will start\nDo-do-do-do, do, do, do-do-do-do\n\nRoll call, I want to get down\nSay roll call, we want to get down\nSay roll call, we want to get down\nWe are the four MC's, don't need no help\nSo (check out the way)\nSo (check out the way)\nSo check out the way we introduce ourselves\n\nShe's...\nLisa Lee, and from the top of the key\nYou know I'm guaranteed to be the queen of MC's\nHe's...\nMC Chubby Chub from the heavens above\nNo, I ain't never met a girl that I couldn'd shook up\nAnd he's...\nMC Ice-Ice, the shocker-rocker on the mic\nAnd doin it on, doin it high power, doin it right\nAnd he's...\nLittle Ikey C, and I'm the melody\nNow all you young ladies get sexy\nDo it\n\nThis is a story from the yesteryear\nSaid before it was the wack, but now the ladies cheer\nUntil we climb the ladder say one by one\nAnd while we did it, we spreaded some fun\nSay we change the tempo so you can clap your hands\nAnd then we add a little ( ? ) so y'all can dance\nAnd you like our style, which is just our voice\nSo young ladies, come and pick your choice\nChubby Chub\nIce-Ice\nI'm Little Ikey C\nWe are the three MC's\nLisa Lee\nYou're the queen\nGo girl\nJust get on the mic and do your own thing\n\n[ Lisa Lee ]\nSo put your hands in the air and listen to me\nCause you listen to the voice of MC Lisa Lee\nDon't play no games, don't bite no style\nWhen you came through the door we gave you a smile\nWe want you to get loose, get ready to rock\nWe're gonna paralyze your mind and put you in shock\nWe're gonna make you wanna yell, scream and shout\nWe're gonna let you know without a doubt\nExactly what we be about\nRockin to the sounds that make you dance\nMake the ants crawl in your pants\nPut you in a music trance\nListen to the beat and let yourself go\nCause everybody knows this is nothin but a disco\nRock, shock the sure shot\nThis ain't a Broadway play or a high school plot\nIt's the real deal that makes you feel\nLike, like you got sex appeal\nNow party people in the place you feel the bass\nCan you check out the highs, check out the grace\nSo wallflowers in the house, this is your chance\nTo show everybody that you can dance\nPunk rock to the left, and Patty Duke to the right\nMove your body now, you can do it all night\nThese are the devastating words that you never heard before\nI'm Lisa Lee, hah, I got rhymes galore\nSo young ladies out there, he's from the heavens above\n\n[ Chubby Chub ]\nThat's right, never met a girl that I couldn't shook up\nSo won't you clap your hands and have some fun\nIt's the super dynamite (huh) MC Chubby Chub\nYou don't stop (hah) you don't stop (haha)\nGet it all together, girl, because we're startin to rock\nAnd to all the young ladies, yes his name is Chub\nSay I didn't come here to ask for your love\nCause I'm a cool, cool kid with a healthy mind\nAnd I figure that ( ? ) will always take time\nI'm lookin for a girl that I can call mine\nWhen she walk down the street, the sun will shine\nAnd to all the young ladies, I'm talkin 'bout me\nCause I'm lookin for a girl that's so unique\nI'm not lookin for a girl that drives a car\nTo me she'll always be my superstar\nCause I'm lookin for a girl with a beautiful smile\nAnd a young lady that's worth my while\nYoung ladies out there, don't you get uptight\n\n[ Ice-Ice ]\nCause it's me, baby doll, MC Ice-Ice\nJust like a bike got wheels, sweet lemon peel\nNow the MC's, they know the deal\nThat we always rock and we can't be stopped\nWherever we rock and hit the latest spot\nI said the other MC's are standin tall\nBut the taller they are, the harder they fall\nCause we the, the Funkadelic on the microphone\nBecause we are the MC's that's all alone\nAnd when we get on the mic it's back to back\nI said that we're the crew that leads the pack\nAnd we'll teach ya lessons that you'll never forget\nBecause we are the MC's that ( ? )\nWe're on to the crack of dawn\nWe're on to the crack of dawn\nAnd young ladies, he's from the top\n\n[ Little Ikey C ]\n(He's) Little Ikey C and I'm the master rock\nYa don't stop, ya don't stop\nTold you 'bout the ding-da-da-ding-da-ding-dingy-ding\nThat thing that you call that body rock\nNow let me tell you somethin that caught my eye\nIt was a real jazzy lady, she was so fly\nShe had long hair and clothes so fine\nI said, \"I'ma keep rappin until you're mine\"\nI said, \"I'ma rap for just about a hour\"\nCause I knew the young lady was surely high power\nAnd the way she moved was like a graceful swan\nAnd we can make love to the break of dawn\nAnd the way she move is like a graceful dove\nSay could it be I'm fallin in love\n\"Will you be mine\" is what I say\nWhy don't you chill out, just gimme the play\nYa don't stop\nYa don't stop\n\nSay what's the name of this Nation? \nZulus\nZulus\nAnd who's gonna get on down? \nBambaataa\nBambaataa\n\nSay what's the name of this Nation? \nZulus\nZulus\nAnd who's gonna get on down? \nJazzy Jay\nJazzy Jay\n\nSay what's the name of this Nation? \nZulus\nZulus\nAnd who's gonna get on down? \nBambaataa\nBambaataa\n\nSay what's the name of this Nation? \nZulus\nZulus\nAnd who's gonna get on down? \nJazzy Jay\nJazzy Jay"}}, "raw_song_1": "\nArtist: Afrika Bambaata\nAlbum:  Planet Rock 12\"\nSong:   Planet Rock\n\nParty people\nParty people\nCan y'all get funky?\nSoul Sonic Force - can y'll get funky?\nThe Zulu Nation - can y'll get funky?\nYaaah!\nJust hit me\nJust taste the funk and hit me\nJust get on down and hit me\nBambaataa's jus' gettin' so funky, now, hit me\nYaaah!\nJust hit me\n\nJust start to chase your dreams\nUp out your seats, make your body sway\nSocialize, get down, let your soul lead the way\nShake it now, go ladies, it's a livin' dream\nLove Life Live\nCome play the game, our world is free\nDo what you want but scream\n\nWe know a place where the nights are hot\nIt is a house of funk\nFemales and males \nBoth headed all for the disco\n\nThe D.J. plays your favorite blasts\nTakes you back to the past, music's magic (poof)\nBump bump bump get bump with some flash, people\n\nRock rock to the Planet Rock, don't stop\nRock rock to the Planet Rock, don't stop\n\nThe Soul Sonic Force - Mr. Biggs, Pow Wow, and M.C. Globe\nWe emphasize the show, we got ego\nMake this your night, just slip it right, and by day\nAs the people say, live it up, shucks\nNo work or play, our world is free\nBe what you be - be\n\nRock rock to the Planet Rock, don't stop\nRock rock to the Planet Rock, don't stop\n\nYou're in a place where the nights are hot\nWhere nature's children dance and set a chance\nOn this Mother Earth, which is our rock\nThe time has come, and work for soul, show you really got soul\nAre you ready hump bump bump, get bump, now let's go, house\n\nTwist and turn, the you let your body slide\nYou got the body rock and pop, bounce and pounce\nEverybody just rock it, don't stop it\nGotta rock it, don't stop\nKeep tickin' and tockin', work it all around the clock\n\nEverybody keep rockin' and clockin' and shockin' and rockin', go house\nEverybody say, rock it, don't stop it (Crowd repeats)\nWell hit me, Mr. Biggs (Crowd repeats)\nPow Wow (Crowd repeats)\nG-L-O-B-E (Crowd repeats)\nThe Soul Sonic Force\n\nYou gotta rock it, pop it, 'cause it's the century\nThere is such a place tht creates such a melody\nOur world is but a land of a master jam, get up and dance\nIt's time to chase your dreams\nUp out your seats, make your body sway\nSocialize, get down, let your soul lead the way\nShake it now, go ladies, it's a livin' dream\nLove Life Live\n\nZih Zih Zih Zih Zih (ad lib)\n\nEverybody say, rock it, don't stop it (Crowd repeats)\nEverybody say, shock it and pop it (Crowd repeats)\nEverybody say, ich me sun chi (Crowd repeats)\nSay, Planet Rock (Crowd repeats)\nIt's the sure shot (Crowd repeats)\nSay, Planet Rock (Crowd repeats)\nIt's the sure shot (Crowd repeats)\n\nSo twist and turn, then you let your body glide\nYou got the body rock and pop, bounce and pounce\nSo hit me\nJust taste the funk and hit me\nJust get on down and hit me\nBambaataa's gettin' so funky, now hit me\nEvery piece of the world\nRate the message of the worlds\nAll men, women, boys, and girls, hey our Planet Rock is superb\nGet on it\nYou got the groove, move (ad lib)\nFeel the groove - fell it\nDo what ya want but ya know ya got to be cool and boogie\nOut on the floor, go down\nBring it low\nClose to the ground\nEverybody just rock it, don't stop it, gotta rock it\nDon't stop\nKeep tickin' and tockin'\nWork it all around the clock\nEverybody just rock it, don't stop it\nGotta rock it, don't stop (repeats) \n\n"}