{"Anderson .Paak f/ BJ The Chicago Kid": {"Malibu": {"The Waters": "\n[Intro]\nYes lord, yeah\n\n[Verse 1: Anderson.Paak]\nTried to tell niggas, in 2012, nigga\nWorking hand to hand and no avail\nVolume one was too heavy for you frail niggas\nSo I got leaned like codeine and pills\nIt's the visionary, in the vintage Chevy\nIt's been a while but wow you still care\nFree Nash 'til the pass out obituaries\nIn bold caps, \"your bitch-ass was not there\"\nAnd I can do anything but move backwards\nThe hardest thing is to keep from being distracted\nMy big sister still claim me on them taxes\nTell Uncle Sam I just need a second to add this\nGave my momma ten racks\nAnd she packed and went to Chumash with it\nCould triple the worth and give me half of it\nHalf of it I took in the back of the air mattress\nA quarter stash was stashed in a box with the Air Maxs'\nThe rest got lost in Saks with my wifey, no BM\nWhack niggas dropping links in my DM\nBad bitches up and down a nigga TL\nI'm glad that you finally made it to the future but you're late\nAnd the price is through the muthafuckin' roof\nIf you want you could wait outside the building\nI ain't takin' no more meetings\n\n[Chorus: BJ the Chicago Kid]\nStepped in the waters\nThe water was cold\nChi in my body\nBut not in my soul\n\n[Verse 2: Anderson.Paak]\nI bring you greetings from the first church of Boom Baptists\nUnited Fellowship of Free Nationals\nResiding pastor is thy.Paak\nAnd the first lady is a bad bitch\nWith slanted eyelids and thick asses\nSunglasses, Martin Luther King fan for you bitch niggas\nSweating on my Patent Leathers\nPressure turned their feather weight into a Cinderella\nI ain't seen the ground in days since I grew propellers\nWe'll do one better\nWord to the liquor that killed my grandpa liver\nI know you finally look proud, a nigga smiling\nTo every hundred niggas that came and gone missing\nOnly a handful will go the distance\nI swear I seen this shit coming as if I was living up under the plumbing\nWhile niggas was riffing and mumbling 'bout, what they could do\nI was cooking gumbo whipping the voodoo\nI was in the jungle running with Zulu's\nWe was looking past the struggle while life was moving so fast\nYou had to be shopping at Ginsu\nTo the top of the food group\nDoing what I want and how I should too\n\n[Chorus: BJ the Chicago Kid]\nStepped in the waters\nThe water was cold\nChi in my body\nBut it didn't touch my soul\nStepped in the waters\nThe water was cold\nChi in my body\nBut it didn't touch my soul\n\n[Outro]\nLadies in gentlemen, the most fantastic day in history\nWould you boys mind explaining the cause\nOf what made this great park go underneath this hood\nTake a look at this"}}, "Anderson .Paak f/ Sonyae Elise, The Game": {"Malibu": {"Room In Here": "\n[Skit]\nBesides surfing, what do you think about? Love, for instance?\nI don't think about it, I make it\n\n[Chorus: Anderson.Paak]\nBaby there's room in here\nJust enough for two in here\nAin't nobody but you and me in here\nYeah, what can we do in here?\nWhat can we do? What can we do?\n\n[Verse 1: Anderson.Paak]\nI want you by my lonesome, above this crowded space\nIt's easier to hold some, when no one's in the way\nWell if no one's in the running for the part\nI'd love to pick a day\nTo show you the main room (Whenever's a good time)\nI don't need a bouquet, I just need proper space\nHomie three blocks away, I got bottles for days\nI got tropical haze, go ahead and wave bye\nLet me help with your coat, grab a hold of my arm\nTell them niggas to move, tell your sister you fine\n\n[Chorus: Anderson.Paak]\nCause baby there's room in here\nJust enough for two in here\nAin't nobody but you and me in here\nYeah, what can we do in here?\nWhat can we do? What can we do?\n\n[Verse 2: Anderson.Paak]\nAs crazy as it may seem, it's not too hard to read\nIt's too many if's and maybe's, and not enough certainty\nWell if no one's putting numbers on the board\nI'd love to take a swing, might even graze you\nBut I don't mean any harm, I'm just speaking my mind\nTake a look at that moon, 'bout as bright as your eyes\nWe got plenty of space, go ahead and recline\nTake a puff of that [exhales], get a sip of this wine\nYeah, feelin' good?\n\n[Chorus: Anderson.Paak]\nCause baby there's room in here\nJust enough for two in here\nAin't nobody but you and me in here\nYeah, what can we do in here?\nWhat can we do? What can we do?\n\n[Verse 3: The Game]\nShe had a bright smile, big white teeth, I mean\nWhiter than a white T, remind me of wifey\nMet her at the studio, sort of like a high buyer\nShe told me she had game so we connected like the wifi\nShe had this Asian swagger 'bout her, so I call her mai tai\nStarted followin' her, she was the only thing on my timeline\nAnd there was this one picture, her in the swimsuit\nThat made a nigga want to beat it up, and I intend to\nBut I'm a have to put in work, baby girl then drink it all\nFace like Mona Lisa, I'm just tryna be the wall to hang on\nI ain't got no patience, I can't wait long\nShe come and see me, but she don't stay long\nAnd that's the problem, she a good girl\nMaybe it's too much smoke in the room\nAnd she don't want that Mary Jane in her Vidal Sassoon\nSo I'm a take a minute, and walk her to her Uber\nGot a bullet in my heart, and she the shooter\nAy,.Paak\n\n[Chorus: Anderson.Paak]\nBaby there's room in here\nJust enough for two in here\nAin't nobody but you and me in here\nYeah, what can we do in here?\nWhat can we do? What can we do?"}}, "Anderson .Paak": {"Malibu": {"The Bird": "\n[Chorus]\nA bird with the word came to me\nThe sweetness of a honeycomb tree\nAnd now my luck was taking over me\nCouldn't fake it if I wanted to\nI had to wake up just to make it through\nI got my patience and I'm making do\nI learned my lessons from the ancient roots\nI choose to follow what the greatest do\nA bird with the word came to me\nThe sweetness of a honeycomb tree\nAnd now my luck was taking over me\nCouldn't fake it if I wanted to\nI had to wake up just to make it through\nI got my patience and I'm making do\nI learned my lessons from the ancient roots\nI choose to follow what the greatest do\n\n[Verse 1]\nI'm repping for the longest cycle, mmm\nMy uncles had to pay the cost, mmm\nMy sister used to sing to Whitney, mmm\nMy mama caught the gambling bug, mmm\nWe came up in a lonely castle, mmm\nMy papa was behind them bars, mmm\nWe never had to want for nothing, mmm\nSaid all we ever need is love, mmm\nWe see the same things\nOh-oh-oh\nWe sing the same songs\nOh-oh-oh\nWe feel the same grief\nOh-oh-oh\nBleed the same blood\nYou grew up in the home beside me\nI always had a friend to call\nHow could I make it here without you? Mmm\nI pray I leave before you're gone\n\n[Chorus]\nA bird with a word came to me\nThe sweetness of a honeycomb tree\nAnd now I look, what's taking over me\nCouldn't fake it if I wanted to\nI had to wake up, just to make it through\nI got my patience and I'm making do\nI learned my lessons from the ancient roots\nI choose to follow what the greatest do\nA bird with the word came to me\nThe sweetness of a honeycomb tree\nAnd now my luck was taking over me\nCouldn't fake it if I wanted to\nI had to wake up just to make it through\nI got my patience and I'm making do\nI learned my lessons from the ancient roots\nI choose to follow what the greatest do\n\n[Outro]\nHey, my little youth is crying\nI'm almost home, almost home\nLook no further riots, mmm\nWorking my fingers to the bone\nSee I do the best I can, mmm\nMama was a farmer, mmm\nPapa was a goner, mmm", "Water Fall (Interluuube)": "\n[Verse]\nI can't wait for the moment you can take off\nI pray you don't have to cut my time short\nI would rather not say much\nBut if I do, it will be forward\nI can't pull no punches, baby doll\nThe gods have approved\nThe universe is in tune with me and you\nThat's why we here involved\nI'm too in love\nWhat you do this for?\nYour body moves and fluid motion\nHands in two and two\nWho's it for? Ooh, it's yours\nI don't know if I'm the one you want to stay with\nBut I know that I'm the only one who makes you cum\n\n[Chorus]\nAnd as soon as I break down the wall\nI'm riding the wave of your waterfall\nAs soon as I break down the wall\nI'm riding the wave of your waterfall\nAs soon as I break down the wall\nI'm riding the wave of your waterfall\n\n[Outro]\nOoh, don't touch me baby\nDon't touch me baby\nWait, I'm okay, I'm alright\nGive me space, don't touch me baby", "Heart Don't Stand a Chance": "\n[Chorus]\nOoh, champagne pourin' down\nArms, legs wrapped around you\nOoh, champagne, let it fall down\nArms, legs keep grabbing\n\n[Verse 1]\nSee, I be catchin' you starin', be careful\nThough I don't mind, it's a dangerous place to be left in\nBut keep your eyes on me\nYour heart don't stand a chance\nIt feels like it's been far too long\nYour knees can't hold your legs\nYour feet just want to pace\nThe eyes keep me all in a trance\nLet me ask you\nWould you leave it all in the back of your head\nOr all in the palm of my hand?\nAin't nobody holding you back\nDon't it feel like it's been far too long, girl?\nYour heart don't stand a chance\nYour knees just want to break\nYour eyes keep me all in a trance\nAnd let me ask you\nI know the approach is so far from what you're used to\nBut you know it\nAnd do I hold a candle to the last one over your moon?\nBaby, of course I do\nAnd I'm not closing my tab\nDon't it feel like it's been far too long, girl?\nYour heart don't stand a chance\n\n[Chorus]\nOoh, champagne pourin' down\nArms, legs wrapped around you\nOoh, champagne, let it fall down\nArms, legs keep grabbing\n\n[Verse 2]\nTwo-step in the corridor\nSpinning the greatest hits of Hall &amp; Oates\nOpen of chronic smoke\nI know my time will flee\nBut your heart don't stand a chance\nIt feels like it's been far too long\nThe moment is all that we have\nMy meter should be up by the half\nA ticket is the least of my cares\nSo let me ask you\nAm I dreaming?\nMind on a tip of a cloud\nOr is it real as the stone in your crown?\nSay, ain't nobody towing my Jag\nDon't it feel like it's been far too long, girl?\nYour heart don't stand a chance\nI'm waiting for the white flag\nYou're talking with the blunt in your hand\nAnd won't you pass that?\nI know, in the morning\nThe sunlight cover your wounds\nBut I'm hoping that I look the same as the way you always knew\nBaby, of course, I flew\nBut I'm not over what we had\nDon't it feel like it's been far too long, girl?\nYour heart don't stand a chance\n\n[Chorus]\nOoh, champagne pourin' down\nArms, legs wrapped around you\nOoh, champagne, let it fall down\nArms, legs keep grabbing\n\n[Skit]\nI remember being tumbled around and not being able to get to the surface where the air was\nAnd looking down and seeing my body spinning around in the white water", "Silicon Valley": "\n[Verse 1]\nYeah, all of that ass you carrying\nYou gotta be shitting me\nAll that body that you came with\nBut where are you mentally\nI know he hit all the time\nBut you ain't gonna hit for me\nI just wanna focus on and love this\nWhat's behind them tig-ol-bitties\n\n[Pre-Chorus]\nThey say the heart is underneath\nUnderneath and guarded in securities\nI finally found the key\nUnderneath the garments that's the double D's\n\n[Chorus]\nOpen your heart, X spots the mark, baby\nDon't turn a frown, make an ass out yourself, baby\nOpen your heart\nWhat's behind them tig-ol-bitties\n\n[Verse 2]\nI don't mind them little bitty berries\nYou my Ju-Ju-Be\nI don't need nothing to distract me\nFrom this connectivity\nYou know I see it all the time\nThe same old shit to me\nI just wanna know what's under\nThat tender titty meat\n\n[Pre-Chorus]\nThey say the heart is underneath\nUnderneath the guard of insecurities\nI finally found the key\nUnderneath the garments that's the double D's\n\n[Chorus]\nOpen your heart, X spots the mark, baby\nDon't turn a frown, make an ass out yourself, baby\nOpen your heart\nWhat's behind them tig-ol-bitties\n\n[Verse 3]\nBefore you go and pop that bottom baby\nBefore you go and get butt naked baby\nI know you gotta little bit of baggage baby\nNever mind I'm a look past it\nBig cans in the cooler, let me handle it baby\nTwo jugs I'm gonna start grasping you baby\nSeparation between truth and the fake\nYou can get a new rack for five k\nYou can get a rapper by Friday\nYou gon' have to replace being cheapskate, just save it\nCan a nigga squeeze or should I just be safe\n(Yeah for-sure) Tell me what it reads on the expiration date\n(Well I just got them, should be good for about ten years or so)\nI know you feel the D when a nigga deep in the hole\nBut do you feel the peace when I'm sucking them, baby doll?\n(Can you fuck me already?)\n\n[Chorus]\nOpen your heart, X spots the mark, baby\nDon't turn a frown, make an ass out yourself, baby\nOpen your heart\nWhat's behind them tig-ol-bitties\nOpen your heart, X spots the mark, baby\nWhat's behind them tig-ol-bitties\n\n[Skit]\nFor me I can't live in the Northern Hemisphere\nI must live, back, back in the time\nWhere all these animals, all this sea life, all the oysters, shellfish, crustaceans, everything is part of the smell\nEverything has come into the focus of the full experience", "Parking Lot": "\n[Intro]\nYou told me your whole life story in a few shorts\nAll the while, I never knew the tone of your voice\nA half an hour, I ramble on way too much\n(My love)\nAlone with my own thoughts\n(My love)\n(1, 2, 3, come on-) Enough is enough\n\n[Verse 1]\nThere's a plain way to call it, but it's never that obvious for me\nI'm in a communion, I got needs\nThe combination of all my life's complaints and a few strong dreams\n(Come on, you f-)\nI don't remember the parking lot\nI just remember it's all the same\n(Come on, you f-)\n(My love)\nAnd it's all the same\n(My love)\n\n[Chorus 1]\n1, 2, 3, come on, you feel me\n1, 2, 3, come on, you feel me\n1, 2, 3, come on, you feel me\n1, 2, 3, come on-\n(Remember it's all-)\n1, 2, 3, come on, you feel me\n1, 2, 3, come on, you feel me\n1, 2, 3, come on, you feel me\n1, 2, 3, come on-\n\n[Verse 2]\nBring the corners from left to right\nI'm in the mode to take you to crossfade\nComing closer to midnight\nAnd I'm wide awake\nAnd ain't you afraid to fade?\nCouldn't wait to get you naked on the first date\nBut you made me wait\nSo it takes one to make one\nThe compromise we made\nPlease believe me\nI don't recall the parking lot\nI just remember it's all the same\nAnd it's all the same\nIt's all the s-\n\n[Chorus 2]\n1, 2, 3, come on, you feel me\n1, 2, 3, come on, you feel me\n1, 2, 3, come on, you feel me\n1, 2, 3, come on-\n(My love)\nCome on, you feel me\n(My love)\nCome on-\n(Remember the parking lot)\nCome on, you feel me (My love)\nCome on, you feel me\n1, 2, 3, come on, you feel me (My love)\n1, 2, 3, come on-\nCome on, you feel me (My love)\nCome on, you feel me (It's all the same)\n1, 2, 3, come on, you feel me (My love)\n1, 2, 3, come on-\n\n[Outro]\n1, 2, 3, come on, you feel me\nCome on, you f-\n1, 2, 3\nFeel me\n(Have mercy, baby!\nCan you dig it? Can you dig it?)", "Put Me Thru": "\n[Verse 1]\nWhy the hell would you run this game?\nBoth my hands are tied\nAfraid of thinking I dug my own grave\nFuck around with this\nStrange and elusive, too afraid to lose it\nI don't mind this pain\nMost nigga's want you for your candy\nThey'll never know just how long it takes\nI wave my own pride\nAnd put it all on the line\n\n[Chorus]\nThere I go, volunteering, punish me\nSelf inflicted pain, sickness over you\nWay over you\nHere I stay, time to time\nIt must be what you put me through\nIt must be what you put me through\n\n[Verse 2]\nA little while longer\nA bit more time\nWhy would you run these thoughts across my mind?\nPlease, relieve me\nAs cool as I remain\nThere's a point in which I'll lose my self restraint\nSay, love, most niggas would've left you lonely\nI fancy throwing it all away\nI see it to my own demise\nHow much longer will I let it ride?\n\n[Chorus]\nThere I go, volunteering, punish me\nSelf inflicted pain, sickness over you\nWay over you\nHere I stay, time and time\nIt must be what you put me through\nIt must be what you put me through\n\n[Outro]\nIt must be what you put me through\nIt must be what you put me through\nIt must be what you put me through", "Celebrate": "\n[Intro]\nTime never cares, if you're there or not there\nAll you ever needed was a simple plan\nBut you're doing well, I mean you're not dead\nSo let's celebrate while we still can\n\n[Verse 1]\nI know what they say, I could give or care\nThey talk so much on me, I must be doing something right\nI saw my son today, in the likeness of a full grown man\nSo I'll celebrate while I still can\n\n[Chorus]\nOn a clear day you can see West LA, even downtown\nI remember where I couldn't even see the point\nOf stepping out the mother fucking house\nLet it go, let it go, let it go, let it go, let it go\nI came to fix up the tree that's [?] came to far\n\n[Verse 2]\nHow many others have walked the same ground you have\nYou will be wise to pay attention to your old head\nI spent the whole day throwing records in the deep end\nSo let's celebrate while we still can\n\n[Verse 3]\nCaptivated, the fruits of my family tree\nWhere would I be without you\nWhat would you do without me\nIt would be a bad look talkin' bout what could of been\nSo let's celebrate while we still can\n\n[Chorus]\nOn a clear day you can see West LA, even downtown\nI remember where I couldn't see the point\nBut I got it figured out now\nLet it go, let it go, let it go, let it go, let it go\nI came to fix up the tree that's [?] came to far\n\n[Piano Riff]\n\n[Verse 4]\nDo not be concerned about the money in your brother's hand\nWhat's mine is yours\nI thought you knew me better than that\nI was under the impression that we all want the best of life\nSo let's celebrate while we still can\n\n[Skit]\nThe partnership of the board and the body of the fellow that is doing the maneuvers in the fluent directions with the-with this wave is what interests me. Now chaotic surfing, nervous surfing, and uh, surfing power has its merits. And I, uh, I can-it fascinates me. That's just not my direction. I can only speak for myself", "Come Down": "\n[Intro]\nYou niggas got me high\nNiggas, tell me how?\n\n[Verse 1]\nHey! Well that's exactly what a nigga came for\nHuh, you doin' shots from afar\nI'm a meet you at your front door\nUh, so hard to be doing what you really meant for, beauty\nHuh, but don't I make it look easy\nDon't I make it look good\n\n[Chorus]\nNow you, drank up all my liquor, come on\nWhat I'm 'posed to do now?\nAnd you talkin' all that shit, now come on\nYou gonna have to back it up\nIf I get too high now, sugar, come on\nI might never come down\nYou know I might never come down\nLet me get down\nYou might not never come down\nNow let me come down\nYou might not never come down\nLet me get down!\n\n[Bridge]\nYou may never ever come down\nIt took too long to get this high off the ground\nDon't run, just stay awhile\n\n[Verse 2]\nCan't beat it, can't beat it, can't beat it, can't beat it with the big bad door\nCan't see her with this pitch black Gucci frames on\nLet me take these bitches off\nLet me get the full scope, hold up\nHuh, full screen, HD, let me take another picture\nLet me pull it to the pre-show\nWow, Cool beans, cool beans\nThat's a whole lot of reefer\nLet me help you with the pre-roll\n\n[Chorus]\nYou, drank up all my liquor, come on\nWhat I'm 'posed to do now?\nAnd you talkin' all that shit, now come on\nYou gonna have to back it up\nIf I get too high now, sugar, come on\nI might never come down\nYou know I might never come down\nLet me get down\nYou might not never come down\nNow let me come down\nYou might not never come down\nLet me get down!\n\n[Bridge]\nYou may never ever come down\nIt took too long to get this high off the ground\nDon't run, just stay awhile\nYou may never ever come down\nIt took too long to get this high off the ground\nDon't run, just stay awhile\n\n[Skit]\nBefore Vietnam, when boards were long and hair were short, the center of the surfing world was a place called Malibu", "Carry Me": "\n[Chorus]\nSix years old I tried my first pair of Jordans on\n(Momma can you carry me?)\nIt was late in the fall I caught a glimpse of my first love, my God\n(Momma can you carry me?)\nKnees hit the floor, screams to the Lord\nWhy they had to take my ma?\n(Momma can you carry me?)\nTo the early morn\n(Momma can you carry me?)\nTo the early morning\n(Momma can you carry me?)\n\n[Verse 1]\nHey, hey, hey, gather 'round hustlers\nThat is if you're still living\nAnd get on down before the judge give the sentence\nA few more rounds before the feds come and get you\nIs you gonna smile when your date gets issued\nYou know them feds taking pictures\nYour mom's in prison, your father need a new kidney\nYou family's splitting, rivalries between siblings\nIf cash ain't king it's damn sure the incentive\nAnd good riddance\n\n[Interlude - Sample]\nQ: Is the element of danger an important factor for the members of your peer group?\nA: Yes, you might say that. Why don't you give it a try and find out for yourself?\n\n[Verse 2]\n'Bout the year Drizzy and Cole dropped\nBefore K.Dot had it locked\nI was sleeping on the floor, newborn baby boy\nTryna get my money pot so wifey wouldn't get deported\nCursing the heavens, falling out of orbit\nTryna roll this seven, tryna up my portion\nWhat about your goals? What about your leverage?\nSo they don't force you into some hole\nWhat's the meaning of my fortune meeting?\nWhen I crack the cookie all it said was \"keep dreaming\"\nWhen I look at my tree, I see leaves missing\nGenerations of harsh living and addiction\nI came to visit during the seven year stint\nBut they wouldn't let me in because my license suspended\nNow I'm scraping the pennies just to kiss you on your cheek\nIt's gonna be a couple weeks before I get it\nI know you miss me\n\n[Chorus 2]\nSix years old I tried my first pair of Jordans on\n(Momma can you carry me?)\nIt was late in the fall I caught a glimpse of my first love, my God\n(Momma can you carry me?)\nKnees hit the floor, screams to the Lord\nWhy they had to take my ma?\n(Momma can you carry me?)\nTo the early morn\n(Momma can you carry me?)\nTo the early morning\n(Momma can you carry me?)\n\n[Bridge]\n(Momma can you carry me?)\n(Momma can you carry me?)\n(Momma can you carry me?)\n(Momma can you carry me?)\nYeah, oh, oh, oh\nAnd one of these is my rise\nOne of these is my downfall\nAnd I'm the one to make it right\nI wanna make it right\nAnd one of these is my rise\nOne of these is my downfall\nAnd I'm the one to make it right\nI wanna make it right\nI wanna make it right\nI wanna make it right\n(Momma can you carry me?)\nTo the early morning\n(Momma can you carry me?)\nTo the early morning\n(Momma can you carry me?)\nOh lord\n(Momma can you carry me?)\n(Momma can you carry me?)\n(Momma can you carry me?)\n(Momma can you carry me?)\n(Momma can you carry me?)\n\n[Outro: Sample]\nPsychologist: I see here they call you a masochist\nLeroy the Masochist: I like pain\nPsychologist: Can you be specific? What kind of pain do you like?\nLeroy the Masochist: Any kind of pain", "The Season": "\n[Chorus 1]\nMy faith is buried somewhere underneath the town\n(Until it's paid for)\nStrawberry season, my sweetheart is coming 'round\n(I hear it rain and pour)\nHow did you find me here? It must be perfect timing\n(Forever grateful)\nIf I didn't love you then I damn sure love you now\n(Fruit of your labor)\n\n[Verse 1]\nSay ain't shit change but the bank statements\nSpent the summer in the rave with the beach babies\nThrew your chula in the buggie\nWith the top down up the PCH\nI'm heading north, I hope it doesn't rain\nWent from playing community ball to balling with the majors\n(Oh, what you major?)\nYeah nigga I ran bases, pitch flame\nI call plays, remove labels\nAnd fuck fame, that killed all my favorite entertainers\n(Nothing short of amazing, ooh yeah)\nBut I'm short on my patience\nSee, I don't play that shit, I don't ever forget\nAnd don't forget that dot, nigga you paid for it\nI spent years being called out my name\nLiving under my greatness\nBut what don't kill me is motivation\n\n[Chorus 1]\nMy faith is buried somewhere underneath the town\n(Until it's paid for)\nStrawberry season, my sweetheart is coming 'round\n(I hear it rain and pour)\nHow did you find me here? It must be perfect timing\n(Forever grateful)\nIf I didn't love you then I damn sure love you now\n(Fruit of your labor)", "Your Prime": "\n[Skit]\n(Do you have girlfriends?)\nYou pickin' on me?\n(No, why are you saying that?)\nWhy are you picking on me?\n(Why would I do that? Now let me ask you this question)\nWhy you pickin' on me?\nShut up and sit down! I told you to sit down!\n\n[Chorus]\nDon't use it all at once\nBaby girl, your prime is about that long\nDon't use it, timing is all we got\nBaby girl, your prime is about that long\n\n[Verse]\nOh, hell no\nI had to get back for the candy, uh\nI flew for an hour then landed, oh\nShe live on a beautiful campus, oh\nShe dumb as a brick but she pass all her classes\nKnow what she want and she know I ain't shit but a savage, ooh\nShe soaking up game\nHer brain is a series of pamphlets, wow\nShe told me a story as long as her lashes\nOh what a hopeless romantic\nFucking with jokers and addicts\nShe told me everybody close to her age is full of mad shit\nI said, 'Baby girl, you ain't even old enough to be jaded'\nAnd wow, she want visual stimulation\nShort attention span and little patience\nI like Hennessy and record players\nTeddy Pendergrass and Sammy Davis\nOpposites attract. I swear, we a magnet\nDon't be fucking up your scholarship\nI can't help you with grants\nWord to my father, my word and my balls is 'bout all that I honor\nAs God is my witness if you don't jump back in this bed\n\n[Chorus]\nDon't use it all at once\nBaby girl, your prime is about that long\n(Do what you want, what you want, as long as you jump in the bed)\nI only want to do what feels right\nI have to be gone before the midterms\nYou making up your mind, you're out of songs aren't you?\nI wanted an encore, more tunes\n\n[Bridge]\nHey, come back to bed\nCome back to bed, come back to bed with me, ah\nCome jump in the bed, jump in the bed with me, ah\nCome back to bed, come back to bed with me, ah\nCome jump in the bed, jump in the bed with me, ah\nCome back to bed, come back to bed with me, ah\nCome jump in the bed, jump in the bed with me, ah\nCome back to bed, come back to bed with me, ah\nCome jump in the bed\n\n[Chorus]\nDon't use it all at once\nBaby girl, your prime is about that long\nTiming is all we got\nBaby girl, your prime is about that long"}, "Venice": {"Milk n' Honey": "\n[Intro]\nNah-nah-nah, nah-nah\n\n[Verse 1]\nWent from chicken shit ho to magnificent pro\nShoppin' bags at the grove, MCM on the coat\nHad to clean up her nose, had to dream up some goals\nSwimming in Fendi business that's probably owned\nI was walking down 6th, she pulled up in a 6\nShe said \"Hop in this whip, \" I said \"Bitch, you the feds\"\nShe said \"Baby, don't trip, \" then she rolled me a spliff\nShowed me pics of her kids, then she slid me some bread like\n\n[Bridge]\nIt's yours, babe, cause I got big money\nSo if you need something, don't be ashamed\nIt's yours, babe, cause you got big lovin'\nSo go and spend somethin', I said okay\nI said okay (All I need... good love)\nI said okay (Hey)\nI said okay (All a nigga need, yeah... good love)\nI said okay (Uh-huh)\n\n[Chorus]\nAnd now\nI'm swimming in milk n' honey, I'm swimming in milk n' honey\nSwi-swimming in milk n' honey, swimming in milk n' honey\nI'm swimming in milk n' honey, swi-swimming in milk n' honey\nDick in this bitch's stomach (Spending this bitch's money)\nI'm swimming in milk n' honey, I'm swimming in milk n' honey\nSwi-swimming in milk n' honey, swimming in milk n' honey\nI'm swimming in milk n' honey, swi-swimming in milk n' honey\nDick in this bitch's stomach (Spending this bitch's money)\n\n[Verse 2]\nIt's too good to be true, I ain't got nothin' to do\nI got keys to the coupe, I just spent all this loot\nShe said \"Get what you want, \" she said \"Live how you do\nBut If I catch you with other bitches, your throat - I'm a slit\"\nI said \"It's yours, babe, I put your name on this dick\"\nBut I was lyin' of course, I'm slammin' chick after chick\nSoon as she gave me the Porsche, I bang her right on the strip\nI copped some white on the 5th and pulled up right on a bitch like\n\n[Bridge]\nIt's yours, babe, cause I got big money\nSo if you need something, don't be ashamed\nIt's yours, babe, cause you got big lovin'\nSo go and spend somethin', I said okay\nI said okay (All I need... good love)\nI said okay (Hey)\nI said okay (All a nigga need, yeah... good love)\nI said okay (Uh-huh)\n\n[Chorus]\nAnd now\nI'm swimming in milk n' honey, I'm swimming in milk n' honey\nSwi-swimming in milk n' honey, swimming in milk n' honey\nI'm swimming in milk n' honey, swi-swimming in milk n' honey\nDick in this bitch's stomach (Spending this bitch's money)\nI'm swimming in milk n' honey, I'm swimming in milk n' honey\nSwi-swimming in milk n' honey, swimming in milk n' honey\nI'm swimming in milk n' honey, swi-swimming in milk n' honey\nDick in this bitch's stomach (Spending this bitch's money)\n\n[Verse 3]\nI got gold, I got ice, I got Polo and Nikes\nI got lean, I got Sprite, 'bout to spend a couple racks in one night\nAnd mothafuckas wanna tell me take it light\nMothafuckas wanna tell me take it easy\nI don't need no one's advice, niggas all wanna be me\nI was riding down 6th and got stop by the pigs\nThey said \"Hop out the whip, \" I said \"Fuck did I do?\"\nThey said \"Pop up the trunk, \" I'm like pop up this dick\nThey said \"Don't make us shoot, \" they said \"Don't make a move\"\nI was high as a kite, I had Xannies and white\nI looked up at the light, like what the fuck is my life\nThey said my plates ain't legit, so they opened my shit\nAnd when they opened my shit, it was snow in a fridge\nI felt dumb as a brick, I had no idea\nShe had stolen the whip and this bitch had warrants and shit and\nThis bitch pulled multiple licks and this bitch had bodies on burners\nAnd when I called her from my cell, the only message I heard was\n\n[Outro]\n(It's yours, babe)\nI mean you gotta do what you gotta do\nDon't scr... don't say a fucking word\n(It's yours, babe)\nNo, you don't say shit\nNow I'm gone, I'm on a plane, babe\n(It's yours, babe)\nBut no, you wanted to spend the money\nYou wanted to live, you know, wanted to live large\nYou got new sneakers and all that\nSo now you deal with them bricks\n(It's yours, babe)\nNa-na-na-nah, nah, I can't do nothing for you\nI told you I'm on a G5, I'm gone\nI'm too gone, I gotta go now\nYou say my fucking name - you a dead man\n(I said okay)", "Off the Ground": "\nIf it's really what you needed, love\nBaby this right here's a world of fun\nBut you can get this hit whenever you want\nSo here you are now\nAnd it's on now\nAnd it's on right now\nHere you are now\nAnd it's on now\nAnd it's on right now\nHere we are now\nAnd it's on now\nAnd it's on\nSuddenly suddenly suddenly\nOff the ground\nI'm lifting it up\nSending it sending it sending it\nOff the ground\nI'm lifting it up\nCooling it cooling it cooling it\nCool it down\nI'm lifting you off the ground\nI'm getting you off\nIt's on right now\nSuddenly suddenly suddenly\nOff the ground (off ground)\nI'm lifting it up (up)\nSending it sending it sending it\nOff the ground (off ground)\nI'm lifting it up (up)\nCooling it cooling it cooling it\nCool it down (cool down)\nI'm lifting you off the ground (off ground)\nI'm getting you off (up down)\nIt's on right now\nSend it off, send it off, in and out\nGive it all, give it all, give it out\nThere we are, there we are, here and now\nLet it all come out, let it all come out\nI can move it to wherever you are\nWe can live this life forever more\nBaby this right here is a one on one\nBut you can get this dick whenever you want\nSo here we are now\nAnd it's on now\nAnd it's on right now\nHere we are now\nSuddenly suddenly suddenly\nOff the ground\nI'm lifting it up\nSending it sending it sending it\nOff the ground\nI'm lifting it up\nCooling it cooling it cooling it\nCool it down\nI'm lifting you off the ground\nI'm getting you off\nIt's on right now\nSuddenly suddenly suddenly\nOff the ground (off ground)\nI'm lifting it up (up)\nSending it sending it sending it\nOff the ground (off ground)\nI'm lifting it up (up)\nCooling it cooling it cooling it\nCool it down (cool down)\nI'm lifting you off the ground (off ground)\nI'm getting you off (up down)\nIt's on right now\nSuddenly suddenly suddenly\nLet it be yours, let it carry you\nSweep the fear from your heart\nIf you need it then go there\nIf you see what you want, then go there\nLet it be yours, let it carry you\nSweep the fear from your heart\nIf you need it then go there\nIf you see what you want, then go there\nLet it be yours, let it carry you (yours, carry)\nSweep the fear from your heart (fear, heart)\nIf you need it then go there (need, go there)\nIf you see what you want, then go there\nLet it be yours, let it carry you (yours, carry)\nSweep the fear from your heart (sweep the fear from your heart)\nIf you need it then go there (if you need you can go there)\nIf you see what you want, then go there (f you see what you want, then go there)\nLet it be yours, let it carry you (let it be yours, let it carry you)\nSweep the fear from your heart (sweep the fear from your heart)\nIf you need it then go there (if you need you can go there)\nIf you see what you want, then go there (f you see what you want, then go there)\nLet it be yours, let it carry you (let it be yours, let it carry you)\nSweep the fear from your heart (sweep the fear from your heart)\nIf you need it then go there (if you need you can go there)\nIf you see what you want, then go there (f you see what you want, then go there)\nLet it be yours, let it carry you (let it be yours, let it carry you)\nSweep the fear from your heart (sweep the fear from your heart)\nIf you need it then go there (if you need you can go there)\nIf you see what you want, then go there (f you see what you want, then go there)", "Paint": "\n[Pre-Chorus]\nUgh, that what you need? (ugh say)\nUgh, you need\nSay, is that what you need?\nUgh, you need\n\n[Chorus 1]\nAll I see is angels, demons\nSoft lights a bitch sounds\nFrom your first dream that be a sinner\n\n[Verse 1]\nRunning like your running for the gold one (gold one)\nBack and forth of course it's never no one\nThey just want to frame you in the same shit (same shit)\nNever been afraid to let it go (let it go)\n\n[Chorus 2]\nI just want to run it on the canvas\nBrushes stroke is stroking but she go nuts\nSpeak of me as something you can ride on\nGuess how many pages put you open up the gate and get it\n\n[Chorus 3]\nAll day, no breaks\nAll day, no breaks\nMix it, clip it, switch it then\nChange it, no breaks\nAll day, no breaks\n\n[Post-Chorus]\nPaint, paint, paint\nChange it\nPaint, paint\nCh' Change it\n\n(Ehh Ohh Ehh)\n\n[Chorus 4]\nAll I see is angels, demons\nSoft lights a bitch sounds\nFrom your first dream that be a sinner\nExcuse for me not to to keep you creaming\nCreaming, creaming, creaming, creaming\n\n[Verse 2]\nDifferent, different colours that your changing (paint, paint)\nA million ways a minute till it blows up (change it)\nFighting on your face, just face it (face it)\nTake it till you say it\nI am going to open up your place and paint it\n\n[Chorus 3]\nAll day, no breaks\nAll day, no breaks\nMix it, clip it, switch it then\nChange it, no breaks\nAll day, no breaks\n\n[Pre-Chorus]\nUgh, that what you need (ugh say)\nUgh, you need\nSay, is that what you need?\nUgh, you need\n\n[Chorus 1]\nAll I see is angels, demons\nSoft lights a bitch sounds\nFrom your first your first dream be a sinner\n\n[Verse 3]\nLooking like you woke up got a dreaming\nFishing where you living but there's no luck\nWho can paint the picture like dale\nMixing different colours what I can do\n\n[Chorus 2]\nI just want to run it on your canvas\nStroking but she pushes stroking but she go nuts\nSpeak of me on something you can ride on\nGuess how many stages put you open up the gates and get it\n\n[Chorus 3]\nAll day, no breaks\nAll day, no breaks\nMix it, clip it, switch it then\nChange it, no breaks\nAll day, no breaks\n\n[Post-Chorus]\nPaint, paint\nChange it\nPaint, paint\nChange it", "I Miss That Whip": "\n[Verse 1]\nI don't miss her one bit\nMaybe a little bit\nSomedays I think about it\nBut I get over it real quick\nIt's too late to make amends\nWe could never be friends\nI don't miss a warm bed\nI miss that whip\n\n[Chorus]\nDamn, that whip\nI miss that whip\nThat whip, that whip, that whip\nI miss that whip\n\n[Verse 2]\nShe used to scoop me from the train station\nHave a smoothie and a rented movie, pre-rolled J waitin'\n(That whip, I miss that whip)\nShe didn't care about the reach\nFrom the De Longpre to Long Beach\n(That whip, that whip, that whip, that whip\nI miss that whip)\n\n[Chorus]\nAnd damn, that whip\nI miss that whip\nThat whip, that whip, that whip\nI miss that whip", "Drugs": "\n[Chorus]\nShe don't give a fuck\nShe don't ever stress me\nWe don't even talk\nAll we do is sex and leave\nNo there's no love\nShe don't even like me\nBut if we have drugs\nShe can be my wifey\nWhen we have drugs [x4]\n\n[Verse 1]\nI got lost up in it, got lost up in it, got high for a minute\nSaid my lust for life and these lights are bright and I love these women\nSaid we bopping slow and we do the dance like we more than winning\nSaid she off the beat but she's fine as fuck so I find the rhythm\nNo love is greater, in this whole world we made up\nThis love is made-up, it's made-up\nIt's made-up, it's made-up, it's made-up (say, aye)\nI don't know this bitch but I love this shit and we both feel splendid\nAnd she loud as fuck so I grab and touch and she don't get offended\nThey goin call the law if we don't get lost in [?] parking lot\nShe don't like me dog, she just like the drugs my nigga, don't get it twisted\n\n[Bridge]\nHow many more can you give to me?\nHow many more can you give to me? I know you're feelin me\nGrinding and biting and kissing me\nWho gives a fuck bout your history? nobody mentioned it\nI coulda taken them all, I coulda taken them all, look at me dog\nLook at me dead in the eyes, tell me you ain't in love\n\n[Chorus]\nShe don't give a fuck\nShe don't ever stress me\nWe don't really talk\nAll we do is sex and leave\nNo there's no love\nShe don't even like me\nBut if we have drugs\nShe can be my wifey\nWhen we have drugs [x4]\n\n[Verse 2]\nYou my one and only, my one and only, I'm on one homie\nI don't know your name I just love that ass, and I'll pull that pony\nSaid I hate the club, but I make the club when I walk into it\nSaid you hate the drink, but you take the drink when I offer fluid\nNo love is greater, in this whole world we made up\nThis love is made-up, it's made-up, it's made-up, it's made-up, it's made-up\nI can say right now that I'll lay you down, I got lots of rubbers\nI don't give a fuck, you don't give a fuck, we was made for each other\nYour friend ain't cute but my nigga's a trooper, he'll take the L\nI'm high as fuck and you high as fuck so we parasailing\n\n[Bridge]\nHow many more can you give to me?\nHow many more can you give to me? I know you're feelin me\nGrinding and biting and kissing me\nwho gives a fuck bout your history, nobody mentioned it\nI coulda taken them all, I coulda taken them all, look at me dog\nLook at me dead in the eyes, tell me you ain't in love\n\n[Chorus]\nShe don't give a fuck\nShe don't ever stress me\nWe don't really talk\nAll we do is sex and leave\nNo there's no love\nShe don't even like me\nBut if we have drugs\nShe can be my wifey\nWhen we have drugs [x4]\n\n[Outro]\nAyyy, Ayyyyy, we have drugs\nWhen we have drugs\nSaid ayyy, We love it, we're in love\nWe're in love, we're in love, we're in love\nSaid ayyy, yes lord\nAyyy, shout em niggas ayyy\n(Mumbling)\nSay love, say love, say love", "Might Be": "\n[Chorus]\nI get the feelin' that ya might be\nDid I turn you on? You can tell me if I'm wrong\nBut I'm feelin' that ya might be\nAnd we ain't even smoke but you swear I got that dope\nAnd I'm thinkin' you'd like to be\nEvery word I speak got you floatin' off your seat\nAnd I'm knowin' that you like me\nOh you high baby, high baby\n\n[Verse 1]\nOkay, the blunt is rolled up\nNobody lit it\nSaid even if we don't puff\nWon't make a difference\nMy body's leaning to the right baby\nYou tell me 'go on and spend the night baby? '\nNo, I don't even know ya\nI know enough to get you high baby\n\n[Pre-Hook]\nI got about a half an ounce of that tree\nGot about a half a cup of that lean\nI said go on and kick your feet up\nI'm a go ahead and twist the weed up\nShe said cool to say what I think\nI said go and do what you feel\nShe said bend me over that sink\nI said damn your wish is my will\n\n[Chorus]\nI get the feelin' that ya might be\nDid I turn you on? You can tell me if I'm wrong\nBut I'm feelin' that ya might be\nAnd we ain't even smoke but you swear I got that dope\nAnd I'm thinkin' you'd like to be\nEvery word I speak got you floatin' off your seat\nAnd I'm knowin' that you like me\nOh you high baby, high baby\n\n[Verse 2]\nOkay, I'm feelin' so stuck\nLaid up on the couch, got fingers in your mouth\nGirl, bring it closer\nBefore my high comes down, my high comes down\nGirl, I can barely keep my eyes open\nYou say you tryna get your spine blown in\nNo, I don't even know ya\nI know enough to get you high floatin'\n\n[Pre-Hook]\nI got about a half an ounce of that tree\nGot about a half a cup of that lean\nI said go on and kick your feet up\nI'm a go ahead and twist the weed up\nShe said cool to say what I think\nI said go and do what you feel\nShe said bend me over that sink\nI said damn your wish is my will\n\n[Breakdown]\nFeelin' that ya might be\nOh tell me are you high, baby\nI get the feelin' that ya\nTell me you high as me?\nOh tell me are you high?\nTell me you high? Are you high, are you high as me?\nOh tell me are you high?\nTell me you are, tell me are you high as me?\n\n[Chorus]\nI get the feelin' that ya might be\nDid I turn you on? You can tell me if I'm wrong\nBut I'm feelin' that ya might be\nAnd we ain't even smoke but you swear I got that dope\nAnd I'm thinkin' you'd like to be\nEvery word I speak got you floatin' off your seat\nAnd I'm knowin' that you like me\nOh you high baby, high baby", "Get 'Em Up": "\n[Intro]\nAll up in the air\nAll up in the air\n\n[Verse 1]\nKim plays with the heart strings\nLate nights in the basement\nKills me with them soft notes\nOffbeat placements\nSo sweet with the long notes\nBlue dream with the light glow\nI'll wait for the next show\nBut if you leave then I might roll\nOn your marks\nWhen you're ready\nLet me start\nOkay, two shots and a slow dance\nWe walk to your home...\nKeep up, keep up, keep up if you can\n\n[Pre-Chorus]\nSomething different ain't it\nNothing like we planned\nThis ain't complicated\n\n[Chorus]\nAll up in the air, all up in the air\nWe walk in the same directions with no common plans\nJust the nature of a man, prob'ly cover good good good\nAll up in the air\nAll up in the air\nAnd if it's love, then it's love\nAnd if it's not love then it's all love\nAll up in the air, All up in the air\nAnd if it's love, then it's real\nAnd if it's not love then it's no deal\nAll up in the air, all up in the air\n(Get em up)\nAll up in the air\nAll up in the air\nAll up in the air\nAll up in the air\n\n[Verse 2]\n(Yeah), Slow dance in your compound when you're off that brown\nFreelance in your hometown and it's good work now\nSet it all down\n(Set it all down)\nSet it all, set it all, set it all back down\n(Yeah) On your marks\nWhen you're ready\nLet me start, (okay)\nSmooth talking and they stare\nHow often are you here?\nKeep on, keep on, keep on if you care\n\n[Chorus]\nSomething different ain't it?\nThis ain't like we planned\nThis ain't complicated\nAll up in the air, all up in the air\nWe walk in the same direction with no common plans\nGuess it's just the nature of a man\nProb'ly cover good good good\nAll up in the air, all up in the air\nAnd if it's love, then it's love\nAnd if it's not love then it's all love\nAll up in the air, all up in the air\nAnd if it's love then it's real\nAnd if it's not love then it's no deal\nAll up in the air, all up in the air\n(Get em up)\nAll up in the air, all up in the air\nAll up in the air, all up in the air\nEnd", "The City": "\n[Intro: Spoken]\nVenice, California\nKnown then as \"Venice: Slum by the Sea\"\n\n[Verse 1]\nThere's no need to wear these shades when I drive\nI need to see the leap before the stride\nThere's so much more that can happen\nI'm sure that you can imagine\nI live around here\nLet me show you how to walk it, stop the traffic\nThem two legs will get you right for action with good brain\nThat get you all the answers\nThat get you all the cash and fashion, just bat your lashes and\n\n[Chorus]\nTell me where you wanna go\nBut I don't really think that it could get much better\nThe city I love, city I love, city I love\nYou tellin' me you wanna break free, I bet you never\nBet you never\nPowder your nose, love\nSmoke if you want to\nPut your feet in the water\nThe city belongs to you girl\nIt's all for you\nTell me where you wanna go (It's all for you)\n\n[Verse 2]\nSo when you're living the dream is it hard to see\nDoes your heart beat heavenly\nI think it's much more than the green leaf but it helps of course\nThere's only one season\nCan you believe the way that they talk about my paradise\nWe don't need that kind of vibe, no no\n\n[Chorus]\nDon't tell me where you're from girl\nTell me where you wanna get to\nThe city I love, city I love, city I love\nYou wanna break free on me, I bet you never\nBet you never\nPowder your nose, love\nSmoke if you want to\nPut your feet in the water\nThe city belongs to you girl\nIt's all for you\n\n[Outro]\nDon't tell me where you're from girl\nTell me where you wanna get to\nPut your feet in the water\nThe city belongs to you girl\nIt's all for you\nTell me where you wanna go (It's all for you)", "Dogtown": "\nDogtown is what the kids call their hometown Venice, Venice California\nIt's one of the showplaces in good ol' American self-expression\nHere you do your thing and the world watches", "Put You On": "\n[Verse 1]\nYou cold, you cold, you the coldest\nI just wanna know who put you on it\nHow much do you teach her?\nKnowledge is the motherfucking key\nNew move, got a lot of 'em\nRemember when you only knew how to ride on it\nNow you be tossing it like Serena\nAnd I'm a run it back like a re-run\n\n[Chorus]\nWho put you on, who put you on to that?\nYou didn't know about nothing\nNow you know all about nothing\nI put you on to that\nNow look at you\nWho put you on to that?\nYou didn't know about nothing\nNow you know all about nothing\nI put you on to that\n\n[Verse 2]\nYou know, you know, you my favourite\nI be steady drinking with you baby\nLong strokes to the promise\nRemember you couldn't take it at all\nNew moves, got a lot of 'em\nTell me when the hell you got so long winded\nTalking and walking just like a diva\nNow you gon' hit the news like Aretha\n\n[Chorus]\nWho put you on, who put you on to that?\nYou didn't know about nothing\nNow you know all about nothing\nI put you on to that\nNow look at you\nWho put you on to that?\nYou didn't know about nothing\nNow you know all about nothing\nI put you on to that\n\n[Outro]\nWho put you on\nWho put you on to that\nYou didn't know about nothing\nNow you know all about nothing\nI put you on to that\nNow look at you\nWho put you on to that\nYou didn't know about nothing\nNow you know all about nothing\nI put you on to that", "Luh You": "\n[Verse 1]\nWe must've been together\nI bet you knew just who I was\nSomewhere around your second lifetime\nWe danced on Persian rugs\nWe fucked and fell in love\n\n[Pre-Chorus]\nAnd that is who we are\nToo familiar, so long\nEnergy carried on and on\nRipples in the pond\nLike a mirror, so long\nEnergy carried on and on\n\n[Chorus]\nHey, I think I luh you\nFuck that, I know I do, I know I do, I know I do, I know I do\nI think I luh you\nFuck that, I know I do, I know I do, I know I do, I know I do\n\n[Verse 2]\nFew shots, then we rid them off\nGoofed off, [?] hit the loft\nWith the Scope on I can kill them all\nWe can be lovers two souls in a different life\nBut you know we done here been here before\nHow did you know we only sip clear liquor\nSmoke purple endo, top floor level\nType of shit that get that shit\nFlown across the pond\n\n[Verse 3]\nI think I love you ooooh\nWe must have been together\nIt's something like I thought it was\nAnd with the last impression\nYou left me with an open door\nI want more and more\n\n[Pre-Chorus]\nIt's who we are\nToo familiar, so long\nEnergy carried on and on\nRipples in the pond\nLike a mirror, so long\nEnergy carried on and on\n\n[Chorus]\nHey, I think I luh you\nFuck that, I know I do, I know I do, I know I do, I know I do\nI think I luh you\nFuck that, I know I do, I know I do, I know I do, I know I do\n\n[Post-Chorus]\nEnergy carried on and on (on and on)\nEnergy carried on and on (on and on)\nEnergy carried on and on (on and on)\nEnergy carried on and on (on and on)\n\n[Bridge]\nIn the night I can't quite put my finger on\nWe believe that we are star crossed\nForgive me if I am wrong\nForgive me if I am wrong, spinning off\nEnergy carried on and on\n\n[Outro]\nEnergy carried on and on", "Miss Right": "\n[Verse 1]\nI need the right one\nWith a bright imagination\nSomeone to talk to\nSomebody patient\nI want a cold piece\nI want a love sensation\nI want the mind first\nI'll make the body wait for it (wait for it)\nYou could be the right one\nWith a little dedication\nGotta make me follow through\nGotta make me chase it\nOhh I want a stone groove\nI wanna love sensation\nSomeone to hold to\nSomeone to play with\n\n[Chorus]\nCause lately\nMy whole being\nJust wants\nWhat it needs\nAnd I don't mind\n(I need it\nI just need, need, need)\n\n[Verse 2]\nI want the right one\nCar keys and a cake dish\nGotta take that (pipe work)\nGotta make me (taste it)\nI mean amazing\nYou want my last name (say it)\nWanna have my baby (say it)\nI'll take you all places\nI want the world stage\nCertified classic\nBig planes\nLight baggage (work)\nI got the long reach (work, work)\nYou got that good conversation (work)\nYou such a cold piece\nI wonder if you're taken\n\n[Chorus]\nCause lately\nMy whole being\nJust wants\nWhat it needs\nAnd I don't mind\n(I need it\nI just need, need, need)\nSay it, say it (I just) I need (vamp)"}}, "Anderson .Paak f/ Miki Dora": {"Venice": {"Miki Doralude": "\n[Mike Dora:]\nI don't know, doesn't make a difference to me\nMy whole life is an escape, my whole life is this way\nmight drop into, set the whole thing up, pull out the bottom\nturn, pull up into it, and shoot for my life, going for broke man\nAnd behind me, all the shit goes over my back\nthe screaming parents, teachers, screaming teachers\npolice, priests, politicians, knee boarders, wind surfers\nThey're all going over the [?] into the reef\nhead first into the fucking reef, bwah, and I'm sure of my life\nAnd when it starts to close out I pull out\nto the bottom out, to the back\nand I pick up another one and do the same damn thing"}}, "Anderson .Paak f/ ScHoolboy Q": {"Malibu": {"Am I Wrong": "\n[Intro: Anderson.Paak]\nWell I\nWell I\n\n[Verse 1: Anderson.Paak]\nI'm only comin' out to play\nNothin' more that I hate in this life\nThe wrong impression, I only have one to make\nYou can open your palm\nWaiting to catch a break\nThe cards will fall where they may\nAnd what about me?\nI believe in fate\nThey wanna know where I'll be in five\nWhat about today?\nWhat about tonight?\n\n[Chorus: Anderson.Paak]\nOnly one at a time\nSo precious, is yours, is mine\nOnly one at a time\nMy life, my life\n\n[Bridge: Anderson.Paak]\nAm I wrong to assume\nIf she can dance, then she can't ooh?\nAm I wrong to say\nIf she can dance, then she can't ooh?\n\n[Chorus: Anderson.Paak]\nI never wanna waste your time, my life\nSo precious, is yours, is mine\nAnd look at the time, my God\nSo precious, is yours, is mine\nOnly one at a time\nSo precious, is yours, is mine\nOnly one at a time\nMy life, my life\n\n[Verse 2: ScHoolboy Q]\nSmiles around tHe clock\nDance around tHe globe to Disco 54\nI stare at you in tHe eyes and spin you on your toes\nMusic ain't music witHout soul\nFeelin' tHe top row\nSHut tHe blindfolds, pass tHe nitro\nRock tHe love boat, get HigH or get low\nCHill tHe Merlot, steady your fast pour\nMake love\nDo tHat-tHat-tHat\nBreak you off in your Kit-Kat-Kat\nNever seen a one tHis gorgeous\nPay your wHole damn mortgage\nWill you look at tHe time?\nStill you tHe one on my mind\nStill you tHe top of tHe line\nTHank God tHat it's Friday\nTonigHt let's be tHe life of tHe party\nIt's up to me\nGet up and move your feet\n\n[Chorus: Anderson.Paak]\nI never wanna waste your time, my life\nSo precious, is yours, is mine\nAnd look at the time, my God\nSo precious, is yours, is mine\n\nI never wanna waste your time, my life\nSo precious, is yours, is mine\nAnd look at the time, my God\nSo precious, is yours, is mine"}}, "Anderson .Paak f/ Talib Kweli, T.F.C.": {"Malibu": {"The Dreamer": "\n[Skit]\nI enjoy some of the old and I enjoy the new\nAnd if I can find a balance between it, that's where I find my satisfaction\n\n[Intro: Timan Family Choir &amp; (Anderson.Paak)]\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now (yeah), keep dreaming\n\n[Verse 1: Anderson.Paak]\nI'm on my fifth brew and my rent's due\nSixth and west roof\nI can see it all\nHold on to my hand, that's my little dude\nLook at Kenzo, swagging like his paw\nOne for the occasion and get ya good suit\nFuck your reservation\nBitch, I brought 'em all\nLook at where you came from, Californication\nSince a little baby skating in boogie boards\nAnd raiding your cookie jar, my radio analog\nI wanted them Nike's\nMama got me Lugz\n\n[Chorus 1: Anderson.Paak &amp; Timan Family Choir]\n(And all)\nThis one's for all the little dreamers\nAnd the ones who never gave a fuck\nI'm a product of the tube and the free lunch\nLiving room, watching old reruns\nAnd who cares your daddy couldn't be here?\nMama always kept the cable on\nI'm a product of the tube and the free lunch\nLiving room, watching old reruns\n\n[Verse 2: Anderson.Paak]\nOne for the occasion\nFuck your reservation\nCall up all the haters, It's official\nCalifornication, Ever since a baby\nRadio and the cable\nI got the dish, too\n\n[Chorus 1: Anderson.Paak &amp; Timan Family Choir]\nThis one's for all the little dreamers\nAnd the ones who never gave a fuck\nI'm a product of the tube and the free lunch\nLiving room, watching old reruns\nAnd who cares your daddy couldn't be here?\nMama always kept the cable on\nI'm a product of the tube and the free lunch\nLiving room, watching old reruns\n\n[Interlude: Timan Family Choir]\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\n\n[Chorus 2: Anderson.Paak &amp; Timan Family Choir]\nThis one's for all the little dreamers\nI'm a product of the tube and the free lunch\nAnd who cares your daddy couldn't be here?\nI'm a product of the tube and the free lunch\n\n[Chorus 3: Talib Kweli]\nThis is the music that you gotta feel\nGave you the truth before I got a deal\nNo rabbit in a hat. It ain't no magic, ain't no Copperfield\nMore like a panther, Huey Newton, Bobby Seale\nWord to the free lunch. Who knew what we would become?\nWho would be defunct? Which rumours would be debunked?\nYeah, this is the music that you gotta feel\nYeah, gave you the truth before I got a deal\nNo rabbit in a hat. It ain't no magic, ain't no Copperfield\nMore like a panther, Huey Newton, Bobby Seale\nWord to the free lunch. Who knew what we would become?\nWho would be defunct? Which rumours would be debunked?\nUsed to be scared of all my fears\n'Till I woke up from this nightmare\nNow what become of a dreamer [?]\nNow until we leave this earth\nThe music make your speakers burst\nI always put my people first\nIt's deep how when I speak they say\nI'm preaching like I lead a church\nNo proper opposition, competition gonna need a nurse\nMy job as an artist is making miracles\nTo show you how to struggle poetic and make it lyrical\nCrystallize the thought to make it clear to you\nAnd make the revolution irresistable\n\n[Chorus 1: Anderson.Paak]\nThis one's for all the little dreamers\nAnd the ones who never gave a fuck\nI'm a product of the tube and the free lunch\nLiving room, watching old reruns\nAnd who cares your daddy couldn't be here?\nMama always kept the cable on\nI'm a product of the tube and the free lunch\nLiving room, watching old reruns\n\n[Interlude: Timan Family Choir]\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\nDon't stop now, keep dreaming\n\n[Outro]\nOh my gosh guys calm down\nStop it\n\n[Skit]\nNow evolution: Where it all going? Is it coming to an end or it it just beginning\nThere was one fellow who know'd Malibu quite well at a certain time in history\nAnd I doubt if very few people are able to find these types of conditions again\nDue to crowds and controls and much bureaucracy\nBut there are other areas which are magnificent, treasures of this world\nAnd for somebody with adventure and excitement in their lives, and they have a lot of excitement and adventure\nThey can find this way of living"}}, "Anderson .Paak f/ The Free Nationals United Fellowship Church": {"Malibu": {"Lite Weight": "\n[Intro]\n(A little surfer music, baby\nA blast from your golden past)\n\n[Chorus]\nThere's no reason to be afraid\nNo time to be like that\nYou don't need me in that light\nIt's alright with me\nJust send it off and I'll give it right back\nRight down to the last face\nThere's no reason to be afraid\nNo time to be lite weight\n\n[Bridge 1]\nYou know I really can't fuss about it\nYou know I really can't funk without it\nYou know I really can't funk without it\nYou know I really can't fuss about it\n\n[Chorus]\nThere's no reason to be afraid\nNo time to be like that\nYou don't need me in that light\nIt's alright with me\nJust send it off and I'll give it right back\nRight down to the last face\nThere's no reason to be afraid\nNo time to be lite weight\n\n[Bridge 2]\n(You know I seen you from afar, right?)\nYou know I really can't fuss about it\nYou know I really can't funk without it\nYou know I really can't funk without it\nYou know I really can't fuss about it\n(Thought you might've wanted to say somethin'\nSo I was comin' up to you\nIt's cool if I come up to you, right?)\n\n[Chorus]\nThere's no reason to be afraid\nNo time to be like that\nYou don't need me in that light\nIt's alright with me\nJust send it off and I'll give it right back\nRight down to the last face\nThere's no reason to be afraid\nNo time to be lite weight\n\n[Outro]\n(Hey, you got a light?\nOh, yes, here you are\nThanks, you want a toke?\nNo, no thanks\nThis stuff is getting harder to get\nJohnny\nYeah-)"}}, "Anderson .Paak f/ Rapsody": {"Malibu": {"Without You": "\n[Chorus: Anderson .Paak]\nYeah\nAll the kissin', attention, the bitin', the tuggin'\nYou know I love what you do\nYou know I know you love what I do\nAnd all the spittin', the cursin', the fightin' and fussin'\nYou know I'm only fuckin' with you\nI bet you I was over-thinkin'\nIf I could, I'd take you everywhere\nBut you know I can't do nothin' with you\nYou know I can't do nothin' with you\nAnd I never looked as good as I do, and it's the truth\nNo bullshit, I'm nothin' without you\n\n[Verse 1: Anderson .Paak]\nAnd I should take this heart and pawn it at the auction\nI don't need it, I'm a slay this bitch and take ya shoppin'\nCause what good is any heart if it can break in pieces?\nI would rather have no feelings, than cryin' and sobbin'\nWhen I met you, I was broke as the rope on the faucet\nI had dreams that I would blow like a Nintendo Cartridge\nI was hungry, I was dirty, I needed a shower\nSince you found me, you clothed me, you packed me a sack lunch\nPapa said, when I get older, get a girl like your momma\nBut I'm twenty years old and runnin' out of options\nHow I'm supposed to trust ya?\nAin't you one of them ones tryin' to run up\npose for the perfect picture, load and post it?\nQuestion: is you with me or not?\nI'm from the city where they wear bikinis in the water drought\nBut I'm used to having cyclones blown in and out of my life\nSo it's no biggie if you need time to figure it out\n\n[Chorus: Anderson .Paak]\nYeah\nAll the kissin', attention, the bitin', the tuggin'\nYou know I love what you do\nYou know I know you love what I do\nAnd all the spittin', the cursin', the fightin' and fussin'\nYou know I'm only fuckin' with you\nI bet you I was over-thinkin'\nIf I could, I'd take you everywhere\nBut you know I can't do nothin' with you\nYou know I can't do nothin' with you\nAnd I never looked as good as I do, and it's the truth\nNo bullshit, I'm nothin' without you\n\n[Verse 2: Rapsody]\nYou know you wrong, shit you out of pocket\nRemember you was couch surfin', you ain't have a casa\nAnd mi casa, I would buy you shoes from out the locker\nAnd even though I heard around the town from all the gossip\nBetween they legs, and slidin' limousines in garages\nHeard your mama cheated on ya daddy, you just like her\nCome-a-come around, remember what happened to Tiger\nGame over, dead wrong, Biggie Wallace\nI was the one you counted on before you stacked your wallets\nTalkin' 'bout me, motherfucker you the one with problems\nHaha, you played yourself for a photo, but you ain't know though\nI only took from niggas trying to slide up in the DM\nAnd show them I was happy with the nigga I was seein'\nBut you fucked up stupid, so I guess I'll go and see 'em\nAs you contemplate how to get me back like Liam\nNo fuckin' tonight, I'll be gone by the PM\n\n[Chorus: Anderson .Paak]\nYeah\nAll the kissin', attention, the bitin', the tuggin'\nYou know I love what you do\nYou know I know you love what I do\nAnd all the spittin', the cursin', the fightin' and fussin'\nYou know I'm only fuckin' with you\nI bet you I was over-thinkin'\nIf I could, I'd take you everywhere\nBut you know I can't do nothin' with you\nYou know I can't do nothin' with you\nAnd I never looked as good as I do, and it's the truth\nNo bullshit, I'm nothin' without you\n\n[Outro: Nai Palm]\nMight not, get, might not, get any better\nMight not, might not, get, might not, get any better\nMight not, might not, get"}}, "Anderson .Paak f/ SiR": {"Venice": {"Already": "\n[Verse 1]\nSaid\nI'm naked down to my socks\nBitch I'm Anthony Kiedis\nAll this shaman I got\nPut that right to your sneezers\nRide around on my block\nVTA 2K Teasey\nFuck the police -\nOkay back to my thesis\nHoes don't love 'em, don't treat 'em\nI just teach 'em to stroke 'em\nPass that over to LODEF\nHe gon' pass it to hoder\nHe gon' lend it Nikos\nOkay bases are loaded\nThen she make it to Parker\nShe MVP with the trophy\nLike get it right with the shotty\nBut it's made with a fender\nFlavour flay with the top\nI had no time to play pitches\nYou niggas acting like goalies\nYous a hatin' defender\nI stay on Ps and Qs\nSince the type of my sentence\n\n[Chorus]\nAnd I'm ready\nIf I don't go\nDon't go\nDon't go\nI'm ready\nDon't go\nDon't go\nDon't\nMotherfucker I'm ready\n\n[Verse 2]\nThey oughta know\nThey oughta see\nHow you feeling, ohhh, that's that masterpiece\nDid you roll or make it mine (Make your mind up)\nWe stay whole and you can wind (You can wind up)\nPick on the floorda, they gonna pop that cola\nBitch niggas wanna roll up, bitch nigga here get rolled up\nSlow motion watch me win that corner (Win that corner)\nSlow motion let she give me more, muh\n\n[Verse 3]\nI can't stand what you got\nGirl your ass is Movado\nI can't help but to watch\nCollard greens in my pocket\nAll these clouds I think I finally see the top\n\n[Chorus]\nAnd motherfucker I'm ready\nIf I don't go\nI don't go\nI don't go\nI don't go\nI'm ready\nIf I don't go\nIf I don't go\nIf I don't go\nMotherfucker I'm ready\nI don't go\nI'm ready\nIf I don't go\nIf I don't go\nI'm ready\n\n[Outro]\nIf you got a problem we can light it up\nLight it up, we can light it up\nIf you got a problem we can light it up\nLight it up, we can light it up\nIf you got a problem we can light it up\nLight it up, we can light it up\nIf you got a problem we can light it up\nLight it up, we can light it up"}}}