{"Chance The Rapper": {"10 Day (Mixtape)": {"22 Offs": "--I'm off the nog, I'm off the Loko--I'm off that local, I'm on that global--I often have dreams of being locked in my mamas Volvo--Watching the garage burn down, I'm off the codo--I'm off the top, I'm off some pot--I'm off Ciroc, I'm off a lot--They gave me 10 Days off--That's an awful lot--I was off campus, but the officer--Told the office, that he saw me from the parking lot--But it's all good, I'm off that--I'm just finna off his ass, off of the Ave--While rocking all black--Dip off and hide the garbage bags in the dip spot--Just to make sure that I don't get caught--Buying hella bug spray, making sure I get off--They told me go on and rock it, I told them that it's lift off--How all my homies get caught, picked off by a dick cop--Why you allowing hiccups, why you just didn't slip off?--And now I'm at the precinct, and I'm off of my square--Having a white cop beat me while he offers me squares--You gon' torture me yeah? Well that's awfully fair--All for nothing, tryna tweak me like you offering years--Bitch I ain't scared, I'm already here--Tell ya partners and ya friends, the next coffin is there's--Guess what bitch, I'm from internal affairs--Looking for crooked cops, to tweak so I can offer 'em years--Have me tweaking, like I'm all full of fear... alright, I'm tweaking", "Juke Juke": "--Chance The Rapper--Caleb--10 Day--Ohh! Igh!------She workin' that thang, she know she got it--Lil mama so bad, you know she naughty--Her do it so slow, now watch her take it--She giving a show, now watch her break it------Back it up like, \"Juke Juke\"--3, 4, \"Juke Juke\"--Hands on the tracks like Choo Choo--Can't nobody do it like you do--True, true--Mami sip a little bit of the screw juice--Or a little bit of that special k--And throw it in the bowl like fruit loops--Hola, mami chola--Mami hol'up, mami slow up--'Scuse my french, my lingo--But I no hable cinco--Her girlfriends say they bout it, you know that I'm bilingual--And Chano gonna mingle, I'm off a couple pintos--The bad hoes out on Saturday, it's church on dondomingo--So while they out her frontin' go on back it for your mans--Cause even when your friends actin' funny you gon' dance like------ ----Break it down--Chi-Town break it down--Chi-Town break it down--Break it down----Break it down--Chi-Town break it down--Chi-Town break it down--Break it down----------Bust it, bust it--Wide open, open--I been hopin', hopin' shorty goin' goin'--She from lowend oh an'--Went to Kennwood? Me too--Nah I'm lyin', she say she got some body bitch--Me too--I hope that that shit do work out man--Cause this that new 'New Workout Plan'--And I'm that dude, you heard bout him--And I hope that get your shirt off and if not--Keep on dancin' babe, all I need is that preview--Put you on the floor and show them niggas how to freak you--Slow whine, slow grind--On time, you can take your own time--But if I can't hit your ass on time--Gotta hit me online, you can't hit my phone line------------", "Brain Cells": "----I burned too many Brain Cells down--To be worried bout my Brain Cells Now ------Here's a tab of acid for your ear--You're the plastic, I'm the passion and the magic in the air--The flabbergasted avalanche of ambulances near--The labyrinth of Pan's Lab is adamantly here--No assignments, book of rhyming and I'm drawing doodles--I should rhyme rhyme with Ramen Noodles--Ramadan, I'm the don of the diamond jewels--Fond of finding a way to kindly tell these toddlers toodles--I'm a kamikaze and I'm a kinda cuckoo--I could write a fucking book, non kamasutral--You niggas goofies since a conflict that is kinda crucial--Caught you on the 9 in all blue yelling I'm a neutral--But I'm a let the bull pass like matadors--Versus a Minotaur--Verse is a metaphor--A metamorphoses and I'm a fuckin animorph--I used to go to school with Anna Fedele &amp; Danny Whorf--Remember I used to bang with bad ones--'Til my grandmama told on her grandson--Mama said that I was way too handsome--To be throwing the hand's son\"--Breaking Walls like Samson--But I'm a throw a tantrum--'Til I'm on Every Samsung--Sanyo, and Handheld and Handgun--Please Put ya lighter's up--'Til life is up--And light it up--And slice a cut--The night is young--It's nice enough--The nicest blunt--The nicest stuff--My niggas out here trapping a lot--I know you think you on--Hiding Reggie sacks in your socks--I hang with niggas, whole jab in the jock--.4's for 15, yea my niggas we be taxing a lot--Only to goofies tho, choking on a doobie though--My eyes do be low, two be rolled--Remember days of the Rufio--Remember the Days of Chan-Man and the Skeeter Man--Brrrang Dang to Lil' B--And Bang a Rang to Peter Pan----------Light a joint--Or spliff it if you classy--Split a swisha witcha nigga--If you ask me--Ain't no questions hit it vividly and pass me--Don't answer about your problems--Or your issues or your Ashleys--It's a quarter to imminent, ten minutes to infinite--Rims, Henny, and reminisce--Nostalgia and M&amp;M;'s--Cinnamon tone women and--Feminine's getting intimate--All broads is frivolous--Homies could get they dividends--Damn, is he illiterate, literal syndicate--Illegitimate, idiot, gangbanger affiliate--Sick twisted prick, sick sadistic son of a biscuit--Man fuck this shit----", "U Got Me Fucked Up": "----Stupid ass student--True I got truants in Spanish--Beats by Inglish rap chanish--Fluent, can't fly got flew in I'm foolin'--Adidas influence Nike I do's it--Coolin' with Mikey, lowkey I rock--Mags on my bike, Tay like he chuck--Hockey I puck--Rockie I fresh--Saki, my cup like Rocky \"Wassup\"--Ohh he got two weeks ten with the foolie--Doobie sawbuck--School be too huff--Caleb my nigga, Fresco my nigga--Gon head send it up--SaveMula too tough------This ain't no game, ain't shit here funny--You got me fucked up fucking with my money------Wavy so wavy--Trendin' I'm trendy--Bending these pennies mommy done gave me--Business so savvy--Savey no spendy--Drifty so empty--City so windy--Master champ Chancelor, TrapMan the Chance or--Vance the bag handler, Bagger Vance--Pants is baggy, Vans rancid--Band of bad bandits--Abandoned bandanas banned from band practice--Sentence so gavel--Wordplay so scrabble--Chance to split atoms slit Adams apples--Adamant chano rat a tat vandals--Had to have at em' as an example------This ain't no game, ain't shit here funny--You got me fucked up fucking with my money", "14,400 Minutes": "--Yep--Igh! igh!--Igh!------I got suspended, ohhhhh you got suspended--For chiefin' a hunnid blunts, 14, 400 minutes--Fans all in the stands, they hands for Mr. Bennett--That racket over the net, ohhhhh give me my tennis--Shoes--Give me a minute, ohhhhh I can't be tardy--My class is already started, they told my mom I'm retarded--But that 10Day done in one night, Honda from a Hyundai--No tassel in the spring, but after summer I'm alumni--They took my nigga one night, and I was standing right there--An inch away from heaven, a million songs from right here--A step away from South by, a swing away from Cali--A hook away from verses, I'm a dad away from rapping--So at the school they arrested him--Back seat, squad car, nestled in--Shouts to the bitch nigga Hessleton--With' his Big Show body ass wrestlin'--Finna see the 10Day Pestilence--So far, so good, so special and--No stars, good jobs, or excellents--And I'm still so fucking non-echelon--Ohhhhh you got suspended, ohhhhh you not gon' finish--Ohhhhh you look familiar, ohhhhh you look like Kenneth--Damn they gon' resent it, ohhhhh you representin'--A class of bad kids, 14, 400 minutes ahhhhh! Like----Igh! Igh! Igh! Igh! Igh! Igh! Igh! Igh!", "Missing You": "----In the real world, we just people with ideas------That shit cray that shit dead--That shit fake blast a kid--Cassius clay at his head--At a boy, at a kid--I'm a need a napkin, cook 'em up--And he gon' need a Aspirin, hook him up--Niggas was busy scrappin', put 'em up--I was too busy rapping, good as fuck--Niggas don't act like grown ups when niggas don't get to grow up--Niggas don't wanna throw hands that's what made me wanna throw up--But these young gunners ain't nothin' but young stunners--Niggas see you as come ups so niggas just wanna run up--Niggas asking what up, I said on my soul I'm a hundred--My niggas stay in the low end the others stay in the hundreds--My daddy told me to hate 'em my momma told me to love 'em--My neighbors told me they hunting I hope I make it through summer--They stole one of my niggas I should have seen that one coming--My priest told me it's angles my niggas told me it's nothing--I'm thinking about my nigga he thinking before he die--Going to work faded I'm blowing the word God--I'm burning up all the papers cause all the reporters lied--I call him my lil homie he brought him a 45--Brown boys are dying and none of 'em were for business--And all of em' love they mommas and all of they mommas miss em'--And this shit is just stupid this shit is fucking senseless--The news  this shit is getting expensive------(I don't know why I sleep with my eyes wide--Hoping that I find you) ----And hoping that I find you--I been hoping that I find you---- ", "Long Time": "--I wonder if Gladys smiles when angels bring my name up--Or change language and subject change up--Her boy's a long way from red dolls and green rangers--Things ain't been the same since Ms. Patterson called me famous--I saw your reflection in a toilet full of vomit water--You don't think I felt ya hand on my head yelling \"call his father\"--But people don't hear ghosts--So how they gon' blame me--Money saved me--So I'm a do the same thing--You droppin pounds, gettin small on some sick shit--Like how you got the drive but don't know how to use a stick shift--You better not miss this--Over dose, dope and mixes--Let ya throat close--With a boatload of dope quotes within it----Dropping tapes 'til I losted count--Coughing out blood--Dropping weight--Like I lost an ounce--Throwing words and tossing nouns--NY traveling I'm Boston bound--Bossing 'round homies--And talking down to shorties while I'm jotting down--Notes to spit to Harlem crowns--Surfing through the Harlem crowds--At the crib I'm falling down--Yeah, I'm steady crawling 'round--I'm calling out to God--Your little angels falling down--Save me from my darkened cloud--Reach your hands and arms around", "Nostalgia": "--------I still got orange and white cassette tapes--Tents where my neighbor came to spectate--Niggas that's tough now used to get little in the dark--It's all cool now, we're all little kids at heart--Accident prone Chance, y'all remember 'bout--The time I cracked my head open at Auntie Linda's House--From diapers to outfits to castles to Elmos--From Santas to Grandmas to Gameboys and cellphones--Rocked your world, fourth grade talent show--Jada and Justin's birthday magic show--Games of tips taking niggas to school--Two quarters and I'll bust your ass at pool, on bull--Round here we lose best friends like every week--I like to think we playin a long game of hide and go seek--And one day maybel I'm a find Terrance and I could lead them--Kids of the Kingdom singing about freedom------Heads down, eyes shut, time to play Seven Up--Heads bowed, hands clutched, bottles gone, Heavens up--Smiles come through, though my eyes might cry--When they reminisce over you, my God------Let's take it back like Indian givers--To Indian burns and Jiminy Crickets--To the smell of Pillsbury on biscuit mornings--To puffy wintercoats and Christmas mornings--I used to chill with the kids next door--And SpongeBob came around 'bout four--And then I'd hang with Bart's guys--Around the bend was Smart Guy--Flipping through the picture books--Checking through my archives--Remember the old days, the ones you'll never get back--At the end of parties, passing around gift bags--Now we blow entire O's at one kick back--MY$FITS and mismatch--That get off like wristslaps----------Remember Jeepers and Odyssey Fun World--Young pimpin' like you oughta see one girl--Mama Jann, mama Charlie, and my mama Lisa--Booster seat used to boost my kitty, Connies Pizza--And every year we made a Christmas list--And Auntie Linda cooked a Christmas dish--And all of our grandparents made a Christmas wish--Like \"Lord, let me see another year like this\"----", "Prom Night": "----Charlie Bartlett, John Bender--Class Switcher, Time Bender--Chance Bennett a peculiar name--Graduation night teachers Ferris Bueller'd my name--You made a mixtape? Good job, I hope you get a good job--We was all outcasts only listened to Good Mob--I performed at fun fair--Fun fact, I'm never going back to school--Been there, done that--They see my little 10 Day tape and my dumb raps--Don't call it impossible, if you really want that--They send my ass to summer school, don't call it a comeback--I just came to beat a bully's ass and get my lunch back--Chano y tequila you know you know you don't want that--I rap my songs in Spanglish I wrap my weed in blunt wraps--Wrapped up in this one line I hope that shit get unwrapped--As if niggas was getting signed off of a line off one rap--Yo Vic, remember when they called us some freshmen niggas rapping?--Now I ain't gonna be a freshman and I'm rapping--I should've learned a lesson from all of this shit happening--I just look over to Justin for refreshments of the Captain--It's sipping when it's weak sauce, it's shots if it's cracking--Sip it when we tear up, and chug it if we laughing--Fuck it if we're fucked up I never thought of Chatham--Until the day they said I would have to chat without em--And I'm just in the studio hoping that it sounds right--Here's a brighter bulb for your limelight--And this is your night, homie, shine bright--This for everybody's fucking prom night------And it's alright--And it's ok--And we're all good--We're with homies--Any problems, you can call us--It's all love, it's all love------Uh, yo this prom shit feel like the Grammy's yo--These pictures Granny took gonna make me ask where'd Granny go--So pass the Sanyo to Auntie Jo and snap a couple candid's of the family--Get some cameos--You can change the clocks but you can't change hours--I'm waiting on the day, Spring can't bring flowers--Let me ask for minutes from dad for those campaign hours--And pour these thirsty hoes a couple champagne showers--And hop up in that limo, the hood going dummy--The hood fucking love me, the hood think we lovely--So go and pop some bubbly, this right here's to loyalty--This to a moment's glimpse at royalty--This is for my momma Jan who spoiled me--Look what we've accomplished--Time flies, watches look like magnets on a compass--Before we dip, Gladys said a prayer over the limo--Bumping 10 Day with the Angels with Jesus shopping my demo--And rode up out of Chatham, the whole hood clapping--And damn it would be crazy if any of this shit had happened--But it didn't, I missed prom, I missed it to spin--I did a show at AKIN and I would do it again----------Look at, look at your business tux, all night airplane--Go and get your racist on, all white everything--I'm on my paper now, put that on my heading--I ain't even write this down I don't write errthing--I know y'all don't like everything--She want a night she can call her wedding--Giving Eskimo kisses, with some Eskimo bitches--Nose diving, going all night sledding--Coked out like \"Don't change when you grow up--I hope you get some change when you blow up\"--Cause honestly I've always loved the way you could throw up--Rest up on my shoulder, float up flying lotus--\"You deserve a warm towel, you deserve a soda--You deserve a quiet room, you deserve a sofa--You deserve a Ferrari and a matching tiara--And a hand to wipe away all that running mascara\"--But I, I want to thank you for this prom night--Thank you for this prom night--Thank you for this prom night--I really enjoyed my prom night----------So good, So right--Hey baby, so good, so right--You know it feels so good--So good, so right--To be with you tonight--So good, so right--To be with you tonight--So good, so right--To be with you tonight"}, "Acid Rap": {"Everything's Good (Good Ass Outro)": "-- + --Well I should have you hooked up next week----No, no, no, no. I told ya, I know you need it now, so next week I promise you I'll have you hooked up, okay?----You know, Chance. Let me tell you something.--You know, I could never be more proud of anything in my life, you know, than I am of you and what you've done.--Chance, you have done, remarkable and wondrous things, so you don't have to tell me thank you for anything.--I'm supposed to do this, that stuff for you anyway, and ya know, just keep doing what you're doing.--I am very, very proud of you. Just keep doing what you're doing, ok?-- Alright, son. Love you too, take care--------Thanks for comin' guys...----'Member sittin' in class the first time listenin' to Dillaaaa--Everything's good...--Rubbin' on yo chin, sippin Gin, Margiela brand chinchillaaaa--Everything's good...--My manager backpack packed with packs of cigarilloooos--and some fruit snacks, and some killer--Phone numbers on speed dial call them save monkey guerillaaaas--Everything's good...--I ain't really that good at goodbyes, I ain't really that bad at leaving--I ain't really always been a good guy, I used to be thirsty thievin'--Runnin through purses even persons leave em hurtin' bleedin--I ain't really help the helpless, I used to be worse than worthless--Now I'm worth hooks and verses, I'm good like books in churches--Harold's and hooks and churches, everything's good...--See my name when you google search it, use a card when I make a purchase--Everything's good...--But I knew it was fly when I was just a caterpillaaaar--That I'd make it even if I never make a millaaaa--When I meet my maker he gon' make sure that we chilliiiin'--And everything's good...--I ain't really that good at goodnight, I ain't really that bad at sleepin--With bad bitches, put them aside, I used to be thirsty creepin'--Now I'm out workin' evenings, birthdays, even Tuesdays, Wednesdays, Thursdays, weekends--rehearsin' verses, murderin' merch and events--Damn it feel good to be a gangsta and it feel good for me to thank you--Put money back in your bank account...--Off of songs I barely could think up cause a lot of songs niggas gon' make up--Make sense, but they never gon' make a sound...--I'm better than I was the last tiiiiime -- crescendo--Thanks Justin, lendin' them pencils--Mr. Menzies, Mensa, Chris Minto, the time I beat Chris on Nintendo--Na-na-na, hey hey, +Good Intro+--Remember jacket shoppin' after listening to Thrillerrrrr...--Remember the first time you heard this dude and thought damn that's that niggaaaaa, haha--Everything's good...----Na-na-na-na-na-na-nah--Na-na-na-na-na-na-nah, na-na-na-na-na-na-nah--Na-na-na-na-na-na-nah, na-na-na-na-na-na-nah--Na-na - IGH! IGH! IGH! IGH!--Na-na-na-na-na-na-nah, na-na--I'm gonna be, Iiiii'm goooonna be...----{*trumpet + drum solo plays until 3:42, followed by 10 second silence*}------IGH! Yep {*3X*}--IGH! IGH! IGH! IGH! IGH!--Yep, yep, yep, yep--Yep, yep.. {*high-pitched*} juke, juke, juke, juke--Juke, juke, juke, juke, juke, juke, juke, juke--Juke! Juke! Juke, juke, juke, juke--Juke, juke, juke, juke, juke, juke, juke, juke--Juke! Juke! Juke, juke, juke, juke --Juke, juke, juke, juke, juke, juke, juke, juke --Juke! Juke! Juke, juke, juke, juke --Juke, juke, juke, juke, juke, juke, juke, juke --Juke! Juke! Juke, juke, juke, juke --Juke, juke, juke, juke, juke, juke, juke, juke --Juke! Juke! ----------\"Ohh-ohh-ohh-ohh, ohh-ohh-ohh-ohh--Ohh-ohh-ohh-ohh, ohh-ohh-ohh-ohh--I'm good...\"", "Interlude (That's Love)": "----Yeah yeah yeah yeah yeah--Yeah yeah yeah yeah, yeah yeah yeah, yeah, yeah, yeah--Yeah yeah yeah yeah, yeah, yeah--Yeah yeah yeah yeah, yeah yeah yeah, yeah, yeah----What's better than trippin' is fallin' in love--What's better than Letterman, Leno, Fallon, and all the above?--What's better than poppin' bottles tryin' to ball in the club--is the first caveman pops with his son, ball and a club--What's better than paper is ballin' it up--What's better than followers is actually fallin' in love--What's better than frolickin', follies, fallin' in mud?--Rollin' in green pastures, wanderin', followin' love--What's better than eatin' is feedin' your fam--What's better than meetings is missin' meetings to meet with your fam--What's better than leanin' and needin' a Xan--is hittin' your zan dreamin' a dream could mean leaving the land--What's better than yellin' is hollerin' love--What's better than rhymes, nickels, dimes and dollars and dubs--is dialin' up your darling just for callin' her up--It ain't nothin' better than fallin' in love - IGH!----I've seen it come back, back, back and forth--You hit the nail right on top of the head--I know you've seen it all before--But when it looks you in the eyes, it ain't nothin' you could say but --That's love, that's love--That's love, that's love--Say that's love, ooh-ooh, that's lo-o-ove--That's love.. that's love, that's love, that's love--I LOVE you!  I LOVE you! --I LOVE you!  I LOVE you! --I LOVE you!  I LOVE you! --I LOVE you!  I LOVE you! --I LOVE you! That's love--That's loooo-o-o-ove, that's love--Say that's love, ooh-ooh, that's love--That's love.. that's love, that's love, that's love", "Paranoia *": "--* song starts after \"Pusha Man\" at the 2:19 mark----{*instrumental starts after 30 seconds of silence*}------I've been ridin' around with my blunt on my lips--with the sun in my eyes and my gun on my hip--Paranoia on my mind, got my mind on the fritz--But a lot of niggas dyin', so my 9 with the shits------Move to the neighborhood; I bet they don't stay for good, watch--Somebody'll steal daddy's Rollie, call it the neighborhood watch--Pray for a safer hood when my paper good, watch--Captain Save-a-Hood, hood savior, baby boy--Still getting ID'd for Swishers --Still with Save Money militia --Trapped in the middle of the map with a little-bitty rock and a little bit of rap--That with a literary knack and a little shitty Mac and like literally jack----------They murkin' kids; they murder kids here--Why you think they don't talk about it? They deserted us here--Where the fuck is Matt Lauer at? Somebody get Katie Couric in here--Probably scared of all the refugees; look like we had a fuckin' hurricane here--They'll be shootin' whether it's dark or not, I mean the days is pretty dark a lot--Down here, it's easier to find a gun than it is to find a fuckin' parking spot--No love for the opposition, specifically a cop position cause they've never been in our position--Gettin' violations for the nation, correlatin', you dry snitchin'----------I know, you scared, you should ask us if we scared too--I know you scared... me too--I know, you scared, you should ask us if we scared too--If you, was there, then we'd just knew you cared too------It just got warm out, this the shit I've been warned 'bout--I hope that it storm in the morning, I hope that it's pourin' out--I hate crowded beaches, I hate the sound of fireworks--And I ponder what's worse between knowin' it's over and dyin' first--Cause everybody dies in the summer--Wanna say ya goodbyes, tell them while it's spring--I heard everybody's dyin' in the summer--So pray to God for a little more spring---- - second half", "Acid Rain": "----Na-na na na-na-nah--Na-na-na-na na na na na-nah--Na-na-na na na-na-nah--Na-na-na-na na na na na-nah --... Na-na-na-na na na na na-nah--Na-na-na-na na-na-na-na na na na na-nah--Na na-na-na-na nah...------Kicked off my shoes, tripped acid in the rain--Wore my jacket as a cape, and my umbrella as a cane--The richest man rocks the snatch-less necklace--Spineless bitches in backless dresses--... Wore my feelings on my sleeveless--... My weed seedless, my trees leafless--I miss my diagonal grilled cheeses--And back when Mike Jackson was still Jesus--Before I believed in not believin' in--Yeah, I inhaled, who believed in me not breathin' in?--Cigarette stained smile all covered in sin--My big homie died young; just turned older than him--I seen it happen, I seen it happen, I see it always--He still be screamin', I see his demons in empty hallways--... I trip to make the fall shorter--... Fall quarter was just a tall order--And I'm hungry, I'm just not that thirsty--As of late, all my verses seem not so verse-y--And all my words just mean controversy--Took the team up off my back, like \"That's not your jersey?\"--Stressin', pullin' my hair out, hopin' I don't get picked--All this medicine in me hopin' I don't get sick--Making all of this money hopin' I don't get rich--Cause niggas still getting bodied for foams----Sometimes the truth don't rhyme--Sometime the lies get millions of views--Funerals for little girls, is that appealin' to you?--From your cubicle desktop, what a beautiful view--... I think love is beautiful, too--Building forts from broken dams, what a hoover could do--For future hoopers dead from Rugers shootin' through the empty alley--Could've threw him an alley-oop, helping him do good in school--Damn that acid burn when it clean ya--... I still miss bein' a senior--And performing at, all those open mic events--High schools, eyes closed seein' arenas--... And I still get jealous of Vic--... And Vic's still jealous of me--But if you touch my brother--All that anti-violence shit goes out the window along with you and the rest of your team--... Smokin' cigarettes to look cooler--... I only stop by to look through ya--... And I'm only gettin' greedier--... And I'm still Mr. Youmedia--... And I still can't find talent--And I'm still choosin' classmates that wouldn't fuck--Mom still thinks I should go back to school--And Justin still thinks I'm good enough--And Mama Jan still don't take her meds--And I still be askin' God to show his face--And I still be askin' God to show his face...------I am a new man, I am sanctified, ohhh--Ohh I am holy, I have been baptized--I have been born again, I am the White Light--Rain, rain don't go away...--Bow wow wow wow wow wow {*7X to fade*}--IGH!", "Juice": "----Thirsty, thirsty, tryna choose--I mean, I know, I'm pretty cool --My Nitty bag, my kitty boost--I got the juice, I got the juice ------Chano, Chatham's own, foolies glad I'm home --Even my haters kinda glad I'm on; Rest In Peace to my Vagabond --Rapper song, singer - suspended, subpoena--For misdemeanors, dreamer, held back ass is lowkey still a senior --And I still shake up BO Squad, prayin' for my BroBois --City on the come up, shout that nigga Sosa--Shout my nigga Fat Trel, shout my nigga Joseph --Playin' \"Buenos Aires\" while they sleepin' - buenas noches --Wonder if I wrote this, cause it's so crisp--The most brokest cold stock broker winter solstice --I could win an Oscar, Russian Accent Husky--Acid addict, costly avid actor - Kevin Costner ------Juice!  Juice!  Juice!  Juice! --I got the juice, I got the juice ------God give me one sentence more, maybe I just gotta get suspended more? --Hash tag it, get mentions for it  Make you love it, get it trending more --And then act humble, hear some bull that some dude mumble--Wantin' to jump dude, but let that nigga punk you, knowin bitch niggas wanna bring guns to the rumbles --But I love y'all souls  Don't let the +Juice+ spill Pac--Blue pill pop 'til you feel good enough to pop the popped bitch in the blue heels yop --That one - drown in the juice nigga; hun'nid proof get found in a youth nigga--Stop with all the trynna introduce nigga, everybody know you dude you the new nigga! --Hows it feel to be you? Yo no sÃ©, I ain't really been myself since Rod passed--I ain't even really need that shop class, I ain't really been weak since pops smashed--I'm a genius, a mothafuckin pop smash; hit sensei, master--Jack and Lindsey, Wiley, Kembe, been paid, 10 Day been they FAFSA ----------Juuuuugo.. you never tasted paper--Tripped, racing yaself trynna chase the paper--I just faced a Vega and you love being Kobe when you make the lay up--'til you realize everybody in the world fuckin hates the Lakers--Hahahah, and then everybody wanna sip--'til the juice spill everybody want a bib, and then everybody wanna dip--Told you I ain't worried, I ain't scared of the booth, all you can do is spit a verse of the truth--Merge the mixture with the purest and the fruits and the thirst, just the worst, it's the curse of the juice---- + ------Juice, juice, juice, juice... yup!--Juice, juice, juice, juice... yup!--Juice, juice, juice, juice... yup!--Juice, juice, juice, juice... yup!--Yup! Yup! ...Yup!", "Chain Smoker": "----If this is my last shh- my last shit--Uhh, it definitely be mad important--Still a, chain smokin', name droppin' --Good lookin', muh'fuckin', motha- shut your mouth!------Still a chain smokin', name droppin'--Good lookin', muh'fuckin', motha - shut yo' mouth!--Brain broken, Frank Ocean listenin', stain hittin'--Satin woodgrain grippin', paint drippin', motha - shut yo' mouth!------Somebody pray for the God, oh Lord, I wonder what Michael's on--Son jammin' to his shit, rappin' trappin' trippin' 'cid and sniffin' glue and chewin' Vicodin--Shoulda died yellin' \"YOLO was a lie\" and you a liar, wonder why you wanna die so young--You and I look just alike and I'm afraid that this one right here, might be last time that I write a song--Lot of niggas wanna go out with a bang but I ain't tryna go out at all--So I ainâ\u0080\u0099t tryna go out at all, got a lot of ideas still to throw out the door--Last chance joint gotta be a dance joint from an introspective drugged out standpoint--Throw bands joint, wanna hold hands joint, old school for my own old man joint----------This part right here, right now, right here, this part my shit--I play this so loud in the car I forget to park my whip--I lean back, then spark my shit, I turn up, I talk my shit--Hope you love all of my shit, I hope you love all of my shit ------Why toss my filter, when she saved my life?--The same shit that kills us, always taste so right--That's why I pray to the dear Lord, God know who he be--Truth be told he juiced me, introduced me to the lucy leaf--Ohh ohh ohh, I seen the light, I lost my lighter--BIC flick, kick the habit and the bucket, fuck your supplier--Lies, Levis on fire, flyer on the wall I'm brighter--In the darkness of the night; in the sky I get higher, higher, okay---- + ----------IGH!"}, "Burn the City (S)": {"Burn the City": "--Screaming Burn It down!--Too Loud, Too dank, for you to turn it down--Bad bitches running round like shirtless now--Shits just Perfect Now--When it's worth it why the fuck would I get nervous now--So Shop with me on Mary--And Fuck with me on Sherrif--Puttin Caramel On garretts--Yellin \"Fuck The Heat On Derrick\"--I'm a city based N-word--27's, Port's and Spirit's--Been trying to Share that dinner--Can't Inherit from your Parents--#Igh--I was rollin a blunt when I wrote this--I was smoking a blunt when I spoke this--Hocus Pocus--Hows that for a smoke trick--Couldn't pay attention--Now I can afford focus--Got a lil Buzz and they got fuckin bogus--Like How you swat a flying locust?--But it's actually dope...--Acid, adderol and adjectives--An Adolescent I could fuck with?--#Igh's his fuckin Ad-lib?--Burn Burn--City we built--You already forgot the names--Of kids that we killed--Burn Burn--It's Hot as all fuck--Cause everyone got burner--Cause it's always gettin buck--#Igh"}, "I Am Very Very Lonely (S)": {"I Am Very Very Lonely": "----It's just me and la cucaracha tonight--Cold pizza with the hot Sriracha tonight--Apple TV, Comcast, don't know what to watch-a tonight--Shoulda had ya when I had ya, now I wish I gotcha tonight------You can hit my line--If you ain't on shit, if you tryna smoke------I guess I'll file the cabinets, fix the disha washa, tonight --Feed the fishes twist a swisha while I mix the pasta tonight --Tube socks white briefs gold wrista watcha tonight --On the sofa posted perfect selfie picture posture tonight ----------This is not the castle this is just the casa tonight--Ain't no Nala so my Simba ain't gon' be Mufasa tonight--Only dust and shadows comin' from la cucaracha tonight--But if you eva in the hood like Mr. Rogers, hit my----"}, "The Writer (S)": {"The Writer": "----Niggas try to come at me and shit like--On some like, I only write slow songs--And I only write...church and--How many of y'all are fucking with me with a pen, period?------I'm a writer, probably as good as Elton John--But whats writing good for if it ain't helping moms?--I'm tryna feed Japan while seeing sights of Lebanon--And wiping away tears of girls that's getting felted on--I'm tryna get my felt pen on but the block is hot--My hands is questioning if I'm bach or not--If I'm 2Pac or nonexistent to these juggernauts--But I'm a architect an astronaut an argonaut--So hey, you, get off my couch--You don't know me stay the fuck out my mouth--But I'm a writer you can quote it out loud--A false poet get my dough and I'm out--But here's an eighth of shrooms for your earlobe--A little rap wrapped in cigarillo--A little bit of Wu-Tang, mixed with some Henry David Thoreau--A little ponder theory you can ponder on your pillow--But this is for the day that your dad dies--Puffin' some reason all you hearing is sad sighs--You searchin' for nostalgia but sad and you can't cry--So you check your iPod in search for some bad vibes--From that rap guy, who raps over sad vibes--I wrote it in an hour dawg, don't know what your dads like--He probably was a great dad, he's probably in paradise--You want deeply in heartbreak and sadly I can't write, nothing--This is for those who wrote suicide notes--And all the hipster girls that was super fly dope--You looking at her nose what you do besides coke--You looking at her palms what you do besides dope--Nothing, life is but a supersized note--I open up my mind like suicide door--And grab a pimp cane and a superfly coat--Have they bobbing they heads to something stupid I wrote I hope"}, "Coloring Book (Mixtape)": {"Same Drugs": "----We don't do the same drugs no more--We don't do the, we don't do the same drugs, do the same drugs no more--Cause she don't do the same drugs no more--We don't do the, we don't do the same drugs, do the same drugs no more------When did you change?--Wendy you've aged--I thought you'd never grow up--I thought you'd never...--Window closed, Wendy got old--I was too late, I was too late--A shadow of what I once was------Cause we don't do the same drugs no more--We don't do the, we don't do the same drugs, do the same drugs no more--She don't laugh the same way no more--We don't do the, we don't do the same drugs, do the same drugs no more------Where did you go?--Why would you stay?--You must have lost your marbles--You always were so forgetful--In a hurry, don't wait up--I was too late, I was too late--A shadow of what I once was--Cause we don't, we don't do what we say we're gonna--You were always perfect, and I was only practice--Don't you miss the days, stranger?--Don't you miss the days?--Don't you miss the danger?------We don't  do the same drugs no more --We don't do the, we don't do the same drugs, do the same drugs no more--We don't  do the same drugs no more --We don't do the, we don't do the same drugs, do the same drugs no more--We don't do the, we don't do the same drugs...------(Turn it around--I remember when--This age of pathetics)--Don't forget the happy thoughts--All you need is happy thoughts--The past tense, past bed time--Way back then when everything we read was real--And everything we said rhymed--Wide eyed kids being kids--When did you stop?--What did you do to your hair?--Where did you go to end up right back here?--When did you start to forget how to fly?--(This shit, wanna chew--Tastes like Juicy Fruit--Words have magnitude--Please get me out of that...)--Don't you color out--Don't you bleed out, oh--Stay in the line, stay in the line--Dandelion--(Do the same drugs no more--We don't do the, we don't do the same drugs, do the same drugs no more--We don't, we don't, we don't...)--Don't you color out--Don't you bleed out, oh--Stay in the line, stay in the line--Dandelion"}}, "Chance The Rapper f/ Chicago Children's Choir, Kanye West": {"Coloring Book (Mixtape)": {"All We Got": "----And we back--And we back, and we back, and we back, and we back, and we--And we back, and we back, na, na, na------This ain't no intro, this the entree--Hit that intro with Kanye and sound like AndrÃ©--Tryna turn my baby mama to my fiancÃ©e--She like music, she from Houston like Auntie YoncÃ©--Man my daughter couldn't have a better mother--If she ever find another, he better love her--Man I swear my life is perfect, I could merch it--If I die I'll prolly cry at my own service, igh, igh!--It was a dream, you could not mess with the Beam--This is like this many rings--You know what I mean?--This for the kids of the king of all kings--This is the holiest thing--This is the beat that played under the words--This is the sheep that ain't like what it heard--This is officially first--This is the third------This is all we got--Isn't this all we got?--So we might as well give it all we got--This is all we got--Music all we got, got, got--So we might as well give it all we got------I get my word from the sermon--I do not talk to the serpent--That's the holistic discernment--Daddy said I'm so determined--Told me these goofies can't hurt me--I just might make me some earl tea--I was baptized like real early--I might give satan a swirlie--Wish I could tell you it's ready--Tell you it's ready today--They don't give nothing away--You gotta fight for your way--And that don't take nothing away--Cause at the end of the day------Music all we got--Music all we got--Isn't this all we got?--So we might as well give it all we got--Music all we got--Music all we got------We know, we know we got it--We know, we know we got it--We know, we know we got it--We know, we know we got it--Music--We know, we know we got it--We know, we know we got it--We know, we know we got it--We know, we know we got it--Music--Music is all we got"}}, "Chance The Rapper f/ Nico Segal": {"10 Day (Mixtape)": {"Long Time II": "----I wonder if Gladys smiles when angels bring my name up--Or change language and subject change up--Her boy's a long way from red dolls and green rangers--Things ain't been the same since Ms. Patterson called me famous--I saw your reflection in a toilet full of vomit water--You don't think I felt your hand on my head yelling, \"Call his father\"--But people don't hear ghost, so how they gon' play me?--Money saved me, so I'm a do the same thing--You droppin' pounds, gettin' small on some sick shit--Like how you got the drive but don't know how to use a stick shift?--You better not miss this, overdose dope and mix this--Let your throat close with a boatload of dope quotes within it------Long time now since I seen you smile--Long time long time now--Since I seen you smile--And it's been a long time, long time now--Since I seen you smile------Dropping tapes 'till I losted count--Coughing out blood, dropping weight like I lost an ounce--Throwing words and tossing nouns--NY traveling, I'm Boston bound, bossing 'round homies--And talking down to shorties while I'm jotting down--Notes to spit to Harlem crowds, surfing through the Harlem crowds--At the crib I'm falling down, I'm on the floor crawling 'round--I'm calling out to God, \"You're little angel's falling down--Save me from my darkened cloud, reach your hands and arms around\"--Long time long time now since I seen your smile--We miss you------#10Day--It's been a really, really long time, long time--Since a goof ass nigga done tried me--Label niggas wanna sign me and lame ol' nigga wanna buy me--Food and weed and drink and shit, just as long as you inkin shit--Sometimes I can't pay for food cause sometimes I can't think of shit--Where's your head at? Where's your head at?--Singing my shit like you just said that--Wanging my shit like where'd you hear that?--Young ass nigga where you headed?--Long time to get famous, life's whatever you make it--Just thank God that we made it"}}, "Chance The Rapper f/ Gzus Piece": {"10 Day (Mixtape)": {"Fuck You Tahm Bout": "----I'm so turned up right now--I'm on way past ten--Think we made it though--We almost made it though----For anybody ever shitted on your dreams;--... Fuck y'all--Hatin' niggas that was on your team;--... Fuck y'all--Bitches that was caught up in the scene;--... Fuck y'all--Now everybody say the same thing--... Fuck y'all------Been down this block before--I use to hustle on it frequently--Been working like a slave--Trynna make sure all my peoples eat--Last year you wouldn't speak to me--But now you wanna freak with me;--But I'm a still accept the pussy--Cause it's just the creep in me--I do alot of shit that I won't rap on--Cause it's in the streets;--It's morals over money, and--It's silence over secrecy--Damn, How you just gon' act--Like I finna' make it?--I'm thirsty on the ground--Like big homie on that spaceship--Yea...------I'm so turned up right now--I'm on way past ten--But I still gotta ways to go--We gotta ways to go--Yea...----I'm so turned up right now--Where should I begin?--I think we made it though--We almost made it though--Yea...------I'm so close I can taste it--And I'm not even wasted--Say what's up to my cult--We here to lead you out the matrix--We get gear by the cases--You still stuck on that fake shit--I roll the blunt and face it--Cause I just couldn't take it--This shit don't even make sense...--How could you even hate this?--But I guess I should thank them--Cause that's just motivation--Them goofies ain't gon' say shit--Except Congratulations--It's funny, cause it's crazy--Like them niggas that was hatin' on your way up--Just know they gotta see you on their way down, straight up--And in the stereo, the only way that you can play us--It's Treated undefeated;--And we comin' for them majors... bitch------I'm so turned up right now--I'm on way past ten--But I still gotta ways to go--We gotta ways to go--Yea...----I'm so turned up right now--Where should I begin?--I think we made it though--We almost made it though--Yea...------Touchdown--Who you gon' trust now?--When you blow...--Spontaneous-ly combust now--Now they wanna fuck now--Like you give a fuck now--You use to be an unknown--But now you one of us now--Go ahead and turn up,--Nigga, turn up--And all them brain cells--Getting burnt up--In a furnace,--Don't concern us--With them problems of tommorow is a journey--Turn up------I'm so turned up right now--I'm on way past ten--But I still gotta ways to go--We gotta ways to go--Yea...----I'm so turned up right now--Where should I begin?--I think we made it though--We almost made it though--Yea..."}}, "Chance The Rapper f/ Lili K, Peter CottonTale": {"10 Day (Mixtape)": {"Hey Ma": "----Hey Ma, hey Ma, hey Ma--Hey Ma, hey Ma, hey Ma------I said 'Hey Ma', don't go stretching your wallet--These niggas gotta pay me for taking a year from college--Go on get ya nails polished, stylist for your eyelids--And a pilot for your mileage for them frequent flights to your island--Ms. Brown and Ms. Polleck, little boy done grown up--Little voice done blown up, middle-class that bonus--Hey Ma, Hey Mama Jan; God just gave me another chance--Rod just gave me another line, probably gave me another fan--7-7-3, Oh, since Kanye was a three-old--Down the street from D. Rose, was practicing his free-throws--Shout out to that Gulf Shrimp, shout out to King Gyro--Shout out that Ms. Moody, auntie Toni them my heroes------We gon' get this paper, put that on my mama--You gon' see us later, put that on my mama--Monica and Ava, thanks for all the favors--Got my money saved up, put that on my mama------Hey Ma, hey Ma I know I never did behave a lot--Never got good grades a lot--And turned your hairs to grays a lot--And go in stores and take a lot--And never shopped but saved a lot--So you ain't gotta shop at Save A Lot--And you ain't gotta worry about Chase a lot--They playing with your checks, your shit--Cause they gonna take your pay or not--Que Sera gotta then, fuck them niggas you smarter than--We just gonna beg your pardon them--Save Money, my partner and them--I'm part of them, It's part of me--This Save Mula, Bo Squarter III--I'm riding around my side of town--Hot boxing no cops around--I had the tux I had the gown--Just had a show, just had to bounce--It's Chance ho, #10Day--Chano no hable englais--That language be that chanish but ooh! Muy caliente--So she just gonna throw her steps on--And haters gonna throw that epsom--And we just gonna throw a party--And I'm gonna just throw my teflon--Cause family be that plug though--And I ain't even flexin--But twin bro be that Victor--And Big Cause be that Chef Sean------I said don't stop, in what you be--In what you do, don't stop----------Ayo I wanna thank, MC Tree mama--I wanna thank Fox mama, I wanna thank Robbie mama--Lili mama, Peter mama--MY mama, my dad mama--Your mama, I wanna thank moms--I wanna thank, L-Boog mama, I wanna thank Tom Fool mama--I wanna thank, Talent mama, Marcus mama--I wanna thank, Thelonious mama, Vic mama, Reese mama--I just wanna, I wanna thank anybody whose been a mother to a motherless child--I love you mommy--10Day--I hope y'all had a good time--Agh!"}}, "Chance The Rapper f/ T-Pain": {"Coloring Book (Mixtape)": {"Finish Line": "----Do-do-do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do--And we back, and we back, and we back, and we back--Do-do-do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do--And we back, and we back, and we back------They ain't teaching taxes in school--It don't even matter I was acting a fool--But who would think their raps would turn into racks?--Don't matter, matter fact, it could happen to you--Scars on my head I'm the boy who lived--The boy love playing when the boy too sick--Reclining on a prayer, I'm declining to help--I've been lying to my body can't rely on myself--Last year got addicted to xans--Suffocated my name and starting missing my chance--LA for four months end up leaving right back--I'm in love with my city bitch I sleep in my hat--I felt hog tied ever since my dog died--He lived to 84, damn, that's a long ride--I know he up there he just siting there waiting--I'll be racing up the stairs I'm a get to the gate singing------Do-do-do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do------All my days I prayed and prayed and now I see the finish line--Oh I'm gonna finish mine--All my days I prayed and prayed and now I see the finish line--Gonna finish mine------Gimme the water, gimme the water--I need the kind from Space Jam--Get this money, get this budget, KOK to day camp--Me and my girl plan to stay to the end--Hope there never come a day where we be better as friends--We in a marathon we could build a marriage on--Arguments as parents digging deeper than a baritone--I've been getting blocked just trying to make songs with friends--Labels told me to my face that they own my friends--I got to pray I got to pray, like Hammer after \"2 Legit\"--I got the power I could poke Lucifer with crucifix--I cannot scrap the stupid shit--I \"Stand Up\" like I'm Ludacris--I know some folks that talk so much they drive an Uber whip--Damn, queen said why we in a queen bed--I said its yours don't worry little bean head--I'm just here to catch my breath I got a world tattoo--She said cool just bring me some food------All my days I prayed and prayed and now I see the finish line--Oh I'm gonna finish mine--All my days I prayed and prayed and now I see the finish line--I'm gonna finish mine------Do-do-do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do-do-do--Do-do-do-do-do"}}, "Chance The Rapper f/ Sulaiman, Vic Mensa": {"10 Day (Mixtape)": {"Family": "----Turn the radio up and we can have a good time--Got me feeling like J.J. on Good Times--Back when Thelma had that ass, hope the fam good--My sister said she likes my raps cause it sounds good--Told me not to cut corners, use to cut quarters--Sitting in the room, on the phone, cooking up orders--Till my pops popped me off, that was family matters--Used to watch him in the kitchen sipping Sammy Adams--Now I'm rollin', iPhone Stolen--Mama whip with 5 of my guys, 4 holdin'--Trying to live our lives like our lives are so golden--Got big shoes to fill like try go bowling--Til we strike out, we just hoping we don't strike out--4th quarter, how you gon go and take Mike out?--Summertime Chi, I had to pull the bike out--Riding getting nice cause it's nice out------Let's land in the land where the Famo stay--Grind all day til the fam okay--It still warm my heart to hear my grandma pray--For the fam of my friends when my mans go away--Let's land in the land where the Famo stay--Grind all day til the fam okay--It still warm my heart to hear my grandma pray--For the fam of my friends when my mans go away------Don't wake up, don't wake up, don't wake up too fast--Don't make up your mind, you should flake on that class--Sing all you want, just don't Drake on they ass--Shore you got drive, don't turn fake on they ass--Good morning, good raps, good morrow, good luck--Tonight you could blow, tomorrow you suck--Bizarro, my carro, I borrowed from Chuck--A new SLR and Ferrarro deluxe--No money for the meter when I'm parkin' em--Gassed than a bitch no car with him--Market him, tell him that he's buzzing like a game operation with Parkinsons--Young kid rappers, kidnappers--Young whipper snapper that will whip past ya--Will get at you, come get at you--Wanna break ya off, Come Kit-Kat you----------Now the team work make the dream work--Go ahead and send an application if you need work--If it need hurt, then I'm a bring hurt--How you finna see the clouds if you never seen dirt--Now you finna play it loud, listen how it's goin down--Didn't know the name before bet you niggas know it now--Chi-City niggy, made a 50 out a penny--Got some titties at the cribby and the Savemoney with me and we going in--Going all out for them hoes again--Now I'm fin to bring the fucking flow and bend it back--And show it's more to this than rap--Love my parents for supporting cause they know I'm finna crack--Know my niggas got my back, got some niggas selling packs--But I'm tryin' to get em cheese so I can get em out the trap--Now my figures getting fat, a lot of hoes be tryin' to jack--But I got her on my lap, All she do is make it clap----"}}, "Chance The Rapper f/ Saba": {"Coloring Book (Mixtape)": {"Angels": "--Angels, na, na, na, na----I got my city doing front flips--When every father, mayor, rapper jump ship--I guess that's why they call it where I stay--Clean up the streets, so my daughter can have somewhere to play--I'm the blueprint to a real man--Some of these niggas toss they tassel for a deal man--I ain't going to hell or the Hillman--Igh, Igh, Igh, Igh, for my real fans--I got caught up with a little Xan--Can't stop me but it slow me though--Yeah nigga famous, you don't know me though--But every DJ still play me though--Damn man, I don't even need a radio--And my new shit sound like a rodeo--Got the old folks dancing the Do-si-do--So they fuck around, sign me to OVO--Oooh, I just might share my next one with Keef--Got the industry in disbelief, they be asking for beef--This what it sound like when God split an atom with me--I even have Steve giving out apples for free------They was talking \"woo woo this woo wap da bam\"--City so damn great, I feel like Alexand'--Wear your halo like a hat, that's like the latest fashion--I got angels all around me they keep me surrounded----Who is you? And who the fuck is you? And who is him?--All of the sudden woo wap da bam you can't touch me--Na, na, na, na I got angels--I got angels----I ain't change my number since the seventh grade--This for my day one, ten years, seven days--A week, nigga's never tired on they Kevin Gates--And if they rest in peace they bunny hopping heaven's gates--It's too many young angels on the southside--Got us scared to let our grandmommas outside--You gonna make me take the campers way downtown--You gonna make me turn my BM to my housewife--I just had a growth spurt--It done took so long, my tippy toes hurt--You can keep the nose ring, I don't have to soul search--I'm still at my old church, only ever sold merch--Grandma say I'm Kosher, momma say I'm culture--GCI, 1-0-7-5, angel goin' live--Power 92, angel, juke, angel gon' juke--GCI, 1-0-7-5, goin' live--Power 92, angel gon' juke, juke, juke, juke---- &amp; --They was talking \"woo woo this woo wap da bam\"--City so damn great, I feel like Alexand'--Wear your halo like a hat, that's like the latest fashion--I got angels all around me, they keep me surrounded--Wap the bam -- I got angels all around me they keep me surrounded------They was talking \"woo woo this woo wap da bam\"--City so damn great, I feel like Alexand'--Wear your halo like a hat, that's like the latest fashion--I got angels all around me, they keep me surrounded----Who is you? And who the fuck is you? And who is him?--All of the sudden woo wap da bam you can't touch me--Na, na, na, na I got angels--I got angels----Na, na--Na, na--I got, I got"}}, "Chance The Rapper f/ Lili K. *, Nate Fox": {"Acid Rap": {"Pusha Man": "--* Lili K. is on background vocals------Ten -- damn -- days--And all I got to show for it is shoes and shows and chauffeurs with road rage--Still the same damn ad-lib: IGH! Old, ways--Still gotta letterman, no practice; still gotta burner man, no lackin'--Still outtin Jams nigga, no Jackson; no Jordan and we toe-taggin'--I'll take you to the land where the lake made of sand and the milk don't pour and the honey don't dance and the money ain't yours--Now its just a red pill, got a blue and a hand full of Advils--I'm the new Nitty, fuck it Nitty the old me so I'mma tell the buyer what Nitty told me------I got that mmm-mmm, I got that Goddamn--I'm yo' pusha man, I'm yo', I'm your pusha man--Pimp slappin', toe taggin', I'm just tryna fight the man--I'm yo' pusha man, I'm yo', I'm yo' pusha man------Pimp slappin', toe taggin', I'm just tryna fight the man--I'm yo' pusha man, I'm yo', I'm yo' pusha man------You a laaaaaaaame, and your bitch break down my weed sometimes--See my face in the streets, in the tweets and a Reader or a RedEye if you read Sun-Times--She got blisters on her knees, she's a fiend for the D even though I only beat one time--One time, it was one two times, it was two plus me equals threesome time--Shouts out to Nate, I jackball and I bop, I flex--Got neck from all these thots I sex; Rastafari them shottas yes--House safari, mi casa, yes; poppy fields of that popeye--She came to party, she popped a Molly, said \"come to papa\", she said \"papa, yes\"----"}}, "(Chance The Rapper f/) D.R.A.M.": {"Coloring Book (Mixtape)": {"D.R.A.M. Sings Special": "----You are very special--You're special too--Everyone is special--This I know is true--When I look at you--You are very special--You're special too--Everyone is special--This I know is true--When I look at you"}}, "Chance The Rapper f/ Knox Fortune": {"Coloring Book (Mixtape)": {"All Night": "----Come on, big fella, you drunk, big fella--Two sips and now you wanna trip, big fella--You not a drinker, I can see it all in your leg, big fella--You wobbly, big fella, you finna fall--Sit down, you drunk, big fella------All night, I been drinking all night--I been drinking all night, I been drinking, ay ay--All night, I been drinking all night--I been drinking all night, I been drinking, hey--All night, I been drinking all night--I been drinking all night, I been drinking, ay ay------Everybody outside, everybody outside--When I pull up outside, all night, no--Everybody high five, everybody wanna smile--Everybody wanna lie, that's nice, no--Oh, now you wanna chill, oh, now you wanna build--Oh, now you got the bill, that's cool though--Oh, now you got the gas, oh, now you wanna laugh--Oh, now you need a cab, that's true though--All you do is talk, I ain't got shit to say--Can't no one get in my car, I don't even valet--Long discussions, oh, you my cousin?--No you wasn't, you just wanna ride--You just wanna talk about politics, Chicago shit and rocket ships----Shut up! Start dancing, ho------All night, I been drinking all night--I been drinking all night, I been drinking, ay ay--All night, I been drinking all night--I been drinking all night, I been drinking, hey--All night, I been drinking all night--I been drinking all night, I been drinking, ay ay------You just went and spilt fries in the seat--It's fried on the seat, come ride on the seat, ay--Last girl, she'll lie on the seat, she'll fart on the seat--Now she jog in the streets, say--I don't trust no one faking like a fan, asking for a pic--You should use your phone, call a Uber--You a goofy if you think I don't know you need a lyft--Is you is or is you ain't got gas money--No IOU's or debit cards, I need cash money--So back up, back up, I need space--Now, I need you to slow down, it's not a race--Now I can't really hear what you gotta say now--Shut up! Start dancing, ho------All night, I been drinking all night--I been drinking all night, I been drinking, ay ay--All night, I been drinking all night--I been drinking all night, I been drinking, hey--All night, I been drinking all night--I been drinking all night, I been drinking, ay ay"}}, "Chance The Rapper f/ Noname Gypsy": {"Acid Rap": {"Lost": "----My druggy, love me when I'm ugly--Hug me when I'm bummy, scummy; I'm your hubby--Let's get lo-ost... let's get lo-ost...------Damn I'm in so deep girl, probably cause you're empty--You can't even speak girl; damn your mouth so minty--Ooh your mama hate me, daddy wouldn't let you --if he ever met me, if he ever met you--Put that shit behind us, and put this in your sinus--Mine is all up in my gums, minus all that shit its lined with--I say oh-oh-oh-ohh - you been scratchin, you been fiendin--I'mma fix you, I'mma fuck you, I'mma get rid of them demons - it's my------My druggy.. when I'm ugly--Hug me when I'm bummy, scummy; I'm your hubby--Let's get lo-ost... let's get lo-ost...------Damn I need a minute... aight leh'go--She fell in love, it fell apart... aight leh'go--She met her match, I let her match, she lit her match, she let me smoke--Yeah me mad petty, yeah me bogus, yeah yeah yeah yeah yeah me know--Yeah she knew too  it made her love it--Her pussy like me, her heart like fuck it--So dance for daddy like Gator, ain't no partners on this trip--And lose yourself in my room and find yourself in my grip - I'm sayin----------I blessed myself inside your arms one day, swear to God there I was when the dress--And the Silver buttons fade away; Miss Mary Mattress, geriatrics--Fuck me into open caskets, I wanna die with this--I wanna stop seein' my psychiatrist: she said \"pill, pop, baby, girl --cause I promise you, you tweaked; the empty bottled loneliness--This happiness you seek\" the masochism that you preach--Practice back flips, tragic actress on a movie with no screen--When the only time he loves me is naked in my dreams----------IGH!"}}, "Chance The Rapper f/ BJ the Chicago Kid, Saba": {"Acid Rap": {"Everybody's Something": "-- + --\"Ladies lovin' my music is like some sex shit--\"Niggas tryin' to grip up my mic like it's a dick\" --\"Run around the corner to pick up the new shit\" --\"Toss this in the deck so niggas can catch rep\" --\"Ladies lovin' my music is like some sex shit\" --\"Niggas tryin' to grip up my mic like it's a dick\" --\"Run around the corner to pick up the new shit\" --\"Toss this in the deck so niggas can catch rep\" ------What's good, good? And what's good, evil?--And what's good, gangstas? And what's good, people?--And why God's phone die every time that I call on Him?--If his son had a Twitter wonder if I would follow him--Swallow them synonyms like cinnamon Cinnabon--Keep all them sentiments down to a minimum--Studious Gluteus Maxim models is sendin' him--Pics of they genitalia tallied up ten of 'em--I slurped too many pain-kills, down I'm off a lot--I got a lot off days but it ain't often that I'm off the clock--Ya kna wha mean? I got the Chicago Blues--We invented rock before the Stones got through--We just aimin' back cause the cops shot you--BUCK BUCK BANG BANG - yellin' \"FUCK Fox News!\"--Booyaka buckle up, mothaFUCK opps too--Ain't no knucklin' up 'em young cause it just not cool------Nice to see you Father New Year, middle finger Uncle Samuel--Shootin' death with weighted dice and hittin' stains on birthday candles--I know somebody, somebody loves my ass--Cause they help me beat my demons ass------Everybody's somebody's everything --Nobody's nothing --Everybody's somebody's everything --Nobody's nothing --Everybody's somebody's everything --Nobody's nothing ------Right?  I used to tell hoes I was dark light or off white--But I'd fight if a nigga said that I talk white--And both my parents was black but they saw it fit that I talk right--With my drawers hid but my hard head stayed in the clouds like a lost kite--But gravity had me up in a submission hold--Like I'm dancin' with the Devil with two left feet and I'm pigeon toed--in two small point ballet shoes with a missin' sole--and two missin' toes but it's love like Cupid kissin' a mistletoe----------Like Cassius duckin' the draft and now the fight is over--The type to love from a distance not the type that told her--Spent three days on the rap, trash it and type it over--With babies on the block under arms like fightin' odors; coppers and quotas--+Hold Ya Head+ like 2Pac had taught, obviously they are on a come up--with better chances tobogganin' in the fuckin' summer--Concoctions for the bad days and a condom for the good ones--All odds against we tryna get lucky; doper than Lucky--You're ending happy that's only a tuggin'--Like Satan masturbatin' shit come hot but y'all still love me, ah--How father time a deadbeat, maybe I'm adopted--That'll explain why all of my shit been so timeless - IGH~!------Everybody's somebody's everything - NIGGA~!--Nobody's nothing - NIGGA~!--Everybody's somebody's everything - NIGGA~!--Nobody's nothing --Everybody's somebody's everything --Nobody's nothing --Nobody.."}}, "Chance The Rapper f/ 2 Chainz, HaHa Davis, Lil Wayne": {"Coloring Book (Mixtape)": {"No Problem": "----You don't want zero problems, big fella!--Yep!------If one more label try to stop me--It's gon' be some dreadhead niggas in ya lobby------You don't want no problems, want no problems with me, bih!--You don't want no problems, want no problems with me--Just another day, had to pick up all the mail--There go Chano ridin' through the streets, they be like, \"There he go!\"--You don't want no problems, want no problems with me, bih!--You don't want no problems, want no problems with me--Just another day, had to pick up all the mail--There go Chano ridin' through the streets, they be like, \"There he go!\"------Ooh, I be comin', put the hinges in their hands--Countin' Benjis while we meetin', make 'em shake my other hand--Milly rockin', scoopin' all the blessings on my lap--I know you tried to cheat, you shoulda never took a nap--Fuck wrong with you? What you was thinkin'?--Fuck you thought it was?--You talk that talk, that nigga lame, that nigga fall in love--Not me, though, you can keep those--Boy I'm at your head like Craig did Deebo--Don't tweak, bro, it's never sweet, ho--My shooters come for free, so------If one more label try to stop me--It's gon' be some dreadhead niggas in ya lobby------You don't want no problems, want no problems with me--You don't want no problems, want no problems with me--Yep, yep!--Pull up, they be like, \"There he go!\"--You don't want no problems, want no problems with me--You don't want no problems, want no problems with me--You don't want no problems, want no problems with me--You don't want no problems, want no problems with me--They be like, \"There he go!\"------Petey Pablo, take your shirt off--Wave 'round your head like a helicopter--I ain't put enough weed in the blunt--All you do is smoke tobacco--Where the hell you get them from?--Yeezus said he ain't make them--My niggas chasin' bounty hunters--And gettin' chased by their baby mommas--My first tat was on my stomach--Got a pocket full of money--And a mind full of ideas--Some of this shit may sound weird--Inside of the Maybach--Look like it came out of Ikea--Run shit like diarrhea--Big yacht, no pies there--Aye, aye, captain--I'm high, captain--I'm so high--Me and God dappin'--This is my blessin'--This is my passion--School of hard knocks--I took night classes------You don't want no problems, want no problems with me--You don't want no problems, want no problems with me--Pull up, they be like, \"There he go!\"------I got problems bigger than these boys--My deposits, they be on steroids--Lord, free the Carter, nigga me the Carter--Sacrificin' everything, I feel like Jesus Carter--Hold up, I got this sewed up, my soda poured up--My woes up, I'm flippin' those bucks, they've been with toe tucks--I rolled up and let the smoke puff--I lay down, told yah--Hold up, get too choked up and I think of old stuff--Move on, put my goons on, they kidnap newborns--In the streets my face a coupon--Her pussy too warm--All these niggas come to do harm--Just bought a new charm--The watch, I buy a new arm, you lukewarm--I'm Uncle Luke with the hoes--Pretty bitches, centerfolds--Tippy toes around my crib in their robes, just their robes--Half a milli' in the safe, another in the pillowcase--Codeine got me movin' slower than a caterpillar race--Fuck is wrong with you? What you thinkin'?--Fuck you thought it was?--I need Popeye percocets and on the Carter buzz--And if that label try to stop me--There gon' be some crazy Weezy fans waitin' in the lobby--Mula, baby------You don't want no problems, want no problems with me--You don't want no problems, want no problems with me--Just another day, had to pick up all the mail--There go Chano ridin' through the streets, they be like, \"There he go!\"--You don't want no problems, want no problems with me, bih!--You don't want no problems, want no problems with me--Just another day, had to pick up all the mail--There go Chano ridin' through the streets, they be like, \"There he go!\"------You don't want no problems, want no problems with me--You don't want no problems, want no problems with me--You don't want no problems, want no problems with me--You don't want no problems, want no problems with me--You don't want no problems, want no problems with me--You don't want no problems, want no problems with me--Say so, got problems, say so--They be like, \"There he go!\""}}, "Chance The Rapper f/ Akenya Seymour, Alex Wiley": {"10 Day (Mixtape)": {"Windows": "----This is six blunt rotation music--This is just got off six month probation music--This is steppin' on the beach when you're too drunk to feel a beat--This that laughing in a condo, throwin' shit down in the street--This that shouts to the Ave--Shouts to the lab--Shouts to the clucks, shouts to the strags--This for every math class that I ever had--So fuck you if a I failed, and fuck you if I passed!--For shitty summaries and bummers in the past--Cause some of our teachers act as if summer was for class--Some of us is seeing summer, some of us have passed--Some of us ain't seeing summer, some of us have passed--So I'm just glad to say I'm sippin' rum up out a glass--Cause some of us is only sippin' some up off the grav--And heaven's gates look a lot like prison from the Ave--We on the ground yelling, \"Get my nigga back!\"------And I just want roll, with my windows down--And I just want roll, with my windows down------Another weekend full of blunts and brews--Too comfortable, yelling \"Fuck a school\"--Ain't seen the world before noon in like a month or two--Blunts to the face, bottles to the dome--Niggas never need no cup--Livin' out dreams, never givin' hopes up--Ridin' with them Vill niggas, never givin' no fucks--In the game tryna get our feel, tryna get a deal--Tryna get a million--Just ridin' around with my niggas and them--Real  nigga mean real appeal--We go all out 'til we fall out--Niggas get called out then hauled out--With the windows down we like to smoke--Drink 'til we fall out, fuck is you tahm boy--The Village is my brothers--It's me, Mikey, Kembe trappin'--Hella love for Chance The Rapper--We know 10 Day is a classic, on God----------This is for sand in my shoes--Shout out to Oak Street--For the free train rides--Shout out to Polk Street--To the ice cream man you just on hella dirt--How you don't see us can't hear us--You Helen Keller--But I'm a save my dollars for Mary Jane--And embellish her--Inhalin' her, Smellin' her, maybe sellin' her--You niggas got cold feet, shouts to Luke Elegar--But that's my nigga, my dude be droppin' hella verses--Shouts to D O C and new drive too--Man we out this jam, see how new guys do--But I still save money like a coupon--So you can catch me off of the Ave gettin' my stoop on"}}, "Chance The Rapper f/ BJ The Chicago Kid, J.P. Floyd *, Kiara Lanier, Lili K., Will Miller *": {"Acid Rap": {"Good Ass Intro": "--* Will Miller plays the trumpet--* J.P. Floyd plays the trombone---- + --Even better than I was the last time baby--Ooh ooh ooh ooh --I'm good, ooohh yeah, I'm good--Even better than I was the last time baby --Ooh ooh ooh ooh - I'm good, so good------Even better than I was the last time------Rap's just make me anxious, and acid made me crazy--Them squares just made me looser and that wax just made me lazy--And I still make this song, and I'mma make another--If you ever actually hit me, better watch out for my brother--Better bet I'd take that deal, gotta watch out for my mother--Get a watch with all that glitters, come in clutters, different colors--Ben-a-Baller, Benford, butlers, chauffeurs, hit a stain-er, did I stutter?--Did a ton of drugs and did better than all my Alma mater--Motherfucker money dance, hundreds zan, gallon lean--Make a joke 'bout Leno's hair then piggy back on Fallon's spleen--Balancin' on sporadicity and fuckin' pure joy--Nightly searches for a bed and I just came off tour with Troy--But I can't complain I got some motherfuckin' bitches--How many lab partners have I fucked since I got suspended?--Mr. Bennett, you done did it, you did it, you did it--You did a good ass job, you did a good ass job--And I'm good------Better than I was the last time baby--Ooh ooh ooh ooh - I'm good, yeah, I'm good, so good--Better than I was the last time baby--Ooh ooh ooh ooh - I'm good, so good------Work, work, work, work - bang nigga, bang--Twerk, twerk, merge, swerve - dang, pick a lane--Flip a bird; pigeon, plane, it's a word, it's a shame--But God I'm good, swear I couldnâ\u0080\u0099t be better, kickin' dirt on the shirts of the lames--Keep a tab on my exes, keep some X on my tongue--Keep my work out in Texas, that's just me flexin' my lungs--See them showin' they teeth, that's just them flappin' they gums--If they bite and I'm snappin', clap clap collapsin' they lungs--Call me Chancellor The Rapper, please say \"The Rapper\"--Magical word  please say 'Kadabra--Replay the replays; Green Bay, the Packers--Cremate your teammates and freebase the ashes--Matches to gas leaks, dusted dusk 'til dawn--It's just us, and trust ya bottom bitch, my stuff the fuckin' bomb--I'm the motherfuckin' fucker, fuck a niggas fuckin' dumb--This your favorite fuckin' album and ain't even fuckin' done--I'm good! IGH!---- w/ ad-libs---- + --Even better that I was, even better than I was--Even better that I was, even better than I was----Even better that I was, even better than I was--Even better that I was, even better than I was----So, so, so, so, so, so, so so so so so so so so so----So, so, so, so, so, so, so so so so so so...--You did a good ass job, you did a good ass job and I'm good--Na-na-na-na-na-na-naa--Na-na-na-na-na-na-na, na-na-na-na-na-na-na--Na-na-na-na-na-na-na, na-na-na-na-na-na-na--Na-na-na-na-na-na-na - IGH, IGH, IGH, IGH, IGH!!--IGH~!"}}, "Chance The Rapper f/ Detail": {"I Ain't Word (S)": {"I Ain't Word": "-- + --You can look me in my face--I ain't got no worries  --See them shroomies keep me up--So I ain't got no worries  --You see money right there--Yeah that's  right there--Yeah that's  right there--And we ain't got no worries--You see pussy right there--Redbone mangos right there--See them shroomies right there--We ain't got no worries------D. Rose on that ass--That means back again--I hit my Zan so hard--Man, I've been practicing--I'm going straight to the league--And not by accident--Don't get your ass kicked in--I hoop in Shaq's and Timbs--Chit chat with Chris Mintz-Plasse--And laugh at Jags and rims--T-T-Y-L-ing the labels--And L-O-L-ing their friends--Hello Hell and Heaven--You haven't heard the half of it--Have at it half happy--30-something-year old--Broke graduate--Over the wave like Du-rags--Getting paper like dude rap--19 making that--I could be damn near fucking Erykah Badu rap--Girbaud flow is too strapped--My screws loose, I'm too slapped--Just got this bitch too turnt--Just got my nose 2Pac'd--L.A Reid like whose that--Jimmy Iovine like whose that--Whole world like whose that--Whole hood like 'dude ass'--I'm from little shorties with the shot up shirt--Where babies get kilt like a Scottish skirt--95-ing down the Ryan--And I'm flying, skirt--Keep asking if I'm trying--Nigga, I ain't word----------Unreluctant optimist--Most poppingest--Got popular--Try topping this--Triceratops--BJs from baby bopping bitches--Throat lozenges--Massaging it--No touching it--Okay, touch on it--But don't rush on it--Ration it, passionate--While imagining me--Smashing it--Dash out at like 4:30--Hands smelling like potpourri--They ain't gettin hung--My nigga, no jury--So I don't give no nigga no mercy--When my little fucking brother rap better than you--My shit get's your girl way wetter than you--You rap veterans you--My nerdy brethren you--Stuff you in a fuckin locker, 10 day letterman you--You wanna jock me, jockers --My style's fathering you--I know it's bothering you--Probably an anomaly--But it's probably niggas that's probably starving for new--Shit you could sound like--That's that shit that I don't like--But I ain't really worried--I'm a wordy motherfucker--I could hurry--But I'm buried in her pussy from the last tape----"}}, "Chance The Rapper f/ Childish Gambino": {"Acid Rap": {"Favorite Song": "----Chance, acid rapper, soccer, hacky sacker--Cocky khaki jacket jacker --Slap-happy faggot slapper  Iraqi rocket launcher--Shake that Laffy Taffy, Jolly Rancher/raunchy rapper--Bang, bang, bang - skeet, skeet, skeet; she do that thing for three retweets--The album feel like '92, now take that bong 'fore he three-peat--Chance, ho, acid head, cruisin' on that LSD--Asked Joseph about my deal, he looked back said \"hell yeah, let's eat!\"------This shit my favorite song, you just don't know the words--But I still fuck with you, you just ain't never heard--It go like: count that stack, pop that cap then down that Jack--All my niggas hit that zan, and all my ladies bounce that back --This my jam, this my jam, this my jam, this my jam--I'm 'bout that jam, I'm 'bout that jam  I'm 'bout that jam, I'm 'bout that jam --This my jam, this my jam, this my jam, this my jam--I'm 'bout that jam, I'm 'bout that jam  I'm 'bout that jam, I'm bout that jam ------Young, Rascal Flatts - young ass kid ass could rap --Fuck all the faculty, tobacco-packing acrobat --Back-to-back packin' bags back and forth with fifths of Jack--Fourths of weed, I'm back to pack on hands with young Cletus to pat my back--Real nigga with a nose ring, that's right  just here to rap them songs --Rag on my hair, wrap weed in Vegas, rockin' Vagabonds --Sang a song, oh you don't know?  Well, I still bang with you--Hang with you, sip drank with you as long as I can sang with you like ----------Young, ay--Niggas please be focused - that 'Bino , you know this --He rep the home of Sosas, you know I'm from that Zone 6--You know I rep that Stone shit, you know your 'hood is so clit--As God as my witness, this Will Smith spit real shit--I'mma be that - CG busy gettin', where the weed at?--Bought your girl some new kneepads, you're fuckin' with the Fifi bag--My stars, egad, she said \"this my favorite song\"--\"Hold my purse\" - now she on the floor, droppin' like it's hot--You blast this shit in Abercrombie when your work is finished--Your mom won't play it in the car cause it's got cursin' in it--Your boy like \"I'm the one who showed you,\" he want his percentage--Cause you were like \"this ain't the nigga you said spittin', is it?\"--Two-step - white dude's Harlem Shake--Why you laughin'? Cause you Harlem Shake--I was never fake, I was just too good to be true--That's acid rap, we killed the track, you had your +Chance+, and 'Bino too - ooh---- w/ Gambino ad-libs"}}, "Chance The Rapper f/ Ab-Soul": {"Acid Rap": {"Smoke Again": "----IGH! Hmm-mm-mmm --Da-da-da-da-da-da-da, da-da-da-da-da-da - +Acid Rap+!------I don't even talk to them on the phone again, leave in the AM, on the road again--So bitch, let's fuck so I can smoke again, I gotta smoke again, I got shit to do------Who smokin in my car? It's that nigga Chano--AKA Mr. Bennett, AK Tony Montano--I've got some folks in low end, I got some folks in c-note--AK hundred dinero, you ever seen Casino?--I just got back with 'Bino, I got a bitch but she know--Her friends done did the Dino - that's that Chicago lingo--Flamin' hots with Cheese and a kiwi Mistic--My dick won't even call her cause she left all that lipstick--Niggas be on dirt, that's why I stay on petty--I know that bangers jam, that's why my hands stay ready--Flip the candy yum, that's the fuckin' bombest--Lean all on the square - that's a FUCKIN' rhombus---- - 2X------Who's sneakin' in the club? That's that young Sir Rapper--Un-saran wrap the purple, wrap that blunt under after--Smoke all out the window, cops could eat a dick--If you ain't the hitter, you just might be the lick--Flame on, flame on, I'm your, bitch's ringtone--She like when I rap, raps but better when I sing, songs--No Drake, but I get my Trey on; killin' in the hood like Trayvon--Shoppin' like I got a coupon, savin' like I got a cape on--Cookin' crack in my apron, dressed like a nigga had 8 proms--Tell shorty I may change and I made it and I napalm--Trippy shit to watch, drugs while on the clock--Acid on the face - that's a work of art---- - 2X------Soulo ho, ho twerk somethin'  throw it back like you tryna hurt somethin' --I'm so def, I ain't ever heard nothin'; my name Herb, take herb, smoke herb --Heh, how 'bout you? No dap, but I'll take a pound or two--+No Doubt+ like Gwen Stefani's group, look let me put my mouth where you potty, boo-- IGH! I can't get that, yeah--Them niggas pissed, need potty trainin', they movement shit, that's a potty train --She ain't left yet, but she probably came, we kicked it then I scored - soccer game --She was a phony goalie, I got great aim though, don't insult me--I'll give it to ya straight, this is what she told me, my name Soulo cause I'm the one and only --She only got you as a nigga on the side - that's a nigga on the side of a side bitch, homie --Then we got out a Dodge, like them Dukes of Hazzard--Music and tabs of Lucy, take your chance with this rapper--Soul~!---- - 2X"}}, "Chance The Rapper f/ Byron Cage, Jamila Woods": {"Coloring Book (Mixtape)": {"Blessings": "----I'm gon' praise him, praise him till I'm gone--I'm gon' praise him, praise him till I'm gone--When the praises go up, the blessings come down--When the praises go up, the blessings come down--It seems like blessings keep falling in my lap--It seems like blessings keep falling in my lap------I don't make songs for free I make 'em for freedom--Don't believe in kings, believe in the kingdom--Chisel me into stone, prayer whistle me into song air--Dying laughing with Krillin saying something 'bout blonde hair--Jesus black life ain't matter, I know I talked to his daddy--Said you the man of the house now, look out for your family--He has ordered my steps, gave me a sword with a crest--And gave Donnie a trumpet in case I get shortness of breath------I'm gon' praise him, praise him till I'm gone--Don't be mad--I'm gon' praise him, praise him till I'm gone--When the praises go up--Good God--The blessings come down--The blessings come down--When the praises go up, the blessings come down--When the praises go up, the blessings come down--The blessings come down--When the praises go up, the blessings come down--It seems like blessings keep falling in my lap--It seems like...--When the praises go up, the blessings come down--When the praises go up, the blessings come down--Good God------They booked the nicest hotels on the 59th floor--With the big wide windows, with the suicide doors--Ain't no blood on my money, ain't no Twitter in heaven--I know them drugs isn't close, ain't no visit in heaven--I know the difference between blessings and worldly possessions--Like my ex girl getting pregnant and her becoming my everything--War with my wrongs, I'm writing four different songs--I never forced you to forfeit it, I'm a force to be reconciled--They want four minute songs--You need a four hour praise dance performed every morn--I'm feeling shortness of breath, so Nico grab you a horn--Hit Jericho with a buzzer beater to end a quarter--Watch brick and mortar fall like dripping water, ugh!------There are obstacles in life--Many many trials and tribulations that come up--But you got to realize and know--That even Jericho walls must fall--Every wall must fall------I'm gon' praise him, praise him till I'm gone--I'm gon' praise him, praise him till I'm gone--When the praises go up, the blessings come down----When the praises go up, the blessings come down----When the praises go up, the blessings come down----When the praises go up, the blessings come down--------------Blessings keep falling in my lap"}}, "Chance The Rapper f/ Justin Bieber, Towkio": {"Coloring Book (Mixtape)": {"Juke Jam": "----We used to roll at the rink, we used to roll at the rink--I used to talk way too much, you used to know everything--You couldn't stand me, I couldn't stand you--You said I'm steady playin', but you steady playin' too--Your big brother foot work--Your play sister Juke--The rink was the place but in that space and time I was too young for you--As you were for me, to worry about Frooties and Chews--Till I found out all the shawdy's with cooties was cute--And realized what booties can do------We gon' get it poppin'--We gon' get it Jukin'--We gon' throw a party--We ain't gotta do shit--You came with your best friend--Came up with for the weekend--Rolling with your parties--So tell me what you thinkin'--So we gon' have a juke jam--So we gon' have a juke jam--We can have a party, just listening to music--Like we used to do--I'll get close to you--I remember you--You used to \"I remember you\"------We've got so much history baby, maybe--Maybe you and I were meant to be--Maybe I'm crazy------We never rolled at the rink--We would just go to the rink--You ain't buy tokens no more--You just hit roll at the rink--You had a nigga, I couldn't stand him--But when they play \"Take You Down\", Chris Brown--I am him standing--I mean it's just dancing--It's harmless as fuck--Then I put my waist through your hips--And your legs and your arms just to harness you up--Then we hit the floor--All the kitties start skating--To see grown folks do, what grown folks do--When they grown and they dating------We've got so much history baby, maybe--Maybe you and I were meant to be--Maybe I'm crazy--Crazy about you------We gon' get it poppin'--We gon' get it Jukin'--We gon' throw a party--We ain't gotta do shit--You came with your best friend--Who came up with for the weekend--Rollin with the parties--So tell me what you thinkin'--So we gon' have a juke jam--So we gon' have a juke jam--We can have a party, just listening to music--Like we used to do--I'll get close to you--I remember you--You used to \"I remember you\"------We've got so much history baby --Maybe "}}, "Chance The Rapper f/ Francis &amp; The Lights, Jeremih": {"Coloring Book (Mixtape)": {"Summer Friends": "----Oh, oh, oh, incredible--I would... incredible--Everything...------Socks on concrete, jolly rancher kids--I was talking back and now I gotta stay at grandma's crib--Bunch of tank top, nappy headed bike-stealing Chatham boys--None of my nigga's ain't had no dad--None of my nigga's ain't have no choice--JJ, Mikey, Lil Derek and them--79th street was America then--Ice cream truck and the beauty supply--Blockbuster movies and Harold's again--We still catching lightening bugs--When the plague hit the backyard--Had to come in at dark cause the big shawty's act hard--Okay now Dave grandpa grand crossing--First day, nigga's shooting--Summer school get to losing students--But the CPD getting new recruitment--Our summer don't, our summer, our summer don't get no shine no more--Our summer die, our summer time don't got no time no more---- &amp; ----Summer friends don't stay--Summer friends don't stay around--Summer friends, summer friends--Summer friends don't stay--Summer friends don't stay, hey--Stay around------Oh I used to kill 'em with the long hair--Momma had salon doing perms out the armchair--Yeah we're working late, he treat the crib like it's a timeshare--I would mow some lawns for my ones like a lawn chair, hugh, hugh!--Now I'm the same way, over time all the time, every night, hey--Ready my blessing, now I'm ready how I wait--Never let a friendship get in my way--Never let a blog get in my way--Make the whole song do whatever I say--79, 79, 79, 79 place--79, 79, 79, 79 place--Some of my homegirls got lost in the paperwork--They was good friends but I faked the clerk--Cause if it ain't work, can't make it work--It's been a minute since I called on a friend--Fucked up and fucked all my friends--All my friends, all my...---- &amp; --Stick around--Summer friends, summer...----Summer friends don't stick around--Stick around----79, 79, 79, 79, hey--79, 79, 79, 79, hey, hey, hey----79, 79, 79, 79, hey, 79----City wide, city wide, city wide, hey--City wide, city wide, city wide, hey--City wide, city wide, city wide, hey--City wide, city wide, city wide, hey--City wide, city wide, city wide--City wide, city wide, city wide--City wide, city wide, city wide--City wide, city wide, city wide--City wide, city wide, city wide--City wide, city wide, city wide...------------May the Lord give your journey mercy--May you be successful, grant you favor--And bring you back safely, I love you------When I was so young before I could remember--I would always treat my gang like family members--Even when the changing nigga never changed up--I always bring my friends, my friends up--When I was so young before I could remember--I would always treat my gang like family members--Even when the changing nigga never changed up--I always bring my friends, my friends up"}}, "Chance The Rapper f/ Twista, Vic Mensa": {"Acid Rap": {"Cocoa Butter Kisses": "----Na-na-na-na-na, na-na-na-na-na - IGH!--Na-na-na-na-na, na-na-na-na-na - IGH!------Cigarettes on cigarettes, my mama think I stank--I got burn holes in my hoodies, all my homies think it's dank--I miss my cocoa butter kisses...--I miss my cocoa butter kisses...------Okie dokie, alky, keep it lowkey/Loki like Thor lil bro--or he'll go blow the loudy, saudy of sour Saudi--Wiley up off peyote, wildin'/Wile E. like that coyote--If I sip any Henny, my belly just might be outtie--Pull up inside a huggy, Starsky &amp; Hutch a dougie--I just opened up the pack, in an hour I'll ash my lucky--Tonight she just yellin' \"fuck me\", two weeks she'll be yellin' \"fuck me\"--Used to like orange cassette tapes with Timmy, Tommy, and Chuckie--And Chuck E. Cheese's pizzas, Jesus pieces, sing Jesus love me--Put Visine inside my eyes so my grandma would fuckin' hug me--Oh generation above me, I know you still remember me--My afro look just like daddy's, y'all taught me how to go huntin'--BLAM~!!----------Innanet... Innanet--I will, smoke a little something but I don't inhale--Everywhere that I go, everywhere they be askin' \"how's it goin'?\" Say the goings, well--Go figure, Victor's light skinned, Jesus got me feeling like Colin Powell--All praise to the God; God knows he's a pro, he's a pro like COIN-TEL--Check, check mate, check me take me to the bedroom, let you know me well--I mean normally, you see Norma Jean wouldn't kick it with Farmer Phil--But these kids these days, they get so high, burn trees, smoke chlorophyll--'til they can't feel shit, shit-faced, faced it, 15 hits on this L--Elevated, train, and the craziest thang got me feeling like Lauryn Hill, +Miseducated+, my dick delegated--Rap Bill Bellamy, they said I shoulda never made it, probably shoulda been dead or in jail--Deadbeat dad, enough of that jazz, asshole, absynthe up in that glass--+Are We There Yet?+ Ice Cubes in a bong; rip, brain dead, take a tug and then pass--I think we all addicted, yeah...--I think we all addicted, really though...--I think we all addicted, yup...--I think we all addicted------Cigarettes on cigarettes, my momma think I stank--I got burn holes in my memories, my homies think it's dank--I miss my cocoa butter kisses...--I think we all addicted...---- - 1X w/ Vic Mensa singing along------Twista~!--I could make a flow, pitter patter with a patter pitter - juicy; used to be in a jalabiya and a kufi--Trying hard not to be addicted to a groupie, I ended up on an album cover in a Coogi--You see, I be still a God but a goofy; you be, flowin' about drugs and a Uzi--That's the new principle, sometimes I'mma be about some hoes, sometimes I'mma wanna +Make A Movie+--And when it come to rapping fast, I'm the Higgs Boson ; and though my style freakish--I could still break your body down to five pieces like I did Voltron  cause I'm addicted to the craft and I be off of OG--Know me, I'm the Obi-Wan Kenobi of the dope see  never scared of mean spirits, methamphetamine lyrics--Cooler like I'm offa codeine, low key  don't, be, so, judg-ment-al--Even though I'm reminiscing I f I don't know what I  miss is, I'ma end up figuring out that it's home--And my mother and my grandmother cocoa butter  kisses, this is just a testament to the ones that raised me--The ones that I praise and I'm thankin' ; I need em but the chronic all up in my clothes--And I wanna get a hug, and I can't cause I'm stankin'  never too old for a spanking - IGH!-------- w/ Vic Mensa singing along the second time"}}, "Chance The Rapper f/ Action Bronson": {"Acid Rap": {"NaNa": "----No, no no no, no no no --No no no, no no no --No no no, no no no ------Introducin'  Chance the Ruthless--Trip 'shrooms and lucy  dreams is lucid--Loosely based on music, swallow my mucus--Hope your pussy get herpes and yo' ass get lupus --Deuces douches, deuce deuce I'll shoot ya --Shoes might boot 'cha and a suit might suit 'cha--They be on bullshit but they really don't do shit--They use of illusion could confuse Confucius--Nasty, ashy  cigarette ashin'--'til my voice get raspy; last week suspended--Last night kissed Va$htie, parleyed with Ashley--Always in the hallway, so I never been classy --Shut up!------Na na na, na na na--Na na na, na na na--Na na na, na na na----------Acid, acid  get it? Acid--Melts through plastic, I spit fired--Pad my palette  talkin' paper--If this was work  I'd get higher --Pardon my mishaps, burp and get murdered --Fart and get bitch-slapped, like Bourbon mixed with Jack --Lickety-split, look it, he slipped on a shell--from peelin'  banana splits back, give me my Kit-Kat --Don't break me off shit, batch, fack is you mean bitch?--Zan with that lean bitch, zan with that lean bitch--Zen with that chakra, I eat it like Idi Amin--Ya kna wha mean? Hit me back when that mean shit ----------Na na na.. na na na.. na na na--Uhh, it's me, uh --yow yow, ying-yow--Uhh, yow, yow yow, yeah, uhh----Introducin', Itâ\u0080\u0099s Bronsonlino --With my hair slicked back, I look like Rick Pitino --3 Japanese dykes in my El Camino --Lettin' trees blow, oh --I rep the East Coast  I got a team of hoes like Pat Summit--I look like Arnold Schwarzenegger in a black hummer --I splash summer like a fast brother--With a number on his back, ainâ\u0080\u0099t no fumblin', in fact, Iâ\u0080\u0099m ---back, acid in my hat--Shoot then pass the gat, it's at the bottom of the river in a plastic bag--My new shorty got a gymnastic back --87 emerald green on a classic jag--She had the cleft palate  I ordered chefâ\u0080\u0099s salad --She had the club foot  with that little arm --I couldnâ\u0080\u0099t help but laugh, she ordered Chicken Parm--I had the full Bulls warm-up with the Pippens on ----Na na na, na na na--Na na na, na na na--Suck my motherfucking dick, it's the young Randy Velarde--Queens, baby, uh--Na na na, na na na--Na na na, {*gibberish, followed by coughing*}--Blow me!"}}, "Chance The Rapper f/ Kirk Franklin, Noname": {"Coloring Book (Mixtape)": {"Drown": "----The water may be deeper than its ever been------Lord rain down on me so I can move on water--Like children at the altar, like God inside my house--I love you, I love you, you looking holy like Mama--You made a church out of feathers--So when she fly to the Father--She know the choir gon' follow and all the offering paid--She gave my name away to your holy house--She like my blessings in disguise--She like her Jesus mountain high--So he can watch her lonely child--I know my God--I know my God seen his breaks and his edges--A jacket for giving that painted his city in gold--Like everything is everything--Like all them days he prayed with me--Like emptiness was tamed in me--And all that was left was his love--And all that was left was his love--And all that was left was his lov------Never, never drown--The water may be deeper than its ever been--Never drown--The water may be deeper than its ever been--Never drown------Never, never, never--Chance let me hear 'em--This thirst in my soul--There's a thirst in my soul and tell me--Where I stand I go--Where--For you--Come on--I may cry a river--I may cry a thousand tears--But you take it  and you wash--You wash me new--Me new--People sing--This water is deep--Yes--This water is--Yes and I need you to--Jesus rescue me--Come on, I need you to--Take me to your mountain--Hallelujah--So someday Chicago will be free--Someday we'll all be free--Be free------The water may be deeper than its ever been--Never drown--The water may be deeper than its ever been--Never drown"}}, "Chance The Rapper f/ Future": {"Coloring Book (Mixtape)": {"Smoke Break": "----We just be smoking a bowl--We just be smoking--We just be smoking a bowl--We just be smoking a bowl--We just be--We just be smoking a bowl--We just be smoking a bowl--We just be smoking a, we just--Fuck is going on? When did we buy a bowl?------We just be smoking a bowl--We ain't got no time to roll--I'm always out on the road--She don't got time for a whole--Little bit of time that we have--We used to purchase a half--There don't be no time to smoke--I'm always throwing on clothes--She always throwing a fit--We don't got no time for no sex--I just put milk in the bowl--She don't be cooking at all--She just put weed in the bowl--She don't have time for herself--She putting points on the board, yes--You know she carry her own--You know she carry a child--She wake up at crack of dawn--She don't be cracking a smile--So when she packing the bowl--I grab her, I tell her...------Let me crack this blunt--Slow it down for a second--Break it down oh--She said, \"let me lick this blunt\"--Slow it down for a second--Break it down oh--We deserve, we deserve--We deserve, we deserve--A smoke break--We deserve, we deserve--We deserve, we deserve--A smoke break------Truth being told, we used to movies and bowl--We used to Netflix and roll--I used to pass her the smoke--She used to laugh at my jokes--You pat my back when I choke--Wish we were stuck in our ways--We way too young to get old--We stuck together like oowops--We smoked a fatty sing Zoo-Wap--Traphouse 3, Guwop--I shoulda knew when I grew up--It would be no time at all--We went from White Owls to Raws--We went from joints to a bowl--She need a second to breathe--We need an actual smoke sesh------Let me crack your back--Slow it down for a second--Take it down oh--Let me run this back--Slow it down for a minute--You deserve, you deserve--We deserve, we deserve--We deserve, we deserve--A smoke break--We deserve, we deserve--We deserve, we deserve--A smoke break------I don't have time to finesse--I put some ice on your neck--But I ain't holding your back--I spend my time on the road--Super ain't saving no hoes--I don't have time to patrol--Let me break these bales right down for a second--When it touch down oh--I got to lay back the roof--I got to break the new rules--She can't be taking no cost--When she involved with a boss--Please don't get lost in the sauce--Please don't get lost in the sauce--She been like this from the door--Told me my mom was a whore--I gave her percs for myself--I give a perc full of steam--I'm tryna crown me a queen--You hear the chains when they cling--I take the molly its clean--I push the whip with the wings--I gotta be oversea, I gotta be on the pedal--I push it down to the floor--I got designer galore--I keep some Goyard and geuss--I smoke out all of my cars--You smell the weed in the air--You smell the smoke in the seats--You went and had our child--You didn't abandon the D--You got me twisted at least--You can...------Let me crack your back--Let me rub you all over--Take it down oh--Let me make this blunt--Make you dinner or somethin'--You deserve, you deserve--We deserve, we deserve--We deserve, we deserve--A smoke break--We deserve, we deserve--We deserve, we deserve--A smoke break"}}, "Chance The Rapper f/ Noname Gypsy ": {"Israel (Sparring) {S}": {"Israel (Sparring)": "----Sparrin' is trainin', chain snatchin' the slaves--But a rap song is a match in a cave--Dim lit, wet wick, wicked rappin' its way--Drunk off of light, lies, laughin' claimin' asylum while shinin' in shade--I can't stay silent, I go violent when my violets is gray--And my roses is black--Fuck the pharaohs and pharisees, Moses is back--I don't need to see a sphinx to know they noses was black--I don't know one Temptation that had Otis' back, sparrin' is trainin', this a jumpin' jack--I'm the scariest +jack+ in the pumpkin patch--Float like my jumper wet, sting like a bumblebee--I swing like a lumberjack, go back when I'm up at bat--They tried to label me a non-rapper--I'm an independent contractor, card cracker--Sparrin' is trainin' without the trainin' wheels--You made it, you made it, you made it, yeah you made a deal--You played it straight, hated, graduated, waited, waited, you still a waiter still--Mice will always find out ways to steal--Picture me, fifth of Hennessy and the Swisher Sweet--Fake identity 'til a plug named Trinity shook me--\"Wake up, wake up!\" like remember me?--Said one plus one make three and you finna see--You ain't as grown as you finna be--You got them young nigga tendencies------Hmm, sentimental energy--I let the lightin' beside him, I stand like angel--Sparrin' is trainin' for an apathetic halo--Apologetic, non religious, consequential fable--Like good is good, the love in me is goodly, or godly--The Bible say mistakes is necessary--So I Mississippi monologue to granny house--My soloist is sold out to attentive God--Cornbread on my table when I say my prayers--On airs to stairs where shadiness is time to rest or manifest--Sparrin' is trainin', I know they think me bumblebee--Afro-Americano, Sunny D--But bet I sting, no die---- Sparrin' is trainin'------Jacob wrestled with God--in the desert 'til He broke him and He blessed him and He rescued his heart--I struggle with love, I juggle my loves--I cuddle and coddle, ship wreckin' bottle, I huddle in hugs--Sparrin' is trainin' bra/bruh, Ramses watchin' rainin' frogs--Jigga watchin' Damon, +Damon+ watchin' \"Wayans Bros\"--A tandem unicycle with two pilots in different maps---- You givin' back?-- I'm givin' back------Tit for tat--Synagogue and bottle caps, a body in the underpass says \"Where's my Jesus?\"--Pledge allegiance to the money now--We runnin down to kiddie parks where darker kids be casualty--Like come with me, to the museum---- Excuse them, they know of what they do------Sparrin' is trainin', don't let Denzel +Training Day+ you--Sensei could catch a fade too--We be on that elegant, hella melanin--Barely, barely since the crayons and jellybeans---- + --And now you know Noname ain't never for none----And now you know Noname ain't never for none----Haha~! And you don't stop --Boom, boom bap and you don't stop --I told you that was gonna be fun though--"}}, "Chance The Rapper f/ Lil Yachty, Young Thug": {"Coloring Book (Mixtape)": {"Mixtape": "----Chance the motherfuckin' rapper--With a capitalized, uh, times, like the times--Lil Boat--Chance--Lil Boat------Am I the only nigga still care about mixtapes--Am I the only nigga still care about mixtapes--I'm the only nigga still care about mixtapes--Bad little bitch, wanna know how lips taste--I swear I'm the only nigga still care about mixtapes--Bad little bitch, wanna know how the lips taste------All I can hear is the third, ayy--All I can hear is the third, ayy--We don't know none of your words, ayy--We don't know none of your words, ayy--I love my women real tall, ayy--Type that can really play ball, ayy--You buy my hat at the park, ayy--Think I might really play ball, ayy--I got a link in my bio my bitch do the salsa like pico de gallo--They gotta ask if they may, Cinco de Mayo--How can they call themselves bosses--When they got so many bosses--You gotta see what your boss say--I get it straight out the faucet--I ain't felt like this since the third drought, third carter drop--Told my momma third grade I'd be in the third Barbershop--And you know momma got real worried when she heard college drop--But now I call the shots------I'm the only nigga still care about mixtapes--Bad little bitch wanna know how lips taste--I swear I'm the only nigga still cares about mixtapes--Bad little bitch wanna know how lips taste------Bad little mama, she gettin' it Obama--She sting like a bumble bee, hot as the sauna--She shine like a Rolex, got that from her momma--Can't see me, can't be me, I'm ridin' like a panda--That booty gon' roll and it's outta control--And these bitches gon' fuck off respect and that loyalty--All my bitches lovin' me and they spoil me--Rub me down with that lotion, baby oil me--Drinking Actavis, baby I'm showin' me--In that choppa I see your perimeter--Change the culture, cause my niggas is silent--Wait a minute I told you--Yeah, I would like to know you--Yeah, you lucky like clovers--Yeah, the clothes no good--Mama I do it, your ass I pursue it--Just look at me baby--I came from the sewers--They love all the slime ball--Like they fuck all these cats on your slime dog--I got me some  like I'm --And I'm ballin' on you like I'm Chris Paul------I'm the only nigga still care about mixtapes--Bad little bitch wanna know how lips taste--I swear I'm the only nigga still care about mixtapes--Bad little bitch wanna know how lips taste------Am I the only one who really care about cover art--Growing up I ain't have my brother cause he said the streets gave him a fresh start--I ain't know what that mean--I bumped heads with my dean--Dropped out and hit the scene--Now I'm stunting like bling--Time and time again they told me no--They told me I wouldn't go--Cause in high school all I cared about was hoes--Well, maybe that shit was my interest--Now I spend more than they make at my dentist--After one night the folks thought I was finished--I pin my name to the game like a seamstress--Oh, bitch I bite like a gator--Fuck them reviews that they put in the paper--Did what I wanted, didn't care about a hater--Delivered my tape to the world as it cater--Oh, they fuck with me cause I'm different--New sound, new appearance--Bitches both from the 6--Give a fuck about a bitch--Walk out, my hand on my dick, I'm the shit------I'm the only nigga still care about mixtapes--Bad little bitch wanna know how lips taste--I said am I the only nigga still care about mixtapes--Bad little bitch wanna know how lips taste"}}, "Chance The Rapper f/ HaHa Davis": {"Coloring Book (Mixtape)": {"Blessings (Reprise)": "----I speak of promise land--Soil as soft as momma's hands--Running water, standing still--Endless fields of daffodils and chamomile--Rice under black beans--Walked into Apple with cracked screens--And told prophetic stories of freedom--Found warmth in a Black queen for when I get cold--Like Nat King, I'm doing the dad thing--I speak of wondrous unfamiliar lessons from childhood--Make you remember how to smile good--I'm pre-currency post-language, anti-label--Pro-famous, I'm Broadway Joe Namath--Kanye's best prodigy--He ain't signed me but he proud of me--I got some ideas that you gotta see--Make a vid with shawty and they ship it like the odyssey--They never seen a rapper practice modesty--I never practice, I only perform--I don't even warn, I don't eat it warm, I won't be reborn--I speak to God in public, I speak to God in public--He keep my rhymes in couplets--He think the new shit jam, I think we mutual fans--I used to dance to Michael, I used to dance in high school--I used to pass out music, I still pass out music--The people's champ must be everything the people can't be--I'm getting artsy-farsy, house full of some Hebru Brantleys--You must've missed the come up, I must be all I can be--Call me Mister Mufasa, I had to master stampedes------I made it through, made it through, made it through--And everything I gave to you, I gave to you, I gave to you--You got it, you got it, you got it, it's coming, coming, coming--So are you ready?---- + --Are you ready for your blessings?--Are you ready for your miracle?--Are you ready for your blessings?--Are you ready for your miracle?--Are you ready for your blessings?--Are you ready for your miracle?--Are you ready for your blessings?--Are you ready for your miracle?--Are you ready for your blessings?--Are you ready for your miracle?--Are you ready for your blessings?--Are you ready for your miracle?--Are you ready for your blessings?--Are you ready for your miracle?--Are you ready, are you ready?--Are you ready for your blessings?--Are you ready for your miracle?--Are you ready for your blessings?--Are you ready for your miracle?--Are you ready for your blessings?--Are you ready for your miracle?--Are you ready for your blessings?--Are you ready for your miracle?--Are you ready for your blessings?--Are you ready for your miracle?--"}}, "Chance The Rapper f/ Jay Electronica, My Cousin Nicole": {"Coloring Book (Mixtape)": {"How Great": "----How great is our God--Sing with me, how great is our God--All will see how great is our God--How great is our God--Sing with me, how great is our God--All will see, how great, how great, is our God--Name above all names--Worthy of all praise--And my heart will sing how great is our God--Name above all names--Worthy of all praise--And my heart will sing how great is our God--How great is our God--Sing with me, how great is our God--All will see how great is our God--How great, is our God--Sing with me, how great is our God--All will see, how great, how great, how great, how great, how great, how great, is our God------The first, is that God is better than the world's best thing--God is better than the best thing that the world has to offer------Magnify, magnify, lift it on high--Spit it Spotify to qualify a spot on his side--I cannot modify or ratify, my momma made me apple pies--Lullabies and alibis--The book don't end with Malachi--Devil will win employee of the month by the dozen--Till one score in three years from the third when he doesn't--My village raised 'em a child, come through the crib and it's bustin'--You meet anyone from my city, they gon' say that we cousins--Shabach barak, edify--Electrified the enemy like Hedwig till he petrefied--Any petty Peter Petigrew could get the pesticide--79th, 79th, I don't believe in science--I believe in signs--Don't believe in signing, I see dollar signs--Color white collar crime--Good God, the gift of freedom--Hosena Santa invoked and woke up slaves from south Hampton to Chatham Manor--My dream girl's is behind me, feel like I'm James Early--The type of worship make Jesus come back a day early--With the faith of a pumpkin-seed-sized mustard seed--Here, for I will speak noble things as they trusted me--Only righteous, I might just shrug at the skullduggery--I couldn't stand to see another rapper lose custody--Exalt, Exalt, glorify--Descend upon the earth with swords and fortify the borders where your shoulders lies--I used to hide from God--Ducked down in the slums like \"shhh\"------I was lost in the jungle like Simba after the death of Mufasa--No hog, no meerkat, hakuna matata by day--But I spent my night time fighting tears back--I prayed and prayed and left messages but never got no hear back--Or so it seemed--A mustard seed was all I needed to sow a dream--I build the ark, gently, gently, I rowed my boat down Noah's stream--Sometimes the path I took to reach my petty goals was so extreme--I was so far down in the mud couldn't even let my light shine--But she was always there when I needed to phone a friend or use a life line--From a lofty height, wage won--The poltergeist to exalt the Christ--Spark the dark with the pulse of light--Strike a corpse with a pulse of life--I spit on the Tidal of tidal waves--I spit on the Apple and kill a worm--A fire in Cali will swallow a valley for every African village burned--Jay Elect would've never made it--'O son of man, O' son of man--Who was the angel in Revelations with the foot on water and the foot on land--Who was the angel that rode a Harley from the project to the house of Parliament--And opened the book in the Devil's chamber and put the true name of the Lord in it--Old Jerusalem, New Jerusalem--Cuff lights these beats with a ball of fire--Poison the scripture and gave us the pictures of false messiahs--It was all a lie--Mystery babylon, tumbling down--Satan's establishment crumbling down--This is the year that I come for the crown--Bury my enemies under the ground"}}}