{"Chance The Rapper f/ Noname Gypsy": {"Acid Rap": {"Lost": "\n[Intro: Chance The Rapper]\nMy druggy, love me when I'm ugly\nHug me when I'm bummy, scummy; I'm your hubby\nLet's get lo-ost... let's get lo-ost...\n\n[Chance The Rapper]\nDamn I'm in so deep girl, probably cause you're empty\nYou can't even speak girl; damn your mouth so minty\nOoh your mama hate me, daddy wouldn't let you \nif he ever met me, if he ever met you\nPut that shit behind us, and put this in your sinus\nMine is all up in my gums, minus all that shit its lined with\nI say oh-oh-oh-ohh - you been scratchin, you been fiendin\nI'mma fix you, I'mma fuck you, I'mma get rid of them demons - it's my\n\n[Chorus: Chance The Rapper + woman]\nMy druggy.. when I'm ugly\nHug me when I'm bummy, scummy; I'm your hubby\nLet's get lo-ost... let's get lo-ost...\n\n[Chance The Rapper]\nDamn I need a minute... aight leh'go\nShe fell in love, it fell apart... aight leh'go\nShe met her match, I let her match, she lit her match, she let me smoke\nYeah me mad petty, yeah me bogus, yeah yeah yeah yeah yeah me know\nYeah she knew too (IGH!) it made her love it\nHer pussy like me, her heart like fuck it\nSo dance for daddy like Gator, ain't no partners on this trip\nAnd lose yourself in my room and find yourself in my grip - I'm sayin\n\n[Chorus]\n\n[Noname Gypsy]\nI blessed myself inside your arms one day, swear to God there I was when the dress\nAnd the Silver buttons fade away; Miss Mary Mattress, geriatrics\nFuck me into open caskets, I wanna die with this\nI wanna stop seein' my psychiatrist: she said \"pill, pop, baby, girl \ncause I promise you, you tweaked; the empty bottled loneliness\nThis happiness you seek\" the masochism that you preach\nPractice back flips, tragic actress on a movie with no screen\nWhen the only time he loves me is naked in my dreams\n\n[Chorus]\n\n[Chance The Rapper]\nIGH!"}}, "Chance The Rapper": {"Coloring Book (Mixtape)": {"Same Drugs": "\n[Chorus 1]\nWe don't do the same drugs no more\nWe don't do the, we don't do the same drugs, do the same drugs no more\nCause she don't do the same drugs no more\nWe don't do the, we don't do the same drugs, do the same drugs no more\n\n[Verse 1]\nWhen did you change?\nWendy you've aged\nI thought you'd never grow up\nI thought you'd never...\nWindow closed, Wendy got old\nI was too late, I was too late\nA shadow of what I once was\n\n[Chorus 2]\nCause we don't do the same drugs no more\nWe don't do the, we don't do the same drugs, do the same drugs no more\nShe don't laugh the same way no more\nWe don't do the, we don't do the same drugs, do the same drugs no more\n\n[Verse 2]\nWhere did you go?\nWhy would you stay?\nYou must have lost your marbles\nYou always were so forgetful\nIn a hurry, don't wait up\nI was too late, I was too late\nA shadow of what I once was\nCause we don't, we don't do what we say we're gonna\nYou were always perfect, and I was only practice\nDon't you miss the days, stranger?\nDon't you miss the days?\nDon't you miss the danger?\n\n[Chorus 3]\nWe don't (we don't) do the same drugs no more (do the same drugs no more)\nWe don't do the, we don't do the same drugs, do the same drugs no more\nWe don't (we don't) do the same drugs no more (do the same drugs no more)\nWe don't do the, we don't do the same drugs, do the same drugs no more\nWe don't do the, we don't do the same drugs...\n\n[Outro]\n(Turn it around\nI remember when\nThis age of pathetics)\nDon't forget the happy thoughts\nAll you need is happy thoughts\nThe past tense, past bed time\nWay back then when everything we read was real\nAnd everything we said rhymed\nWide eyed kids being kids\nWhen did you stop?\nWhat did you do to your hair?\nWhere did you go to end up right back here?\nWhen did you start to forget how to fly?\n(This shit, wanna chew\nTastes like Juicy Fruit\nWords have magnitude\nPlease get me out of that...)\nDon't you color out\nDon't you bleed out, oh\nStay in the line, stay in the line\nDandelion\n(Do the same drugs no more\nWe don't do the, we don't do the same drugs, do the same drugs no more\nWe don't, we don't, we don't...)\nDon't you color out\nDon't you bleed out, oh\nStay in the line, stay in the line\nDandelion"}, "10 Day (Mixtape)": {"Juke Juke": "\nChance The Rapper\nCaleb\n10 Day\nOhh! Igh!\n\n[Chorus]\nShe workin' that thang, she know she got it\nLil mama so bad, you know she naughty\nHer do it so slow, now watch her take it\nShe giving a show, now watch her break it\n\n[Verse 1]\nBack it up like, \"Juke Juke\"\n3, 4, \"Juke Juke\"\nHands on the tracks like Choo Choo\nCan't nobody do it like you do\nTrue, true\nMami sip a little bit of the screw juice\nOr a little bit of that special k\nAnd throw it in the bowl like fruit loops\nHola, mami chola\nMami hol'up, mami slow up\n'Scuse my french, my lingo\nBut I no hable cinco\nHer girlfriends say they bout it, you know that I'm bilingual\nAnd Chano gonna mingle, I'm off a couple pintos\nThe bad hoes out on Saturday, it's church on dondomingo\nSo while they out her frontin' go on back it for your mans\nCause even when your friends actin' funny you gon' dance like\n\n[Breakdown]\n(Juke) [x26]\n\nBreak it down\nChi-Town break it down\nChi-Town break it down\nBreak it down\n\nBreak it down\nChi-Town break it down\nChi-Town break it down\nBreak it down\n\n[Chorus]\n\n[Verse 2]\nBust it, bust it\nWide open, open\nI been hopin', hopin' shorty goin' goin'\nShe from lowend oh an'\nWent to Kennwood? Me too\nNah I'm lyin', she say she got some body bitch\nMe too\nI hope that that shit do work out man\nCause this that new 'New Workout Plan'\nAnd I'm that dude, you heard bout him\nAnd I hope that get your shirt off and if not\nKeep on dancin' babe, all I need is that preview\nPut you on the floor and show them niggas how to freak you\nSlow whine, slow grind\nOn time, you can take your own time\nBut if I can't hit your ass on time\nGotta hit me online, you can't hit my phone line\n\n[Breakdown]\n\n[Chorus]\n\n[Breakdown]", "Missing You": "\n[Intro / Outro]\nIn the real world, we just people with ideas\n\n[Verse 1]\nThat shit cray that shit dead\nThat shit fake blast a kid\nCassius clay at his head\nAt a boy, at a kid\nI'm a need a napkin, cook 'em up\nAnd he gon' need a Aspirin, hook him up\nNiggas was busy scrappin', put 'em up\nI was too busy rapping, good as fuck\nNiggas don't act like grown ups when niggas don't get to grow up\nNiggas don't wanna throw hands that's what made me wanna throw up\nBut these young gunners ain't nothin' but young stunners\nNiggas see you as come ups so niggas just wanna run up\nNiggas asking what up, I said on my soul I'm a hundred\nMy niggas stay in the low end the others stay in the hundreds\nMy daddy told me to hate 'em my momma told me to love 'em\nMy neighbors told me they hunting I hope I make it through summer\nThey stole one of my niggas I should have seen that one coming\nMy priest told me it's angles my niggas told me it's nothing\nI'm thinking about my nigga he thinking before he die\nGoing to work faded I'm blowing the word God\nI'm burning up all the papers cause all the reporters lied\nI call him my lil homie he brought him a 45\nBrown boys are dying and none of 'em were for business\nAnd all of em' love they mommas and all of they mommas miss em'\nAnd this shit is just stupid this shit is fucking senseless\nThe news [?] this shit is getting expensive\n\n[Chorus]\n(I don't know why I sleep with my eyes wide\nHoping that I find you) [x3]\n\nAnd hoping that I find you\nI been hoping that I find you\n\n(I'm missing you) [x5]", "22 Offs": "\nI'm off the nog, I'm off the Loko\nI'm off that local, I'm on that global\nI often have dreams of being locked in my mamas Volvo\nWatching the garage burn down, I'm off the codo\nI'm off the top, I'm off some pot\nI'm off Ciroc, I'm off a lot\nThey gave me 10 Days off\nThat's an awful lot\nI was off campus, but the officer\nTold the office, that he saw me from the parking lot\nBut it's all good, I'm off that\nI'm just finna off his ass, off of the Ave\nWhile rocking all black\nDip off and hide the garbage bags in the dip spot\nJust to make sure that I don't get caught\nBuying hella bug spray, making sure I get off\nThey told me go on and rock it, I told them that it's lift off\nHow all my homies get caught, picked off by a dick cop\nWhy you allowing hiccups, why you just didn't slip off?\nAnd now I'm at the precinct, and I'm off of my square\nHaving a white cop beat me while he offers me squares\nYou gon' torture me yeah? Well that's awfully fair\nAll for nothing, tryna tweak me like you offering years\nBitch I ain't scared, I'm already here\nTell ya partners and ya friends, the next coffin is there's\nGuess what bitch, I'm from internal affairs\nLooking for crooked cops, to tweak so I can offer 'em years\nHave me tweaking, like I'm all full of fear... alright, I'm tweaking", "Brain Cells": "\n[Chorus]\nI burned too many Brain Cells down\nTo be worried bout my Brain Cells Now [x4]\n\n[Verse 1]\nHere's a tab of acid for your ear\nYou're the plastic, I'm the passion and the magic in the air\nThe flabbergasted avalanche of ambulances near\nThe labyrinth of Pan's Lab is adamantly here\nNo assignments, book of rhyming and I'm drawing doodles\nI should rhyme rhyme with Ramen Noodles\nRamadan, I'm the don of the diamond jewels\nFond of finding a way to kindly tell these toddlers toodles\nI'm a kamikaze and I'm a kinda cuckoo\nI could write a fucking book, non kamasutral\nYou niggas goofies since a conflict that is kinda crucial\nCaught you on the 9 in all blue yelling I'm a neutral\nBut I'm a let the bull pass like matadors\nVersus a Minotaur\nVerse is a metaphor\nA metamorphoses and I'm a fuckin animorph\nI used to go to school with Anna Fedele &amp; Danny Whorf\nRemember I used to bang with bad ones\n'Til my grandmama told on her grandson\nMama said that I was way too handsome\nTo be throwing the hand's son\"\nBreaking Walls like Samson\nBut I'm a throw a tantrum\n'Til I'm on Every Samsung\nSanyo, and Handheld and Handgun\nPlease Put ya lighter's up\n'Til life is up\nAnd light it up\nAnd slice a cut\nThe night is young\nIt's nice enough\nThe nicest blunt\nThe nicest stuff\nMy niggas out here trapping a lot\nI know you think you on\nHiding Reggie sacks in your socks\nI hang with niggas, whole jab in the jock\n.4's for 15, yea my niggas we be taxing a lot\nOnly to goofies tho, choking on a doobie though\nMy eyes do be low, two be rolled\nRemember days of the Rufio\nRemember the Days of Chan-Man and the Skeeter Man\nBrrrang Dang to Lil' B\nAnd Bang a Rang to Peter Pan\n\n[Chorus]\n\n[Verse 2]\nLight a joint\nOr spliff it if you classy\nSplit a swisha witcha nigga\nIf you ask me\nAin't no questions hit it vividly and pass me\nDon't answer about your problems\nOr your issues or your Ashleys\nIt's a quarter to imminent, ten minutes to infinite\nRims, Henny, and reminisce\nNostalgia and M&amp;M;'s\nCinnamon tone women and\nFeminine's getting intimate\nAll broads is frivolous\nHomies could get they dividends\nDamn, is he illiterate, literal syndicate\nIllegitimate, idiot, gangbanger affiliate\nSick twisted prick, sick sadistic son of a biscuit\nMan fuck this shit\n\n[Chorus]", "Long Time": "\nI wonder if Gladys smiles when angels bring my name up\nOr change language and subject change up\nHer boy's a long way from red dolls and green rangers\nThings ain't been the same since Ms. Patterson called me famous\nI saw your reflection in a toilet full of vomit water\nYou don't think I felt ya hand on my head yelling \"call his father\"\nBut people don't hear ghosts\nSo how they gon' blame me\nMoney saved me\nSo I'm a do the same thing\nYou droppin pounds, gettin small on some sick shit\nLike how you got the drive but don't know how to use a stick shift\nYou better not miss this\nOver dose, dope and mixes\nLet ya throat close\nWith a boatload of dope quotes within it\n\nDropping tapes 'til I losted count\nCoughing out blood\nDropping weight\nLike I lost an ounce\nThrowing words and tossing nouns\nNY traveling I'm Boston bound\nBossing 'round homies\nAnd talking down to shorties while I'm jotting down\nNotes to spit to Harlem crowns\nSurfing through the Harlem crowds\nAt the crib I'm falling down\nYeah, I'm steady crawling 'round\nI'm calling out to God\nYour little angels falling down\nSave me from my darkened cloud\nReach your hands and arms around", "Nostalgia": "\n[Intro]\n\n[Verse 1]\nI still got orange and white cassette tapes\nTents where my neighbor came to spectate\nNiggas that's tough now used to get little in the dark\nIt's all cool now, we're all little kids at heart\nAccident prone Chance, y'all remember 'bout\nThe time I cracked my head open at Auntie Linda's House\nFrom diapers to outfits to castles to Elmos\nFrom Santas to Grandmas to Gameboys and cellphones\nRocked your world, fourth grade talent show\nJada and Justin's birthday magic show\nGames of tips taking niggas to school\nTwo quarters and I'll bust your ass at pool, on bull\nRound here we lose best friends like every week\nI like to think we playin a long game of hide and go seek\nAnd one day maybel I'm a find Terrance and I could lead them\nKids of the Kingdom singing about freedom\n\n[Chorus]\nHeads down, eyes shut, time to play Seven Up\nHeads bowed, hands clutched, bottles gone, Heavens up\nSmiles come through, though my eyes might cry\nWhen they reminisce over you, my God\n\n[Verse 2]\nLet's take it back like Indian givers\nTo Indian burns and Jiminy Crickets\nTo the smell of Pillsbury on biscuit mornings\nTo puffy wintercoats and Christmas mornings\nI used to chill with the kids next door\nAnd SpongeBob came around 'bout four\nAnd then I'd hang with Bart's guys\nAround the bend was Smart Guy\nFlipping through the picture books\nChecking through my archives\nRemember the old days, the ones you'll never get back\nAt the end of parties, passing around gift bags\nNow we blow entire O's at one kick back\nMY$FITS and mismatch\nThat get off like wristslaps\n\n[Chorus]\n\n[Verse 3]\nRemember Jeepers and Odyssey Fun World\nYoung pimpin' like you oughta see one girl\nMama Jann, mama Charlie, and my mama Lisa\nBooster seat used to boost my kitty, Connies Pizza\nAnd every year we made a Christmas list\nAnd Auntie Linda cooked a Christmas dish\nAnd all of our grandparents made a Christmas wish\nLike \"Lord, let me see another year like this\"\n\n[Chorus]", "Prom Night": "\n[Verse 1]\nCharlie Bartlett, John Bender\nClass Switcher, Time Bender\nChance Bennett a peculiar name\nGraduation night teachers Ferris Bueller'd my name\nYou made a mixtape? Good job, I hope you get a good job\nWe was all outcasts only listened to Good Mob\nI performed at fun fair\nFun fact, I'm never going back to school\nBeen there, done that\nThey see my little 10 Day tape and my dumb raps\nDon't call it impossible, if you really want that\nThey send my ass to summer school, don't call it a comeback\nI just came to beat a bully's ass and get my lunch back\nChano y tequila you know you know you don't want that\nI rap my songs in Spanglish I wrap my weed in blunt wraps\nWrapped up in this one line I hope that shit get unwrapped\nAs if niggas was getting signed off of a line off one rap\nYo Vic, remember when they called us some freshmen niggas rapping?\nNow I ain't gonna be a freshman and I'm rapping\nI should've learned a lesson from all of this shit happening\nI just look over to Justin for refreshments of the Captain\nIt's sipping when it's weak sauce, it's shots if it's cracking\nSip it when we tear up, and chug it if we laughing\nFuck it if we're fucked up I never thought of Chatham\nUntil the day they said I would have to chat without em\nAnd I'm just in the studio hoping that it sounds right\nHere's a brighter bulb for your limelight\nAnd this is your night, homie, shine bright\nThis for everybody's fucking prom night\n\n[Chorus: x2]\nAnd it's alright\nAnd it's ok\nAnd we're all good\nWe're with homies\nAny problems, you can call us\nIt's all love, it's all love\n\n[Verse 2]\nUh, yo this prom shit feel like the Grammy's yo\nThese pictures Granny took gonna make me ask where'd Granny go\nSo pass the Sanyo to Auntie Jo and snap a couple candid's of the family\nGet some cameos\nYou can change the clocks but you can't change hours\nI'm waiting on the day, Spring can't bring flowers\nLet me ask for minutes from dad for those campaign hours\nAnd pour these thirsty hoes a couple champagne showers\nAnd hop up in that limo, the hood going dummy\nThe hood fucking love me, the hood think we lovely\nSo go and pop some bubbly, this right here's to loyalty\nThis to a moment's glimpse at royalty\nThis is for my momma Jan who spoiled me\nLook what we've accomplished\nTime flies, watches look like magnets on a compass\nBefore we dip, Gladys said a prayer over the limo\nBumping 10 Day with the Angels with Jesus shopping my demo\nAnd rode up out of Chatham, the whole hood clapping\nAnd damn it would be crazy if any of this shit had happened\nBut it didn't, I missed prom, I missed it to spin\nI did a show at AKIN and I would do it again\n\n[Chorus]\n\n[Verse 3]\nLook at, look at your business tux, all night airplane\nGo and get your racist on, all white everything\nI'm on my paper now, put that on my heading\nI ain't even write this down I don't write errthing\nI know y'all don't like everything\nShe want a night she can call her wedding\nGiving Eskimo kisses, with some Eskimo bitches\nNose diving, going all night sledding\nCoked out like \"Don't change when you grow up\nI hope you get some change when you blow up\"\nCause honestly I've always loved the way you could throw up\nRest up on my shoulder, float up flying lotus\n\"You deserve a warm towel, you deserve a soda\nYou deserve a quiet room, you deserve a sofa\nYou deserve a Ferrari and a matching tiara\nAnd a hand to wipe away all that running mascara\"\nBut I, I want to thank you for this prom night\nThank you for this prom night\nThank you for this prom night\nI really enjoyed my prom night\n\n[Chorus]\n\n[Outro]\nSo good, So right\nHey baby, so good, so right\nYou know it feels so good\nSo good, so right\nTo be with you tonight\nSo good, so right\nTo be with you tonight\nSo good, so right\nTo be with you tonight", "U Got Me Fucked Up": "\n[Verse 1: Chance The Rapper]\nStupid ass student\nTrue I got truants in Spanish\nBeats by Inglish rap chanish\nFluent, can't fly got flew in I'm foolin'\nAdidas influence Nike I do's it\nCoolin' with Mikey, lowkey I rock\nMags on my bike, Tay like he chuck\nHockey I puck\nRockie I fresh\nSaki, my cup like Rocky \"Wassup\"\nOhh he got two weeks ten with the foolie\nDoobie sawbuck\nSchool be too huff\nCaleb my nigga, Fresco my nigga\nGon head send it up\nSaveMula too tough\n\n[Chorus: x4]\nThis ain't no game, ain't shit here funny\nYou got me fucked up fucking with my money\n\n[Verse 2: Chance The Rapper]\nWavy so wavy\nTrendin' I'm trendy\nBending these pennies mommy done gave me\nBusiness so savvy\nSavey no spendy\nDrifty so empty\nCity so windy\nMaster champ Chancelor, TrapMan the Chance or\nVance the bag handler, Bagger Vance\nPants is baggy, Vans rancid\nBand of bad bandits\nAbandoned bandanas banned from band practice\nSentence so gavel\nWordplay so scrabble\nChance to split atoms slit Adams apples\nAdamant chano rat a tat vandals\nHad to have at em' as an example\n\n[Chorus: x4]\nThis ain't no game, ain't shit here funny\nYou got me fucked up fucking with my money", "14,400 Minutes": "\nYep\nIgh! igh!\nIgh!\n\n[Verse]\nI got suspended, ohhhhh you got suspended\nFor chiefin' a hunnid blunts, 14, 400 minutes\nFans all in the stands, they hands for Mr. Bennett\nThat racket over the net, ohhhhh give me my tennis\nShoes\nGive me a minute, ohhhhh I can't be tardy\nMy class is already started, they told my mom I'm retarded\nBut that 10Day done in one night, Honda from a Hyundai\nNo tassel in the spring, but after summer I'm alumni\nThey took my nigga one night, and I was standing right there\nAn inch away from heaven, a million songs from right here\nA step away from South by, a swing away from Cali\nA hook away from verses, I'm a dad away from rapping\nSo at the school they arrested him\nBack seat, squad car, nestled in\nShouts to the bitch nigga Hessleton\nWith' his Big Show body ass wrestlin'\nFinna see the 10Day Pestilence\nSo far, so good, so special and\nNo stars, good jobs, or excellents\nAnd I'm still so fucking non-echelon\nOhhhhh you got suspended, ohhhhh you not gon' finish\nOhhhhh you look familiar, ohhhhh you look like Kenneth\nDamn they gon' resent it, ohhhhh you representin'\nA class of bad kids, 14, 400 minutes ahhhhh! Like\n\nIgh! Igh! Igh! Igh! Igh! Igh! Igh! Igh!"}, "Acid Rap": {"Interlude (That's Love)": "\n[Chance The Rapper]\nYeah yeah yeah yeah yeah\nYeah yeah yeah yeah, yeah yeah yeah, yeah, yeah, yeah\nYeah yeah yeah yeah, yeah, yeah\nYeah yeah yeah yeah, yeah yeah yeah, yeah, yeah\n\nWhat's better than trippin' is fallin' in love\nWhat's better than Letterman, Leno, Fallon, and all the above?\nWhat's better than poppin' bottles tryin' to ball in the club\nis the first caveman pops with his son, ball and a club\nWhat's better than paper is ballin' it up\nWhat's better than followers is actually fallin' in love\nWhat's better than frolickin', follies, fallin' in mud?\nRollin' in green pastures, wanderin', followin' love\nWhat's better than eatin' is feedin' your fam\nWhat's better than meetings is missin' meetings to meet with your fam\nWhat's better than leanin' and needin' a Xan\nis hittin' your zan dreamin' a dream could mean leaving the land\nWhat's better than yellin' is hollerin' love\nWhat's better than rhymes, nickels, dimes and dollars and dubs\nis dialin' up your darling just for callin' her up\nIt ain't nothin' better than fallin' in love - IGH!\n\nI've seen it come back, back, back and forth\nYou hit the nail right on top of the head\nI know you've seen it all before\nBut when it looks you in the eyes, it ain't nothin' you could say but \nThat's love, that's love\nThat's love, that's love\nSay that's love, ooh-ooh, that's lo-o-ove\nThat's love.. that's love, that's love, that's love\nI LOVE you! (Love you) I LOVE you! (Lo-o-ove!)\nI LOVE you! (Love you) I LOVE you! (Lo-o-ove!)\nI LOVE you! (Love you) I LOVE you! (Lo-o-ove!)\nI LOVE you! (Love you) I LOVE you! (Lo-o-ove!)\nI LOVE you! That's love\nThat's loooo-o-o-ove, that's love\nSay that's love, ooh-ooh, that's love\nThat's love.. that's love, that's love, that's love", "Everything's Good (Good Ass Outro)": "\n[Intro: Chance's father] + (Chance)\nWell I should have you hooked up next week\n(It's all good or whatever, I can, I can wait 'til my birthday. I uh-)\nNo, no, no, no. I told ya, I know you need it now, so next week I promise you I'll have you hooked up, okay?\n(Uh, alright. I just wanted to say thank you, for uh, for everything. For the, the computer and, the T-shirts, and uh, all the other stuff)\nYou know, Chance. Let me tell you something.\nYou know, I could never be more proud of anything in my life, you know, than I am of you and what you've done.\nChance, you have done, remarkable and wondrous things, so you don't have to tell me thank you for anything.\nI'm supposed to do this, that stuff for you anyway, and ya know, just keep doing what you're doing.\nI am very, very proud of you. Just keep doing what you're doing, ok?\n(Thank you, love you) Alright, son. Love you too, take care\n(Aight, bye bye)\n\n[Chance The Rapper]\nThanks for comin' guys...\n\n'Member sittin' in class the first time listenin' to Dillaaaa\nEverything's good...\nRubbin' on yo chin, sippin Gin, Margiela brand chinchillaaaa\nEverything's good...\nMy manager backpack packed with packs of cigarilloooos\nand some fruit snacks, and some killer\nPhone numbers on speed dial call them save monkey guerillaaaas\nEverything's good...\nI ain't really that good at goodbyes, I ain't really that bad at leaving\nI ain't really always been a good guy, I used to be thirsty thievin'\nRunnin through purses even persons leave em hurtin' bleedin\nI ain't really help the helpless, I used to be worse than worthless\nNow I'm worth hooks and verses, I'm good like books in churches\nHarold's and hooks and churches, everything's good...\nSee my name when you google search it, use a card when I make a purchase\nEverything's good...\nBut I knew it was fly when I was just a caterpillaaaar\nThat I'd make it even if I never make a millaaaa\nWhen I meet my maker he gon' make sure that we chilliiiin'\nAnd everything's good...\nI ain't really that good at goodnight, I ain't really that bad at sleepin\nWith bad bitches, put them aside, I used to be thirsty creepin'\nNow I'm out workin' evenings, birthdays, even Tuesdays, Wednesdays, Thursdays, weekends\nrehearsin' verses, murderin' merch and events\nDamn it feel good to be a gangsta and it feel good for me to thank you\nPut money back in your bank account...\nOff of songs I barely could think up cause a lot of songs niggas gon' make up\nMake sense, but they never gon' make a sound...\nI'm better than I was the last tiiiiime -- crescendo\nThanks Justin, lendin' them pencils\nMr. Menzies, Mensa, Chris Minto, the time I beat Chris on Nintendo\nNa-na-na, hey hey, +Good Intro+\nRemember jacket shoppin' after listening to Thrillerrrrr...\nRemember the first time you heard this dude and thought damn that's that niggaaaaa, haha\nEverything's good...\n\nNa-na-na-na-na-na-nah\nNa-na-na-na-na-na-nah, na-na-na-na-na-na-nah\nNa-na-na-na-na-na-nah, na-na-na-na-na-na-nah\nNa-na - IGH! IGH! IGH! IGH!\nNa-na-na-na-na-na-nah, na-na\nI'm gonna be, Iiiii'm goooonna be...\n\n{*trumpet + drum solo plays until 3:42, followed by 10 second silence*}\n\n[Chance The Rapper]\nIGH! Yep {*3X*}\nIGH! IGH! IGH! IGH! IGH!\nYep, yep, yep, yep\nYep, yep.. {*high-pitched*} juke, juke, juke, juke\nJuke, juke, juke, juke, juke, juke, juke, juke\nJuke! Juke! Juke, juke, juke, juke\nJuke, juke, juke, juke, juke, juke, juke, juke\nJuke! Juke! Juke, juke, juke, juke (bang bang bang, skeet skeet skeet)\nJuke, juke, juke, juke, juke, juke, juke, juke (bang bang bang, skeet skeet skeet; bang bang, bang bang)\nJuke! Juke! Juke, juke, juke, juke (bang bang bang, skeet skeet skeet; bang bang bang, skeet skeet skeet)\nJuke, juke, juke, juke, juke, juke, juke, juke (bang bang bang, skeet skeet skeet)\nJuke! Juke! Juke, juke, juke, juke (bang bang bang, skeet skeet skeet)\nJuke, juke, juke, juke, juke, juke, juke, juke (bang bang, bang bang, bang bang, skeet skeet skeet)\nJuke! Juke! (bang bang bang, skeet skeet skeet)\n(Bang bang bang skeet skeet skeet; bang bang, bang bang)\n(Bang bang, bang bang)\n\n[Outro: sample from \"Good Ass Intro\"]\n\"Ohh-ohh-ohh-ohh, ohh-ohh-ohh-ohh\nOhh-ohh-ohh-ohh, ohh-ohh-ohh-ohh\nI'm good...\"", "Chain Smoker": "\n[Intro: Chance The Rapper]\nIf this is my last shh- my last shit\nUhh, it definitely be mad important\nStill a, chain smokin', name droppin' (ey man, this sound like a Prince song)\nGood lookin', muh'fuckin', motha- shut your mouth!\n\n[Chorus: Chance The Rapper]\nStill a chain smokin', name droppin'\nGood lookin', muh'fuckin', motha - shut yo' mouth!\nBrain broken, Frank Ocean listenin', stain hittin'\nSatin woodgrain grippin', paint drippin', motha - shut yo' mouth!\n\n[Chance The Rapper]\nSomebody pray for the God, oh Lord, I wonder what Michael's on\nSon jammin' to his shit, rappin' trappin' trippin' 'cid and sniffin' glue and chewin' Vicodin\nShoulda died yellin' \"YOLO was a lie\" and you a liar, wonder why you wanna die so young\nYou and I look just alike and I'm afraid that this one right here, might be last time that I write a song\nLot of niggas wanna go out with a bang but I ain't tryna go out at all\nSo I ainâ\u0080\u0099t tryna go out at all, got a lot of ideas still to throw out the door\nLast chance joint gotta be a dance joint from an introspective drugged out standpoint\nThrow bands joint, wanna hold hands joint, old school for my own old man joint\n\n[Chorus]\n\n[Interlude: Chance The Rapper]\nThis part right here, right now, right here, this part my shit\nI play this so loud in the car I forget to park my whip\nI lean back, then spark my shit, I turn up, I talk my shit\nHope you love all of my shit, I hope you love all of my shit (IGH!)\n\n[Chance The Rapper]\nWhy toss my filter, when she saved my life?\nThe same shit that kills us, always taste so right\nThat's why I pray to the dear Lord, God know who he be\nTruth be told he juiced me, introduced me to the lucy leaf\nOhh ohh ohh, I seen the light, I lost my lighter\nBIC flick, kick the habit and the bucket, fuck your supplier\nLies, Levis on fire, flyer on the wall I'm brighter\nIn the darkness of the night; in the sky I get higher, higher, okay\n\n[Chorus] + [Interlude]\n\n[Chorus]\n\n[Chance The Rapper]\nIGH!", "Acid Rain": "\n[Intro: Chance The Rapper]\nNa-na na na-na-nah\nNa-na-na-na na na na na-nah\nNa-na-na na na-na-nah\nNa-na-na-na na na na na-nah (IGH!)\n... Na-na-na-na na na na na-nah\nNa-na-na-na na-na-na-na na na na na-nah\nNa na-na-na-na nah...\n\n[Chance The Rapper]\nKicked off my shoes, tripped acid in the rain\nWore my jacket as a cape, and my umbrella as a cane\nThe richest man rocks the snatch-less necklace\nSpineless bitches in backless dresses\n... Wore my feelings on my sleeveless\n... My weed seedless, my trees leafless\nI miss my diagonal grilled cheeses\nAnd back when Mike Jackson was still Jesus\nBefore I believed in not believin' in\nYeah, I inhaled, who believed in me not breathin' in?\nCigarette stained smile all covered in sin\nMy big homie died young; just turned older than him\nI seen it happen, I seen it happen, I see it always\nHe still be screamin', I see his demons in empty hallways\n... I trip to make the fall shorter\n... Fall quarter was just a tall order\nAnd I'm hungry, I'm just not that thirsty\nAs of late, all my verses seem not so verse-y\nAnd all my words just mean controversy\nTook the team up off my back, like \"That's not your jersey?\"\nStressin', pullin' my hair out, hopin' I don't get picked\nAll this medicine in me hopin' I don't get sick\nMaking all of this money hopin' I don't get rich\nCause niggas still getting bodied for foams\n\nSometimes the truth don't rhyme\nSometime the lies get millions of views\nFunerals for little girls, is that appealin' to you?\nFrom your cubicle desktop, what a beautiful view\n... I think love is beautiful, too\nBuilding forts from broken dams, what a hoover could do\nFor future hoopers dead from Rugers shootin' through the empty alley\nCould've threw him an alley-oop, helping him do good in school\nDamn that acid burn when it clean ya\n... I still miss bein' a senior\nAnd performing at, all those open mic events\nHigh schools, eyes closed seein' arenas\n... And I still get jealous of Vic\n... And Vic's still jealous of me\nBut if you touch my brother\nAll that anti-violence shit goes out the window along with you and the rest of your team\n... Smokin' cigarettes to look cooler\n... I only stop by to look through ya\n... And I'm only gettin' greedier\n... And I'm still Mr. Youmedia\n... And I still can't find talent\nAnd I'm still choosin' classmates that wouldn't fuck\nMom still thinks I should go back to school\nAnd Justin still thinks I'm good enough\nAnd Mama Jan still don't take her meds\nAnd I still be askin' God to show his face\nAnd I still be askin' God to show his face...\n\n[Chance The Rapper - singing]\nI am a new man, I am sanctified, ohhh\nOhh I am holy, I have been baptized\nI have been born again, I am the White Light\nRain, rain don't go away...\nBow wow wow wow wow wow {*7X to fade*}\nIGH!", "Paranoia *": "\n* song starts after \"Pusha Man\" at the 2:19 mark\n\n{*instrumental starts after 30 seconds of silence*}\n\n[Chorus 2X: Chance The Rapper]\nI've been ridin' around with my blunt on my lips\nwith the sun in my eyes and my gun on my hip\nParanoia on my mind, got my mind on the fritz\nBut a lot of niggas dyin', so my 9 with the shits\n\n[Chance The Rapper]\nMove to the neighborhood; I bet they don't stay for good, watch\nSomebody'll steal daddy's Rollie, call it the neighborhood watch\nPray for a safer hood when my paper good, watch\nCaptain Save-a-Hood, hood savior, baby boy\nStill getting ID'd for Swishers (mama still wash my clothes)\nStill with Save Money militia (I'mma still watch my bros)\nTrapped in the middle of the map with a little-bitty rock and a little bit of rap\nThat with a literary knack and a little shitty Mac and like literally jack\n\n[Chorus]\n\n[Chance The Rapper]\nThey murkin' kids; they murder kids here\nWhy you think they don't talk about it? They deserted us here\nWhere the fuck is Matt Lauer at? Somebody get Katie Couric in here\nProbably scared of all the refugees; look like we had a fuckin' hurricane here\nThey'll be shootin' whether it's dark or not, I mean the days is pretty dark a lot\nDown here, it's easier to find a gun than it is to find a fuckin' parking spot\nNo love for the opposition, specifically a cop position cause they've never been in our position\nGettin' violations for the nation, correlatin', you dry snitchin'\n\n[Chorus]\n\n[Interlude: Chance The Rapper]\nI know, you scared, you should ask us if we scared too\nI know you scared... me too\nI know, you scared, you should ask us if we scared too\nIf you, was there, then we'd just knew you cared too\n\n[Chance The Rapper]\nIt just got warm out, this the shit I've been warned 'bout\nI hope that it storm in the morning, I hope that it's pourin' out\nI hate crowded beaches, I hate the sound of fireworks\nAnd I ponder what's worse between knowin' it's over and dyin' first\nCause everybody dies in the summer\nWanna say ya goodbyes, tell them while it's spring\nI heard everybody's dyin' in the summer\nSo pray to God for a little more spring\n\n[Interlude] - second half", "Juice": "\n[Intro/Interlude: Chance The Rapper]\nThirsty, thirsty, tryna choose\nI mean, I know, I'm pretty cool (IGH!)\nMy Nitty bag, my kitty boost\nI got the juice, I got the juice (IGH!)\n\n[Chance The Rapper]\nChano, Chatham's own, foolies glad I'm home (IGH!)\nEven my haters kinda glad I'm on; Rest In Peace to my Vagabond (IGH!)\nRapper song, singer - suspended, subpoena\nFor misdemeanors, dreamer, held back ass is lowkey still a senior (IGH!)\nAnd I still shake up BO Squad, prayin' for my BroBois (IGH!)\nCity on the come up, shout that nigga Sosa\nShout my nigga Fat Trel, shout my nigga Joseph (IGH!)\nPlayin' \"Buenos Aires\" while they sleepin' - buenas noches (IGH!)\nWonder if I wrote this, cause it's so crisp\nThe most brokest cold stock broker winter solstice (IGH!)\nI could win an Oscar, Russian Accent Husky\nAcid addict, costly avid actor - Kevin Costner (AHHHHHHHHH!!!!! TURN UP! TURN UP!)\n\n[Chorus 2X: Chance The Rapper]\nJuice! (Juice!) Juice! (Juice!) Juice! (Juice!) Juice! (Juice!)\nI got the juice, I got the juice (Yup!)\n\n[Chance The Rapper]\nGod give me one sentence more, maybe I just gotta get suspended more? (IGH!)\nHash tag it, get mentions for it (IGH!) Make you love it, get it trending more (IGH!)\nAnd then act humble, hear some bull that some dude mumble\nWantin' to jump dude, but let that nigga punk you, knowin bitch niggas wanna bring guns to the rumbles (IGH!)\nBut I love y'all souls (IGH!) Don't let the +Juice+ spill Pac\nBlue pill pop 'til you feel good enough to pop the popped bitch in the blue heels yop (IGH!)\nThat one - drown in the juice nigga; hun'nid proof get found in a youth nigga\nStop with all the trynna introduce nigga, everybody know you dude you the new nigga! (IGH!)\nHows it feel to be you? Yo no sÃ©, I ain't really been myself since Rod passed\nI ain't even really need that shop class, I ain't really been weak since pops smashed\nI'm a genius, a mothafuckin pop smash; hit sensei, master\nJack and Lindsey, Wiley, Kembe, been paid, 10 Day been they FAFSA (AHHHHHHHHH!!!!! TURN UP! TURN UP!)\n\n[Chorus]\n\n[Chance The Rapper]\nJuuuuugo.. you never tasted paper\nTripped, racing yaself trynna chase the paper\nI just faced a Vega and you love being Kobe when you make the lay up\n'til you realize everybody in the world fuckin hates the Lakers\nHahahah, and then everybody wanna sip\n'til the juice spill everybody want a bib, and then everybody wanna dip\nTold you I ain't worried, I ain't scared of the booth, all you can do is spit a verse of the truth\nMerge the mixture with the purest and the fruits and the thirst, just the worst, it's the curse of the juice\n\n[Chorus] + [Interlude]\n\n[Chance The Rapper - first half over Interlude]\nJuice, juice, juice, juice... yup!\nJuice, juice, juice, juice... yup!\nJuice, juice, juice, juice... yup!\nJuice, juice, juice, juice... yup!\nYup! Yup! ...Yup!"}, "The Writer (S)": {"The Writer": "\n[Intro]\nNiggas try to come at me and shit like\nOn some like, I only write slow songs\nAnd I only write...church and\nHow many of y'all are fucking with me with a pen, period?\n\n[Verse 1]\nI'm a writer, probably as good as Elton John\nBut whats writing good for if it ain't helping moms?\nI'm tryna feed Japan while seeing sights of Lebanon\nAnd wiping away tears of girls that's getting felted on\nI'm tryna get my felt pen on but the block is hot\nMy hands is questioning if I'm bach or not\nIf I'm 2Pac or nonexistent to these juggernauts\nBut I'm a architect an astronaut an argonaut\nSo hey, you, get off my couch\nYou don't know me stay the fuck out my mouth\nBut I'm a writer you can quote it out loud\nA false poet get my dough and I'm out\nBut here's an eighth of shrooms for your earlobe\nA little rap wrapped in cigarillo\nA little bit of Wu-Tang, mixed with some Henry David Thoreau\nA little ponder theory you can ponder on your pillow\nBut this is for the day that your dad dies\nPuffin' some reason all you hearing is sad sighs\nYou searchin' for nostalgia but sad and you can't cry\nSo you check your iPod in search for some bad vibes\nFrom that rap guy, who raps over sad vibes\nI wrote it in an hour dawg, don't know what your dads like\nHe probably was a great dad, he's probably in paradise\nYou want deeply in heartbreak and sadly I can't write, nothing\nThis is for those who wrote suicide notes\nAnd all the hipster girls that was super fly dope\nYou looking at her nose what you do besides coke\nYou looking at her palms what you do besides dope\nNothing, life is but a supersized note\nI open up my mind like suicide door\nAnd grab a pimp cane and a superfly coat\nHave they bobbing they heads to something stupid I wrote I hope"}, "I Am Very Very Lonely (S)": {"I Am Very Very Lonely": "\n[Verse 1]\nIt's just me and la cucaracha tonight\nCold pizza with the hot Sriracha tonight\nApple TV, Comcast, don't know what to watch-a tonight\nShoulda had ya when I had ya, now I wish I gotcha tonight\n\n[Chorus x2]\nYou can hit my line\nIf you ain't on shit, if you tryna smoke\n\n[Verse 2]\nI guess I'll file the cabinets, fix the disha washa, tonight (lot of activities)\nFeed the fishes twist a swisha while I mix the pasta tonight (multitasking)\nTube socks white briefs gold wrista watcha tonight (fancy attire)\nOn the sofa posted perfect selfie picture posture tonight (Snapchat bitch)\n\n[Chorus]\n\n[Verse 3]\nThis is not the castle this is just the casa tonight\nAin't no Nala so my Simba ain't gon' be Mufasa tonight\nOnly dust and shadows comin' from la cucaracha tonight\nBut if you eva in the hood like Mr. Rogers, hit my\n\n[Chorus]"}, "Burn the City (S)": {"Burn the City": "\nScreaming Burn It down!\nToo Loud, Too dank, for you to turn it down\nBad bitches running round like shirtless now\nShits just Perfect Now\nWhen it's worth it why the fuck would I get nervous now\nSo Shop with me on Mary\nAnd Fuck with me on Sherrif\nPuttin Caramel On garretts\nYellin \"Fuck The Heat On Derrick\"\nI'm a city based N-word\n27's, Port's and Spirit's\nBeen trying to Share that dinner\nCan't Inherit from your Parents\n#Igh\nI was rollin a blunt when I wrote this\nI was smoking a blunt when I spoke this\nHocus Pocus\nHows that for a smoke trick\nCouldn't pay attention\nNow I can afford focus\nGot a lil Buzz and they got fuckin bogus\nLike How you swat a flying locust?\nBut it's actually dope...\nAcid, adderol and adjectives\nAn Adolescent I could fuck with?\n#Igh's his fuckin Ad-lib?\nBurn Burn\nCity we built\nYou already forgot the names\nOf kids that we killed\nBurn Burn\nIt's Hot as all fuck\nCause everyone got burner\nCause it's always gettin buck\n#Igh"}}, "Chance The Rapper f/ Future": {"Coloring Book (Mixtape)": {"Smoke Break": "\n[Intro: Chance The Rapper]\nWe just be smoking a bowl\nWe just be smoking\nWe just be smoking a bowl\nWe just be smoking a bowl\nWe just be\nWe just be smoking a bowl\nWe just be smoking a bowl\nWe just be smoking a, we just\nFuck is going on? When did we buy a bowl?\n\n[Verse 1: Chance The Rapper]\nWe just be smoking a bowl\nWe ain't got no time to roll\nI'm always out on the road\nShe don't got time for a whole\nLittle bit of time that we have\nWe used to purchase a half\nThere don't be no time to smoke\nI'm always throwing on clothes\nShe always throwing a fit\nWe don't got no time for no sex\nI just put milk in the bowl\nShe don't be cooking at all\nShe just put weed in the bowl\nShe don't have time for herself\nShe putting points on the board, yes\nYou know she carry her own\nYou know she carry a child\nShe wake up at crack of dawn\nShe don't be cracking a smile\nSo when she packing the bowl\nI grab her, I tell her...\n\n[Chorus: Chance The Rapper]\nLet me crack this blunt\nSlow it down for a second\nBreak it down oh\nShe said, \"let me lick this blunt\"\nSlow it down for a second\nBreak it down oh\nWe deserve, we deserve\nWe deserve, we deserve\nA smoke break\nWe deserve, we deserve\nWe deserve, we deserve\nA smoke break\n\n[Verse 2: Chance The Rapper]\nTruth being told, we used to movies and bowl\nWe used to Netflix and roll\nI used to pass her the smoke\nShe used to laugh at my jokes\nYou pat my back when I choke\nWish we were stuck in our ways\nWe way too young to get old\nWe stuck together like oowops\nWe smoked a fatty sing Zoo-Wap\nTraphouse 3, Guwop\nI shoulda knew when I grew up\nIt would be no time at all\nWe went from White Owls to Raws\nWe went from joints to a bowl\nShe need a second to breathe\nWe need an actual smoke sesh\n\n[Chorus: Chance The Rapper]\nLet me crack your back\nSlow it down for a second\nTake it down oh\nLet me run this back\nSlow it down for a minute\nYou deserve, you deserve\nWe deserve, we deserve\nWe deserve, we deserve\nA smoke break\nWe deserve, we deserve\nWe deserve, we deserve\nA smoke break\n\n[Verse 3: Future]\nI don't have time to finesse\nI put some ice on your neck\nBut I ain't holding your back\nI spend my time on the road\nSuper ain't saving no hoes\nI don't have time to patrol\nLet me break these bales right down for a second\nWhen it touch down oh\nI got to lay back the roof\nI got to break the new rules\nShe can't be taking no cost\nWhen she involved with a boss\nPlease don't get lost in the sauce\nPlease don't get lost in the sauce\nShe been like this from the door\nTold me my mom was a whore\nI gave her percs for myself\nI give a perc full of steam\nI'm tryna crown me a queen\nYou hear the chains when they cling\nI take the molly its clean\nI push the whip with the wings\nI gotta be oversea, I gotta be on the pedal\nI push it down to the floor\nI got designer galore\nI keep some Goyard and geuss\nI smoke out all of my cars\nYou smell the weed in the air\nYou smell the smoke in the seats\nYou went and had our child\nYou didn't abandon the D\nYou got me twisted at least\nYou can...\n\n[Chorus: Chance The Rapper &amp; Future]\nLet me crack your back\nLet me rub you all over\nTake it down oh\nLet me make this blunt\nMake you dinner or somethin'\nYou deserve, you deserve\nWe deserve, we deserve\nWe deserve, we deserve\nA smoke break\nWe deserve, we deserve\nWe deserve, we deserve\nA smoke break"}}, "Chance The Rapper f/ Action Bronson": {"Acid Rap": {"NaNa": "\n[Intro: Chance The Rapper]\nNo, no no no, no no no (IGH!)\nNo no no, no no no (IGH!)\nNo no no, no no no (IGH!)\n\n[Chance The Rapper]\nIntroducin' (IGH!) Chance the Ruthless\nTrip 'shrooms and lucy (hah!) dreams is lucid\nLoosely based on music, swallow my mucus\nHope your pussy get herpes and yo' ass get lupus (IGH!)\nDeuces douches, deuce deuce I'll shoot ya (BLAOW)\nShoes might boot 'cha and a suit might suit 'cha\nThey be on bullshit but they really don't do shit\nThey use of illusion could confuse Confucius\nNasty, ashy (IGH!) cigarette ashin'\n'til my voice get raspy; last week suspended\nLast night kissed Va$htie, parleyed with Ashley\nAlways in the hallway, so I never been classy (hahaha)\nShut up!\n\n[Chorus: Chance The Rapper]\nNa na na, na na na\nNa na na, na na na\nNa na na, na na na\n\n(IGH! IGH! IGH! IGH!)\n\n[Chance the Rapper]\nAcid, acid (IGH!) get it? Acid\nMelts through plastic, I spit fired\nPad my palette (IGH!) talkin' paper\nIf this was work (IGH!) I'd get higher (hahah)\nPardon my mishaps, burp and get murdered (IGH!)\nFart and get bitch-slapped, like Bourbon mixed with Jack (IGH!)\nLickety-split, look it, he slipped on a shell\nfrom peelin' (IGH!) banana splits back, give me my Kit-Kat (AHHHHH~!)\nDon't break me off shit, batch, fack is you mean bitch?\nZan with that lean bitch, zan with that lean bitch\nZen with that chakra, I eat it like Idi Amin\nYa kna wha mean? Hit me back when that mean shit (SHUT UP~!)\n\n[Chorus]\n\n[Action Bronson]\nNa na na.. na na na.. na na na\nUhh, it's me, uh (oww oww oww oww!)\nyow yow, ying-yow\nUhh, yow, yow yow, yeah, uhh\n\nIntroducin', Itâ\u0080\u0099s Bronsonlino (it's me)\nWith my hair slicked back, I look like Rick Pitino (uh)\n3 Japanese dykes in my El Camino (haha)\nLettin' trees blow, oh (yeah)\nI rep the East Coast (uh) I got a team of hoes like Pat Summit\nI look like Arnold Schwarzenegger in a black hummer (Get to the chopper!)\nI splash summer like a fast brother\nWith a number on his back, ainâ\u0080\u0099t no fumblin', in fact, Iâ\u0080\u0099m -\nback, acid in my hat\nShoot then pass the gat, it's at the bottom of the river in a plastic bag\nMy new shorty got a gymnastic back (uh)\n87 emerald green on a classic jag\nShe had the cleft palate (uh) I ordered chefâ\u0080\u0099s salad (okay)\nShe had the club foot (what else) with that little arm (haha)\nI couldnâ\u0080\u0099t help but laugh, she ordered Chicken Parm\nI had the full Bulls warm-up with the Pippens on (it's me)\n\nNa na na, na na na\nNa na na, na na na\nSuck my motherfucking dick, it's the young Randy Velarde\nQueens, baby, uh\nNa na na, na na na\nNa na na, {*gibberish, followed by coughing*}\nBlow me!"}}, "Chance The Rapper f/ Saba": {"Coloring Book (Mixtape)": {"Angels": "\nAngels, na, na, na, na\n\nI got my city doing front flips\nWhen every father, mayor, rapper jump ship\nI guess that's why they call it where I stay\nClean up the streets, so my daughter can have somewhere to play\nI'm the blueprint to a real man\nSome of these niggas toss they tassel for a deal man\nI ain't going to hell or the Hillman\nIgh, Igh, Igh, Igh, for my real fans\nI got caught up with a little Xan\nCan't stop me but it slow me though\nYeah nigga famous, you don't know me though\nBut every DJ still play me though\nDamn man, I don't even need a radio\nAnd my new shit sound like a rodeo\nGot the old folks dancing the Do-si-do\nSo they fuck around, sign me to OVO\nOooh, I just might share my next one with Keef\nGot the industry in disbelief, they be asking for beef\nThis what it sound like when God split an atom with me\nI even have Steve giving out apples for free\n\n[Chorus: Saba]\nThey was talking \"woo woo this woo wap da bam\"\nCity so damn great, I feel like Alexand'\nWear your halo like a hat, that's like the latest fashion\nI got angels all around me they keep me surrounded\n\nWho is you? And who the fuck is you? And who is him?\nAll of the sudden woo wap da bam you can't touch me\nNa, na, na, na I got angels\nI got angels\n\nI ain't change my number since the seventh grade\nThis for my day one, ten years, seven days\nA week, nigga's never tired on they Kevin Gates\nAnd if they rest in peace they bunny hopping heaven's gates\nIt's too many young angels on the southside\nGot us scared to let our grandmommas outside\nYou gonna make me take the campers way downtown\nYou gonna make me turn my BM to my housewife\nI just had a growth spurt\nIt done took so long, my tippy toes hurt\nYou can keep the nose ring, I don't have to soul search\nI'm still at my old church, only ever sold merch\nGrandma say I'm Kosher, momma say I'm culture\nGCI, 1-0-7-5, angel goin' live\nPower 92, angel, juke, angel gon' juke\nGCI, 1-0-7-5, goin' live\nPower 92, angel gon' juke, juke, juke, juke\n\n[Chorus: Saba] &amp; (Chance The Rapper)\nThey was talking \"woo woo this woo wap da bam\"\nCity so damn great, I feel like Alexand'\nWear your halo like a hat, that's like the latest fashion\nI got angels all around me, they keep me surrounded\nWap the bam (na, na, na)\n(I got angels) I got angels all around me they keep me surrounded\n(Na, na, na)\n(I got angels)\nThey was talking \"woo woo this woo wap da bam\"\nCity so damn great, I feel like Alexand'\nWear your halo like a hat, that's like the latest fashion\nI got angels all around me, they keep me surrounded\n\nWho is you? And who the fuck is you? And who is him?\nAll of the sudden woo wap da bam you can't touch me\nNa, na, na, na I got angels\nI got angels\n\nNa, na\nNa, na\nI got, I got"}}, "Chance The Rapper f/ Detail": {"I Ain't Word (S)": {"I Ain't Word": "\n[Chorus: Detail] + (Chance)\nYou can look me in my face\nI ain't got no worries (I ain't word) [x3]\nSee them shroomies keep me up\nSo I ain't got no worries (I ain't word) [x3]\nYou see money right there\nYeah that's (me) right there\nYeah that's (me) right there\nAnd we ain't got no worries\nYou see pussy right there\nRedbone mangos right there\nSee them shroomies right there\nWe ain't got no worries\n\n[Verse 1]\nD. Rose on that ass\nThat means back again\nI hit my Zan so hard\nMan, I've been practicing\nI'm going straight to the league\nAnd not by accident\nDon't get your ass kicked in\nI hoop in Shaq's and Timbs\nChit chat with Chris Mintz-Plasse\nAnd laugh at Jags and rims\nT-T-Y-L-ing the labels\nAnd L-O-L-ing their friends\nHello Hell and Heaven\nYou haven't heard the half of it\nHave at it half happy\n30-something-year old\nBroke graduate\nOver the wave like Du-rags\nGetting paper like dude rap\n19 making that\nI could be damn near fucking Erykah Badu rap\nGirbaud flow is too strapped\nMy screws loose, I'm too slapped\nJust got this bitch too turnt\nJust got my nose 2Pac'd\nL.A Reid like whose that\nJimmy Iovine like whose that\nWhole world like whose that\nWhole hood like 'dude ass'\nI'm from little shorties with the shot up shirt\nWhere babies get kilt like a Scottish skirt\n95-ing down the Ryan\nAnd I'm flying, skirt\nKeep asking if I'm trying\nNigga, I ain't word\n\n[Chorus]\n\n[Verse 2]\nUnreluctant optimist\nMost poppingest\nGot popular\nTry topping this\nTriceratops\nBJs from baby bopping bitches\nThroat lozenges\nMassaging it\nNo touching it\nOkay, touch on it\nBut don't rush on it\nRation it, passionate\nWhile imagining me\nSmashing it\nDash out at like 4:30\nHands smelling like potpourri\nThey ain't gettin hung\nMy nigga, no jury\nSo I don't give no nigga no mercy\nWhen my little fucking brother rap better than you\nMy shit get's your girl way wetter than you\nYou rap veterans you\nMy nerdy brethren you\nStuff you in a fuckin locker, 10 day letterman you\nYou wanna jock me, jockers (AAH)\nMy style's fathering you\nI know it's bothering you\nProbably an anomaly\nBut it's probably niggas that's probably starving for new\nShit you could sound like\nThat's that shit that I don't like\nBut I ain't really worried\nI'm a wordy motherfucker\nI could hurry\nBut I'm buried in her pussy from the last tape\n\n[Chorus]"}}, "Chance The Rapper f/ Knox Fortune": {"Coloring Book (Mixtape)": {"All Night": "\n[Intro: HaHa Davis]\nCome on, big fella, you drunk, big fella\nTwo sips and now you wanna trip, big fella\nYou not a drinker, I can see it all in your leg, big fella\nYou wobbly, big fella, you finna fall\nSit down, you drunk, big fella\n\n[Chorus: Knox Fortune]\nAll night, I been drinking all night\nI been drinking all night, I been drinking, ay ay\nAll night, I been drinking all night\nI been drinking all night, I been drinking, hey\nAll night, I been drinking all night\nI been drinking all night, I been drinking, ay ay\n\n[Verse 1: Chance The Rapper]\nEverybody outside, everybody outside\nWhen I pull up outside, all night, no\nEverybody high five, everybody wanna smile\nEverybody wanna lie, that's nice, no\nOh, now you wanna chill, oh, now you wanna build\nOh, now you got the bill, that's cool though\nOh, now you got the gas, oh, now you wanna laugh\nOh, now you need a cab, that's true though\nAll you do is talk, I ain't got shit to say\nCan't no one get in my car, I don't even valet\nLong discussions, oh, you my cousin?\nNo you wasn't, you just wanna ride\nYou just wanna talk about politics, Chicago shit and rocket ships\n(You just wanna, you just wanna, you just wanna, you just wanna, you just wanna, you just wanna)\nShut up! Start dancing, ho\n\n[Chorus: Knox Fortune]\nAll night, I been drinking all night\nI been drinking all night, I been drinking, ay ay\nAll night, I been drinking all night\nI been drinking all night, I been drinking, hey\nAll night, I been drinking all night\nI been drinking all night, I been drinking, ay ay\n\n[Verse 2: Chance The Rapper]\nYou just went and spilt fries in the seat\nIt's fried on the seat, come ride on the seat, ay\nLast girl, she'll lie on the seat, she'll fart on the seat\nNow she jog in the streets, say\nI don't trust no one faking like a fan, asking for a pic\nYou should use your phone, call a Uber\nYou a goofy if you think I don't know you need a lyft\nIs you is or is you ain't got gas money\nNo IOU's or debit cards, I need cash money\nSo back up, back up, I need space\nNow, I need you to slow down, it's not a race\nNow I can't really hear what you gotta say now\nShut up! Start dancing, ho\n\n[Chorus: Knox Fortune]\nAll night, I been drinking all night\nI been drinking all night, I been drinking, ay ay\nAll night, I been drinking all night\nI been drinking all night, I been drinking, hey\nAll night, I been drinking all night\nI been drinking all night, I been drinking, ay ay"}}, "Chance The Rapper f/ Kirk Franklin, Noname": {"Coloring Book (Mixtape)": {"Drown": "\n[Intro]\nThe water may be deeper than its ever been\n\n[Verse 1: Noname]\nLord rain down on me so I can move on water\nLike children at the altar, like God inside my house\nI love you, I love you, you looking holy like Mama\nYou made a church out of feathers\nSo when she fly to the Father\nShe know the choir gon' follow and all the offering paid\nShe gave my name away to your holy house\nShe like my blessings in disguise\nShe like her Jesus mountain high\nSo he can watch her lonely child\nI know my God\nI know my God seen his breaks and his edges\nA jacket for giving that painted his city in gold\nLike everything is everything\nLike all them days he prayed with me\nLike emptiness was tamed in me\nAnd all that was left was his love\nAnd all that was left was his love\nAnd all that was left was his lov\n\n[Chorus]\nNever, never drown\nThe water may be deeper than its ever been\nNever drown\nThe water may be deeper than its ever been\nNever drown\n\n[Verse 2: Kirk Franklin]\nNever, never, never\nChance let me hear 'em\nThis thirst in my soul\nThere's a thirst in my soul and tell me\nWhere I stand I go\nWhere\nFor you\nCome on\nI may cry a river\nI may cry a thousand tears\nBut you take it [?] and you wash\nYou wash me new\nMe new\nPeople sing\nThis water is deep\nYes\nThis water is\nYes and I need you to\nJesus rescue me\nCome on, I need you to\nTake me to your mountain\nHallelujah\nSo someday Chicago will be free\nSomeday we'll all be free\nBe free\n\n[Chorus]\nThe water may be deeper than its ever been\nNever drown\nThe water may be deeper than its ever been\nNever drown"}}, "Chance The Rapper f/ Twista, Vic Mensa": {"Acid Rap": {"Cocoa Butter Kisses": "\n[Chance The Rapper]\nNa-na-na-na-na, na-na-na-na-na - IGH!\nNa-na-na-na-na, na-na-na-na-na - IGH!\n\n[Chorus One 2X: Chance the Rapper]\nCigarettes on cigarettes, my mama think I stank\nI got burn holes in my hoodies, all my homies think it's dank\nI miss my cocoa butter kisses...\nI miss my cocoa butter kisses...\n\n[Chance The Rapper]\nOkie dokie, alky, keep it lowkey/Loki like Thor lil bro\nor he'll go blow the loudy, saudy of sour Saudi\nWiley up off peyote, wildin'/Wile E. like that coyote\nIf I sip any Henny, my belly just might be outtie\nPull up inside a huggy, Starsky &amp; Hutch a dougie\nI just opened up the pack, in an hour I'll ash my lucky\nTonight she just yellin' \"fuck me\", two weeks she'll be yellin' \"fuck me\"\nUsed to like orange cassette tapes with Timmy, Tommy, and Chuckie\nAnd Chuck E. Cheese's pizzas, Jesus pieces, sing Jesus love me\nPut Visine inside my eyes so my grandma would fuckin' hug me\nOh generation above me, I know you still remember me\nMy afro look just like daddy's, y'all taught me how to go huntin'\nBLAM~!!\n\n[Chorus One]\n\n[Vic Mensa]\nInnanet... Innanet\nI will, smoke a little something but I don't inhale\nEverywhere that I go, everywhere they be askin' \"how's it goin'?\" Say the goings, well\nGo figure, Victor's light skinned, Jesus got me feeling like Colin Powell\nAll praise to the God; God knows he's a pro, he's a pro like COIN-TEL\nCheck, check mate, check me take me to the bedroom, let you know me well\nI mean normally, you see Norma Jean wouldn't kick it with Farmer Phil\nBut these kids these days, they get so high, burn trees, smoke chlorophyll\n'til they can't feel shit, shit-faced, faced it, 15 hits on this L\nElevated, train, and the craziest thang got me feeling like Lauryn Hill, +Miseducated+, my dick delegated\nRap Bill Bellamy, they said I shoulda never made it, probably shoulda been dead or in jail\nDeadbeat dad, enough of that jazz, asshole, absynthe up in that glass\n+Are We There Yet?+ Ice Cubes in a bong; rip, brain dead, take a tug and then pass\nI think we all addicted, yeah...\nI think we all addicted, really though...\nI think we all addicted, yup...\nI think we all addicted\n\n[Chorus Two: Vic Mensa]\nCigarettes on cigarettes, my momma think I stank\nI got burn holes in my memories, my homies think it's dank\nI miss my cocoa butter kisses...\nI think we all addicted...\n\n[Chorus One] - 1X w/ Vic Mensa singing along\n\n[Twista]\nTwista~!\nI could make a flow, pitter patter with a patter pitter - juicy; used to be in a jalabiya and a kufi\nTrying hard not to be addicted to a groupie, I ended up on an album cover in a Coogi\nYou see, I be still a God but a goofy; you be, flowin' about drugs and a Uzi\nThat's the new principle, sometimes I'mma be about some hoes, sometimes I'mma wanna +Make A Movie+\nAnd when it come to rapping fast, I'm the Higgs Boson (yeah); and though my style freakish\nI could still break your body down to five pieces like I did Voltron (yeah) cause I'm addicted to the craft and I be off of OG\nKnow me, I'm the Obi-Wan Kenobi of the dope see (what) never scared of mean spirits, methamphetamine lyrics\nCooler like I'm offa codeine, low key (haha) don't, be, so, judg-ment-al\nEven though I'm reminiscing I f I don't know what I (what) miss is, I'ma end up figuring out that it's home\nAnd my mother and my grandmother cocoa butter (what) kisses, this is just a testament to the ones that raised me\nThe ones that I praise and I'm thankin' (yes); I need em but the chronic all up in my clothes\nAnd I wanna get a hug, and I can't cause I'm stankin' (no) never too old for a spanking - IGH!\n\n[Chorus Two]\n\n[Chorus One] w/ Vic Mensa singing along the second time"}}, "Chance The Rapper f/ Ab-Soul": {"Acid Rap": {"Smoke Again": "\n[Intro: Chance The Rapper]\nIGH! Hmm-mm-mmm (IGH!)\nDa-da-da-da-da-da-da, da-da-da-da-da-da - +Acid Rap+!\n\n[Chorus 2X: chopped and screwed voice]\nI don't even talk to them on the phone again, leave in the AM, on the road again\nSo bitch, let's fuck so I can smoke again, I gotta smoke again, I got shit to do\n\n[Chance The Rapper]\nWho smokin in my car? It's that nigga Chano\nAKA Mr. Bennett, AK Tony Montano\nI've got some folks in low end, I got some folks in c-note\nAK hundred dinero, you ever seen Casino?\nI just got back with 'Bino, I got a bitch but she know\nHer friends done did the Dino - that's that Chicago lingo\nFlamin' hots with Cheese and a kiwi Mistic\nMy dick won't even call her cause she left all that lipstick\nNiggas be on dirt, that's why I stay on petty\nI know that bangers jam, that's why my hands stay ready\nFlip the candy yum, that's the fuckin' bombest\nLean all on the square - that's a FUCKIN' rhombus\n\n[Chorus] - 2X\n\n[Chance the Rapper]\nWho's sneakin' in the club? That's that young Sir Rapper\nUn-saran wrap the purple, wrap that blunt under after\nSmoke all out the window, cops could eat a dick\nIf you ain't the hitter, you just might be the lick\nFlame on, flame on, I'm your, bitch's ringtone\nShe like when I rap, raps but better when I sing, songs\nNo Drake, but I get my Trey on; killin' in the hood like Trayvon\nShoppin' like I got a coupon, savin' like I got a cape on\nCookin' crack in my apron, dressed like a nigga had 8 proms\nTell shorty I may change and I made it and I napalm\nTrippy shit to watch, drugs while on the clock\nAcid on the face - that's a work of art\n\n[Chorus] - 2X\n\n[Ab-Soul]\nSoulo ho, ho twerk somethin' (Soulo) throw it back like you tryna hurt somethin' (Soulo)\nI'm so def, I ain't ever heard nothin'; my name Herb, take herb, smoke herb (say word?)\nHeh, how 'bout you? No dap, but I'll take a pound or two\n+No Doubt+ like Gwen Stefani's group, look let me put my mouth where you potty, boo\n(Hahaha) IGH! I can't get that, yeah\nThem niggas pissed, need potty trainin', they movement shit, that's a potty train (uh)\nShe ain't left yet, but she probably came, we kicked it then I scored - soccer game (yeah)\nShe was a phony goalie, I got great aim though, don't insult me\nI'll give it to ya straight, this is what she told me, my name Soulo cause I'm the one and only (Soulo)\nShe only got you as a nigga on the side - that's a nigga on the side of a side bitch, homie (ay)\nThen we got out a Dodge, like them Dukes of Hazzard\nMusic and tabs of Lucy, take your chance with this rapper\nSoul~!\n\n[Chorus] - 2X"}}, "Chance The Rapper f/ Lili K. *, Nate Fox": {"Acid Rap": {"Pusha Man": "\n* Lili K. is on background vocals\n\n[Chance The Rapper]\nTen -- damn -- days\nAnd all I got to show for it is shoes and shows and chauffeurs with road rage\nStill the same damn ad-lib: IGH! Old, ways\nStill gotta letterman, no practice; still gotta burner man, no lackin'\nStill outtin Jams nigga, no Jackson; no Jordan and we toe-taggin'\nI'll take you to the land where the lake made of sand and the milk don't pour and the honey don't dance and the money ain't yours\nNow its just a red pill, got a blue and a hand full of Advils\nI'm the new Nitty, fuck it Nitty the old me so I'mma tell the buyer what Nitty told me\n\n[Chorus 2X: Nate Fox - second time chopped and screwed]\nI got that mmm-mmm, I got that Goddamn\nI'm yo' pusha man, I'm yo', I'm your pusha man\nPimp slappin', toe taggin', I'm just tryna fight the man\nI'm yo' pusha man, I'm yo', I'm yo' pusha man\n\n[Nate Fox - chopped and screwed]\nPimp slappin', toe taggin', I'm just tryna fight the man\nI'm yo' pusha man, I'm yo', I'm yo' pusha man\n\n[Chance The Rapper]\nYou a laaaaaaaame, and your bitch break down my weed sometimes\nSee my face in the streets, in the tweets and a Reader or a RedEye if you read Sun-Times\nShe got blisters on her knees, she's a fiend for the D even though I only beat one time\nOne time, it was one two times, it was two plus me equals threesome time\nShouts out to Nate, I jackball and I bop, I flex\nGot neck from all these thots I sex; Rastafari them shottas yes\nHouse safari, mi casa, yes; poppy fields of that popeye\nShe came to party, she popped a Molly, said \"come to papa\", she said \"papa, yes\"\n\n[Chorus]"}}, "Chance The Rapper f/ HaHa Davis": {"Coloring Book (Mixtape)": {"Blessings (Reprise)": "\n[Verse]\nI speak of promise land\nSoil as soft as momma's hands\nRunning water, standing still\nEndless fields of daffodils and chamomile\nRice under black beans\nWalked into Apple with cracked screens\nAnd told prophetic stories of freedom\nFound warmth in a Black queen for when I get cold\nLike Nat King, I'm doing the dad thing\nI speak of wondrous unfamiliar lessons from childhood\nMake you remember how to smile good\nI'm pre-currency post-language, anti-label\nPro-famous, I'm Broadway Joe Namath\nKanye's best prodigy\nHe ain't signed me but he proud of me\nI got some ideas that you gotta see\nMake a vid with shawty and they ship it like the odyssey\nThey never seen a rapper practice modesty\nI never practice, I only perform\nI don't even warn, I don't eat it warm, I won't be reborn\nI speak to God in public, I speak to God in public\nHe keep my rhymes in couplets\nHe think the new shit jam, I think we mutual fans\nI used to dance to Michael, I used to dance in high school\nI used to pass out music, I still pass out music\nThe people's champ must be everything the people can't be\nI'm getting artsy-farsy, house full of some Hebru Brantleys\nYou must've missed the come up, I must be all I can be\nCall me Mister Mufasa, I had to master stampedes\n\n[Chorus]\nI made it through, made it through, made it through\nAnd everything I gave to you, I gave to you, I gave to you\nYou got it, you got it, you got it, it's coming, coming, coming\nSo are you ready?\n\n[Outro: with harmonization] + (HaHa Davis)\nAre you ready for your blessings?\nAre you ready for your miracle?\nAre you ready for your blessings?\nAre you ready for your miracle?\nAre you ready for your blessings?\nAre you ready for your miracle?\nAre you ready for your blessings?\nAre you ready for your miracle?\nAre you ready for your blessings?\nAre you ready for your miracle?\nAre you ready for your blessings?\nAre you ready for your miracle?\nAre you ready for your blessings?\nAre you ready for your miracle?\nAre you ready, are you ready?\nAre you ready for your blessings?\nAre you ready for your miracle?\nAre you ready for your blessings?\nAre you ready for your miracle?\nAre you ready for your blessings?\nAre you ready for your miracle?\nAre you ready for your blessings?\nAre you ready for your miracle?\nAre you ready for your blessings?\nAre you ready for your miracle?\n(You ready big fella?)"}}, "Chance The Rapper f/ Lili K, Peter CottonTale": {"10 Day (Mixtape)": {"Hey Ma": "\n[Intro]\nHey Ma, hey Ma, hey Ma\nHey Ma, hey Ma, hey Ma\n\n[Verse 1]\nI said 'Hey Ma', don't go stretching your wallet\nThese niggas gotta pay me for taking a year from college\nGo on get ya nails polished, stylist for your eyelids\nAnd a pilot for your mileage for them frequent flights to your island\nMs. Brown and Ms. Polleck, little boy done grown up\nLittle voice done blown up, middle-class that bonus\nHey Ma, Hey Mama Jan; God just gave me another chance\nRod just gave me another line, probably gave me another fan\n7-7-3, Oh, since Kanye was a three-old\nDown the street from D. Rose, was practicing his free-throws\nShout out to that Gulf Shrimp, shout out to King Gyro\nShout out that Ms. Moody, auntie Toni them my heroes\n\n[Chorus: x2]\nWe gon' get this paper, put that on my mama\nYou gon' see us later, put that on my mama\nMonica and Ava, thanks for all the favors\nGot my money saved up, put that on my mama\n\n[Verse 2]\nHey Ma, hey Ma I know I never did behave a lot\nNever got good grades a lot\nAnd turned your hairs to grays a lot\nAnd go in stores and take a lot\nAnd never shopped but saved a lot\nSo you ain't gotta shop at Save A Lot\nAnd you ain't gotta worry about Chase a lot\nThey playing with your checks, your shit\nCause they gonna take your pay or not\nQue Sera gotta then, fuck them niggas you smarter than\nWe just gonna beg your pardon them\nSave Money, my partner and them\nI'm part of them, It's part of me\nThis Save Mula, Bo Squarter III\nI'm riding around my side of town\nHot boxing no cops around\nI had the tux I had the gown\nJust had a show, just had to bounce\nIt's Chance ho, #10Day\nChano no hable englais\nThat language be that chanish but ooh! Muy caliente\nSo she just gonna throw her steps on\nAnd haters gonna throw that epsom\nAnd we just gonna throw a party\nAnd I'm gonna just throw my teflon\nCause family be that plug though\nAnd I ain't even flexin\nBut twin bro be that Victor\nAnd Big Cause be that Chef Sean\n\n[Bridge: x2]\nI said don't stop, in what you be\nIn what you do, don't stop\n\n[Chorus]\n\n[Outro]\nAyo I wanna thank, MC Tree mama\nI wanna thank Fox mama, I wanna thank Robbie mama\nLili mama, Peter mama\nMY mama, my dad mama\nYour mama, I wanna thank moms\nI wanna thank, L-Boog mama, I wanna thank Tom Fool mama\nI wanna thank, Talent mama, Marcus mama\nI wanna thank, Thelonious mama, Vic mama, Reese mama\nI just wanna, I wanna thank anybody whose been a mother to a motherless child\nI love you mommy\n10Day\nI hope y'all had a good time\nAgh!"}}, "Chance The Rapper f/ Jay Electronica, My Cousin Nicole": {"Coloring Book (Mixtape)": {"How Great": "\n[Intro: My Cousin Nicole]\nHow great is our God\nSing with me, how great is our God\nAll will see how great is our God\nHow great is our God\nSing with me, how great is our God\nAll will see, how great, how great, is our God\nName above all names\nWorthy of all praise\nAnd my heart will sing how great is our God\nName above all names\nWorthy of all praise\nAnd my heart will sing how great is our God\nHow great is our God\nSing with me, how great is our God\nAll will see how great is our God\nHow great, is our God\nSing with me, how great is our God\nAll will see, how great, how great, how great, how great, how great, how great, is our God\n\n[Intro skit]\nThe first, is that God is better than the world's best thing\nGod is better than the best thing that the world has to offer\n\n[Verse 1: Chance The Rapper]\nMagnify, magnify, lift it on high\nSpit it Spotify to qualify a spot on his side\nI cannot modify or ratify, my momma made me apple pies\nLullabies and alibis\nThe book don't end with Malachi\nDevil will win employee of the month by the dozen\nTill one score in three years from the third when he doesn't\nMy village raised 'em a child, come through the crib and it's bustin'\nYou meet anyone from my city, they gon' say that we cousins\nShabach barak, edify\nElectrified the enemy like Hedwig till he petrefied\nAny petty Peter Petigrew could get the pesticide\n79th, 79th, I don't believe in science\nI believe in signs\nDon't believe in signing, I see dollar signs\nColor white collar crime\nGood God, the gift of freedom\nHosena Santa invoked and woke up slaves from south Hampton to Chatham Manor\nMy dream girl's is behind me, feel like I'm James Early\nThe type of worship make Jesus come back a day early\nWith the faith of a pumpkin-seed-sized mustard seed\nHere, for I will speak noble things as they trusted me\nOnly righteous, I might just shrug at the skullduggery\nI couldn't stand to see another rapper lose custody\nExalt, Exalt, glorify\nDescend upon the earth with swords and fortify the borders where your shoulders lies\nI used to hide from God\nDucked down in the slums like \"shhh\"\n\n[Verse 2: Jay Electronica]\nI was lost in the jungle like Simba after the death of Mufasa\nNo hog, no meerkat, hakuna matata by day\nBut I spent my night time fighting tears back\nI prayed and prayed and left messages but never got no hear back\nOr so it seemed\nA mustard seed was all I needed to sow a dream\nI build the ark, gently, gently, I rowed my boat down Noah's stream\nSometimes the path I took to reach my petty goals was so extreme\nI was so far down in the mud couldn't even let my light shine\nBut she was always there when I needed to phone a friend or use a life line\nFrom a lofty height, wage won\nThe poltergeist to exalt the Christ\nSpark the dark with the pulse of light\nStrike a corpse with a pulse of life\nI spit on the Tidal of tidal waves\nI spit on the Apple and kill a worm\nA fire in Cali will swallow a valley for every African village burned\nJay Elect would've never made it\n'O son of man, O' son of man\nWho was the angel in Revelations with the foot on water and the foot on land\nWho was the angel that rode a Harley from the project to the house of Parliament\nAnd opened the book in the Devil's chamber and put the true name of the Lord in it\nOld Jerusalem, New Jerusalem\nCuff lights these beats with a ball of fire\nPoison the scripture and gave us the pictures of false messiahs\nIt was all a lie\nMystery babylon, tumbling down\nSatan's establishment crumbling down\nThis is the year that I come for the crown\nBury my enemies under the ground"}}, "Chance The Rapper f/ T-Pain": {"Coloring Book (Mixtape)": {"Finish Line": "\n[Bridge]\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do\nAnd we back, and we back, and we back, and we back\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do\nAnd we back, and we back, and we back\n\n[Verse 1: Chance The Rapper]\nThey ain't teaching taxes in school\nIt don't even matter I was acting a fool\nBut who would think their raps would turn into racks?\nDon't matter, matter fact, it could happen to you\nScars on my head I'm the boy who lived\nThe boy love playing when the boy too sick\nReclining on a prayer, I'm declining to help\nI've been lying to my body can't rely on myself\nLast year got addicted to xans\nSuffocated my name and starting missing my chance\nLA for four months end up leaving right back\nI'm in love with my city bitch I sleep in my hat\nI felt hog tied ever since my dog died\nHe lived to 84, damn, that's a long ride\nI know he up there he just siting there waiting\nI'll be racing up the stairs I'm a get to the gate singing\n\n[Bridge]\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do\n\n[Chorus: T-Pain]\nAll my days I prayed and prayed and now I see the finish line\nOh I'm gonna finish mine\nAll my days I prayed and prayed and now I see the finish line\nGonna finish mine\n\n[Verse 2: Chance The Rapper]\nGimme the water, gimme the water\nI need the kind from Space Jam\nGet this money, get this budget, KOK to day camp\nMe and my girl plan to stay to the end\nHope there never come a day where we be better as friends\nWe in a marathon we could build a marriage on\nArguments as parents digging deeper than a baritone\nI've been getting blocked just trying to make songs with friends\nLabels told me to my face that they own my friends\nI got to pray I got to pray, like Hammer after \"2 Legit\"\nI got the power I could poke Lucifer with crucifix\nI cannot scrap the stupid shit\nI \"Stand Up\" like I'm Ludacris\nI know some folks that talk so much they drive an Uber whip\nDamn, queen said why we in a queen bed\nI said its yours don't worry little bean head\nI'm just here to catch my breath I got a world tattoo\nShe said cool just bring me some food\n\n[Chorus: T-Pain]\nAll my days I prayed and prayed and now I see the finish line\nOh I'm gonna finish mine\nAll my days I prayed and prayed and now I see the finish line\nI'm gonna finish mine\n\n[Bridge]\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do-do-do\nDo-do-do-do-do"}}, "Chance The Rapper f/ Gzus Piece": {"10 Day (Mixtape)": {"Fuck You Tahm Bout": "\n[Intro/Chorus]\nI'm so turned up right now\nI'm on way past ten\nThink we made it though\nWe almost made it though\n\nFor anybody ever shitted on your dreams;\n... Fuck y'all\nHatin' niggas that was on your team;\n... Fuck y'all\nBitches that was caught up in the scene;\n... Fuck y'all\nNow everybody say the same thing\n... Fuck y'all\n\n[Verse 1: Gzus Piece]\nBeen down this block before\nI use to hustle on it frequently\nBeen working like a slave\nTrynna make sure all my peoples eat\nLast year you wouldn't speak to me\nBut now you wanna freak with me;\nBut I'm a still accept the pussy\nCause it's just the creep in me\nI do alot of shit that I won't rap on\nCause it's in the streets;\nIt's morals over money, and\nIt's silence over secrecy\nDamn, How you just gon' act\nLike I finna' make it?\nI'm thirsty on the ground\nLike big homie on that spaceship\nYea...\n\n[Chorus: Gzus Piece]\nI'm so turned up right now\nI'm on way past ten\nBut I still gotta ways to go\nWe gotta ways to go\nYea...\n\nI'm so turned up right now\nWhere should I begin?\nI think we made it though\nWe almost made it though\nYea...\n\n[Verse 2: Gzus Piece]\nI'm so close I can taste it\nAnd I'm not even wasted\nSay what's up to my cult\nWe here to lead you out the matrix\nWe get gear by the cases\nYou still stuck on that fake shit\nI roll the blunt and face it\nCause I just couldn't take it\nThis shit don't even make sense...\nHow could you even hate this?\nBut I guess I should thank them\nCause that's just motivation\nThem goofies ain't gon' say shit\nExcept Congratulations\nIt's funny, cause it's crazy\nLike them niggas that was hatin' on your way up\nJust know they gotta see you on their way down, straight up\nAnd in the stereo, the only way that you can play us\nIt's Treated undefeated;\nAnd we comin' for them majors... bitch\n\n[Chorus: Gzus Piece]\nI'm so turned up right now\nI'm on way past ten\nBut I still gotta ways to go\nWe gotta ways to go\nYea...\n\nI'm so turned up right now\nWhere should I begin?\nI think we made it though\nWe almost made it though\nYea...\n\n[Verse 3: Chance The Rapper]\nTouchdown\nWho you gon' trust now?\nWhen you blow...\nSpontaneous-ly combust now\nNow they wanna fuck now\nLike you give a fuck now\nYou use to be an unknown\nBut now you one of us now\nGo ahead and turn up,\nNigga, turn up\nAnd all them brain cells\nGetting burnt up\nIn a furnace,\nDon't concern us\nWith them problems of tommorow is a journey\nTurn up\n\n[Chorus/Outro: Gzus Piece]\nI'm so turned up right now\nI'm on way past ten\nBut I still gotta ways to go\nWe gotta ways to go\nYea...\n\nI'm so turned up right now\nWhere should I begin?\nI think we made it though\nWe almost made it though\nYea..."}}, "Chance The Rapper f/ Sulaiman, Vic Mensa": {"10 Day (Mixtape)": {"Family": "\n[Verse 1: Vic Mensa]\nTurn the radio up and we can have a good time\nGot me feeling like J.J. on Good Times\nBack when Thelma had that ass, hope the fam good\nMy sister said she likes my raps cause it sounds good\nTold me not to cut corners, use to cut quarters\nSitting in the room, on the phone, cooking up orders\nTill my pops popped me off, that was family matters\nUsed to watch him in the kitchen sipping Sammy Adams\nNow I'm rollin', iPhone Stolen\nMama whip with 5 of my guys, 4 holdin'\nTrying to live our lives like our lives are so golden\nGot big shoes to fill like try go bowling\nTil we strike out, we just hoping we don't strike out\n4th quarter, how you gon go and take Mike out?\nSummertime Chi, I had to pull the bike out\nRiding getting nice cause it's nice out\n\n[Chorus: Chance The Rapper]\nLet's land in the land where the Famo stay\nGrind all day til the fam okay\nIt still warm my heart to hear my grandma pray\nFor the fam of my friends when my mans go away\nLet's land in the land where the Famo stay\nGrind all day til the fam okay\nIt still warm my heart to hear my grandma pray\nFor the fam of my friends when my mans go away\n\n[Verse 2: Chance The Rapper]\nDon't wake up, don't wake up, don't wake up too fast\nDon't make up your mind, you should flake on that class\nSing all you want, just don't Drake on they ass\nShore you got drive, don't turn fake on they ass\nGood morning, good raps, good morrow, good luck\nTonight you could blow, tomorrow you suck\nBizarro, my carro, I borrowed from Chuck\nA new SLR and Ferrarro deluxe\nNo money for the meter when I'm parkin' em\nGassed than a bitch no car with him\nMarket him, tell him that he's buzzing like a game operation with Parkinsons\nYoung kid rappers, kidnappers\nYoung whipper snapper that will whip past ya\nWill get at you, come get at you\nWanna break ya off, Come Kit-Kat you\n\n[Chorus]\n\n[Verse 3: Sulaiman]\nNow the team work make the dream work\nGo ahead and send an application if you need work\nIf it need hurt, then I'm a bring hurt\nHow you finna see the clouds if you never seen dirt\nNow you finna play it loud, listen how it's goin down\nDidn't know the name before bet you niggas know it now\nChi-City niggy, made a 50 out a penny\nGot some titties at the cribby and the Savemoney with me and we going in\nGoing all out for them hoes again\nNow I'm fin to bring the fucking flow and bend it back\nAnd show it's more to this than rap\nLove my parents for supporting cause they know I'm finna crack\nKnow my niggas got my back, got some niggas selling packs\nBut I'm tryin' to get em cheese so I can get em out the trap\nNow my figures getting fat, a lot of hoes be tryin' to jack\nBut I got her on my lap, All she do is make it clap\n\n[Chorus x4]"}}, "Chance The Rapper f/ Akenya Seymour, Alex Wiley": {"10 Day (Mixtape)": {"Windows": "\n[Verse 1: Chance]\nThis is six blunt rotation music\nThis is just got off six month probation music\nThis is steppin' on the beach when you're too drunk to feel a beat\nThis that laughing in a condo, throwin' shit down in the street\nThis that shouts to the Ave\nShouts to the lab\nShouts to the clucks, shouts to the strags\nThis for every math class that I ever had\nSo fuck you if a I failed, and fuck you if I passed!\nFor shitty summaries and bummers in the past\nCause some of our teachers act as if summer was for class\nSome of us is seeing summer, some of us have passed\nSome of us ain't seeing summer, some of us have passed\nSo I'm just glad to say I'm sippin' rum up out a glass\nCause some of us is only sippin' some up off the grav\nAnd heaven's gates look a lot like prison from the Ave\nWe on the ground yelling, \"Get my nigga back!\"\n\n[Chorus]\nAnd I just want roll, with my windows down\nAnd I just want roll, with my windows down\n\n[Verse 2: Wiley]\nAnother weekend full of blunts and brews\nToo comfortable, yelling \"Fuck a school\"\nAin't seen the world before noon in like a month or two\nBlunts to the face, bottles to the dome\nNiggas never need no cup\nLivin' out dreams, never givin' hopes up\nRidin' with them Vill niggas, never givin' no fucks\nIn the game tryna get our feel, tryna get a deal\nTryna get a million\nJust ridin' around with my niggas and them\nReal [?] nigga mean real appeal\nWe go all out 'til we fall out\nNiggas get called out then hauled out\nWith the windows down we like to smoke\nDrink 'til we fall out, fuck is you tahm boy\nThe Village is my brothers\nIt's me, Mikey, Kembe trappin'\nHella love for Chance The Rapper\nWe know 10 Day is a classic, on God\n\n[Chorus]\n\n[Verse 3: Chance]\nThis is for sand in my shoes\nShout out to Oak Street\nFor the free train rides\nShout out to Polk Street\nTo the ice cream man you just on hella dirt\nHow you don't see us can't hear us\nYou Helen Keller\nBut I'm a save my dollars for Mary Jane\nAnd embellish her\nInhalin' her, Smellin' her, maybe sellin' her\nYou niggas got cold feet, shouts to Luke Elegar\nBut that's my nigga, my dude be droppin' hella verses\nShouts to D O C and new drive too\nMan we out this jam, see how new guys do\nBut I still save money like a coupon\nSo you can catch me off of the Ave gettin' my stoop on"}}, "Chance The Rapper f/ Lil Yachty, Young Thug": {"Coloring Book (Mixtape)": {"Mixtape": "\n[Intro: Young Thug and Lil Yachty]\nChance the motherfuckin' rapper\nWith a capitalized, uh, times, like the times\nLil Boat\nChance\nLil Boat\n\n[Chorus: Chance the Rapper and Young Thug]\nAm I the only nigga still care about mixtapes\nAm I the only nigga still care about mixtapes\nI'm the only nigga still care about mixtapes\nBad little bitch, wanna know how lips taste\nI swear I'm the only nigga still care about mixtapes\nBad little bitch, wanna know how the lips taste\n\n[Verse 1: Chance the Rapper]\nAll I can hear is the third, ayy\nAll I can hear is the third, ayy\nWe don't know none of your words, ayy\nWe don't know none of your words, ayy\nI love my women real tall, ayy\nType that can really play ball, ayy\nYou buy my hat at the park, ayy\nThink I might really play ball, ayy\nI got a link in my bio my bitch do the salsa like pico de gallo\nThey gotta ask if they may, Cinco de Mayo\nHow can they call themselves bosses\nWhen they got so many bosses\nYou gotta see what your boss say\nI get it straight out the faucet\nI ain't felt like this since the third drought, third carter drop\nTold my momma third grade I'd be in the third Barbershop\nAnd you know momma got real worried when she heard college drop\nBut now I call the shots\n\n[Chorus: Chance the Rapper and Young Thug]\nI'm the only nigga still care about mixtapes\nBad little bitch wanna know how lips taste\nI swear I'm the only nigga still cares about mixtapes\nBad little bitch wanna know how lips taste\n\n[Verse 2: Young Thug]\nBad little mama, she gettin' it Obama\nShe sting like a bumble bee, hot as the sauna\nShe shine like a Rolex, got that from her momma\nCan't see me, can't be me, I'm ridin' like a panda\nThat booty gon' roll and it's outta control\nAnd these bitches gon' fuck off respect and that loyalty\nAll my bitches lovin' me and they spoil me\nRub me down with that lotion, baby oil me\nDrinking Actavis, baby I'm showin' me\nIn that choppa I see your perimeter\nChange the culture, cause my niggas is silent\nWait a minute I told you\nYeah, I would like to know you\nYeah, you lucky like clovers\nYeah, the clothes no good\nMama I do it, your ass I pursue it\nJust look at me baby\nI came from the sewers\nThey love all the slime ball\nLike they fuck all these cats on your slime dog\nI got me some [?] like I'm [?]\nAnd I'm ballin' on you like I'm Chris Paul\n\n[Chorus: Chance the Rapper and Young Thug]\nI'm the only nigga still care about mixtapes\nBad little bitch wanna know how lips taste\nI swear I'm the only nigga still care about mixtapes\nBad little bitch wanna know how lips taste\n\n[Verse 3: Lil Yachty]\nAm I the only one who really care about cover art\nGrowing up I ain't have my brother cause he said the streets gave him a fresh start\nI ain't know what that mean\nI bumped heads with my dean\nDropped out and hit the scene\nNow I'm stunting like bling\nTime and time again they told me no\nThey told me I wouldn't go\nCause in high school all I cared about was hoes\nWell, maybe that shit was my interest\nNow I spend more than they make at my dentist\nAfter one night the folks thought I was finished\nI pin my name to the game like a seamstress\nOh, bitch I bite like a gator\nFuck them reviews that they put in the paper\nDid what I wanted, didn't care about a hater\nDelivered my tape to the world as it cater\nOh, they fuck with me cause I'm different\nNew sound, new appearance\nBitches both from the 6\nGive a fuck about a bitch\nWalk out, my hand on my dick, I'm the shit\n\n[Chorus: Chance the Rapper and Young Thug]\nI'm the only nigga still care about mixtapes\nBad little bitch wanna know how lips taste\nI said am I the only nigga still care about mixtapes\nBad little bitch wanna know how lips taste"}}, "Chance The Rapper f/ Childish Gambino": {"Acid Rap": {"Favorite Song": "\n[Chance The Rapper]\nChance, acid rapper, soccer, hacky sacker\nCocky khaki jacket jacker (IGH!)\nSlap-happy faggot slapper (BRUH BRUH~!) Iraqi rocket launcher\nShake that Laffy Taffy, Jolly Rancher/raunchy rapper\nBang, bang, bang - skeet, skeet, skeet; she do that thing for three retweets\nThe album feel like '92, now take that bong 'fore he three-peat\nChance, ho, acid head, cruisin' on that LSD\nAsked Joseph about my deal, he looked back said \"hell yeah, let's eat!\"\n\n[Chorus: Chance The Rqpper]\nThis shit my favorite song, you just don't know the words\nBut I still fuck with you, you just ain't never heard\nIt go like: count that stack, pop that cap then down that Jack\nAll my niggas hit that zan, and all my ladies bounce that back (AHHHH~!)\nThis my jam, this my jam, this my jam, this my jam\nI'm 'bout that jam, I'm 'bout that jam (IGH!) I'm 'bout that jam, I'm 'bout that jam (IGH!)\nThis my jam, this my jam, this my jam, this my jam\nI'm 'bout that jam, I'm 'bout that jam (IGH!) I'm 'bout that jam, I'm bout that jam (IGH!)\n\n[Chance The Rapper]\nYoung, Rascal Flatts - young ass kid ass could rap (IGH!)\nFuck all the faculty, tobacco-packing acrobat (IGH!)\nBack-to-back packin' bags back and forth with fifths of Jack\nFourths of weed, I'm back to pack on hands with young Cletus to pat my back\nReal nigga with a nose ring, that's right (IGH!) just here to rap them songs (IGH!)\nRag on my hair, wrap weed in Vegas, rockin' Vagabonds (IGH!)\nSang a song, oh you don't know? (what?) Well, I still bang with you\nHang with you, sip drank with you as long as I can sang with you like (IGH!)\n\n[Chorus]\n\n[Childish Gambino]\nYoung, ay\nNiggas please be focused - that 'Bino (uh), you know this (uh)\nHe rep the home of Sosas, you know I'm from that Zone 6\nYou know I rep that Stone shit, you know your 'hood is so clit\nAs God as my witness, this Will Smith spit real shit\nI'mma be that - CG busy gettin', where the weed at?\nBought your girl some new kneepads, you're fuckin' with the Fifi bag\nMy stars, egad, she said \"this my favorite song\"\n\"Hold my purse\" - now she on the floor, droppin' like it's hot\nYou blast this shit in Abercrombie when your work is finished\nYour mom won't play it in the car cause it's got cursin' in it\nYour boy like \"I'm the one who showed you,\" he want his percentage\nCause you were like \"this ain't the nigga you said spittin', is it?\"\nTwo-step - white dude's Harlem Shake\nWhy you laughin'? Cause you Harlem Shake\nI was never fake, I was just too good to be true\nThat's acid rap, we killed the track, you had your +Chance+, and 'Bino too - ooh\n\n[Chorus] w/ Gambino ad-libs"}}, "Chance The Rapper f/ Chicago Children's Choir, Kanye West": {"Coloring Book (Mixtape)": {"All We Got": "\n[Intro: Chance The Rapper]\nAnd we back\nAnd we back, and we back, and we back, and we back, and we\nAnd we back, and we back, na, na, na\n\n[Verse 1: Chance The Rapper]\nThis ain't no intro, this the entree\nHit that intro with Kanye and sound like AndrÃ©\nTryna turn my baby mama to my fiancÃ©e\nShe like music, she from Houston like Auntie YoncÃ©\nMan my daughter couldn't have a better mother\nIf she ever find another, he better love her\nMan I swear my life is perfect, I could merch it\nIf I die I'll prolly cry at my own service, igh, igh!\nIt was a dream, you could not mess with the Beam\nThis is like this many rings\nYou know what I mean?\nThis for the kids of the king of all kings\nThis is the holiest thing\nThis is the beat that played under the words\nThis is the sheep that ain't like what it heard\nThis is officially first\nThis is the third\n\n[Chorus: Kanye West]\nThis is all we got\nIsn't this all we got?\nSo we might as well give it all we got\nThis is all we got\nMusic all we got, got, got\nSo we might as well give it all we got\n\n[Verse 2: Chance The Rapper]\nI get my word from the sermon\nI do not talk to the serpent\nThat's the holistic discernment\nDaddy said I'm so determined\nTold me these goofies can't hurt me\nI just might make me some earl tea\nI was baptized like real early\nI might give satan a swirlie\nWish I could tell you it's ready\nTell you it's ready today\nThey don't give nothing away\nYou gotta fight for your way\nAnd that don't take nothing away\nCause at the end of the day\n\n[Chorus: Kanye West]\nMusic all we got\nMusic all we got\nIsn't this all we got?\nSo we might as well give it all we got\nMusic all we got\nMusic all we got\n\n[Outro: Kanye West &amp; Chicago Children's Choir]\nWe know, we know we got it\nWe know, we know we got it\nWe know, we know we got it\nWe know, we know we got it\nMusic\nWe know, we know we got it\nWe know, we know we got it\nWe know, we know we got it\nWe know, we know we got it\nMusic\nMusic is all we got"}}, "Chance The Rapper f/ Nico Segal": {"10 Day (Mixtape)": {"Long Time II": "\n[Verse 1]\nI wonder if Gladys smiles when angels bring my name up\nOr change language and subject change up\nHer boy's a long way from red dolls and green rangers\nThings ain't been the same since Ms. Patterson called me famous\nI saw your reflection in a toilet full of vomit water\nYou don't think I felt your hand on my head yelling, \"Call his father\"\nBut people don't hear ghost, so how they gon' play me?\nMoney saved me, so I'm a do the same thing\nYou droppin' pounds, gettin' small on some sick shit\nLike how you got the drive but don't know how to use a stick shift?\nYou better not miss this, overdose dope and mix this\nLet your throat close with a boatload of dope quotes within it\n\n[Chorus]\nLong time now since I seen you smile\nLong time long time now\nSince I seen you smile\nAnd it's been a long time, long time now\nSince I seen you smile\n\n[Verse 2]\nDropping tapes 'till I losted count\nCoughing out blood, dropping weight like I lost an ounce\nThrowing words and tossing nouns\nNY traveling, I'm Boston bound, bossing 'round homies\nAnd talking down to shorties while I'm jotting down\nNotes to spit to Harlem crowds, surfing through the Harlem crowds\nAt the crib I'm falling down, I'm on the floor crawling 'round\nI'm calling out to God, \"You're little angel's falling down\nSave me from my darkened cloud, reach your hands and arms around\"\nLong time long time now since I seen your smile\nWe miss you\n\n[Verse 3]\n#10Day\nIt's been a really, really long time, long time\nSince a goof ass nigga done tried me\nLabel niggas wanna sign me and lame ol' nigga wanna buy me\nFood and weed and drink and shit, just as long as you inkin shit\nSometimes I can't pay for food cause sometimes I can't think of shit\nWhere's your head at? Where's your head at?\nSinging my shit like you just said that\nWanging my shit like where'd you hear that?\nYoung ass nigga where you headed?\nLong time to get famous, life's whatever you make it\nJust thank God that we made it"}}, "Chance The Rapper f/ BJ The Chicago Kid, J.P. Floyd *, Kiara Lanier, Lili K., Will Miller *": {"Acid Rap": {"Good Ass Intro": "\n* Will Miller plays the trumpet\n* J.P. Floyd plays the trombone\n\n[Intro: BJ The Chicago Kid, Lili K., Peter Cottontale, Kiara Lanier] + (Chance)\nEven better than I was the last time baby\nOoh ooh ooh ooh (yo we back)\nI'm good, ooohh yeah, I'm good\nEven better than I was the last time baby (IGH!)\nOoh ooh ooh ooh - I'm good, so good\n(And we back and we back and we back and we back)\n(And we back and we back and we back and we back)\nEven better than I was the last time\n\n[Chance The Rapper]\nRap's just make me anxious, and acid made me crazy\nThem squares just made me looser and that wax just made me lazy\nAnd I still make this song, and I'mma make another\nIf you ever actually hit me, better watch out for my brother\nBetter bet I'd take that deal, gotta watch out for my mother\nGet a watch with all that glitters, come in clutters, different colors\nBen-a-Baller, Benford, butlers, chauffeurs, hit a stain-er, did I stutter?\nDid a ton of drugs and did better than all my Alma mater\nMotherfucker money dance, hundreds zan, gallon lean\nMake a joke 'bout Leno's hair then piggy back on Fallon's spleen\nBalancin' on sporadicity and fuckin' pure joy\nNightly searches for a bed and I just came off tour with Troy\nBut I can't complain I got some motherfuckin' bitches\nHow many lab partners have I fucked since I got suspended?\nMr. Bennett, you done did it, you did it, you did it\nYou did a good ass job, you did a good ass job\nAnd I'm good\n\n[Chorus: BJ The Chicago Kid, Lili K., Peter Cottontale, Kiara Lanier]\nBetter than I was the last time baby\nOoh ooh ooh ooh - I'm good, yeah, I'm good, so good\nBetter than I was the last time baby\nOoh ooh ooh ooh - I'm good, so good\n\n[Chance The Rapper]\nWork, work, work, work - bang nigga, bang\nTwerk, twerk, merge, swerve - dang, pick a lane\nFlip a bird; pigeon, plane, it's a word, it's a shame\nBut God I'm good, swear I couldnâ\u0080\u0099t be better, kickin' dirt on the shirts of the lames\nKeep a tab on my exes, keep some X on my tongue\nKeep my work out in Texas, that's just me flexin' my lungs\nSee them showin' they teeth, that's just them flappin' they gums\nIf they bite and I'm snappin', clap clap collapsin' they lungs\nCall me Chancellor The Rapper, please say \"The Rapper\"\nMagical word (POOF) please say 'Kadabra\nReplay the replays; Green Bay, the Packers\nCremate your teammates and freebase the ashes\nMatches to gas leaks, dusted dusk 'til dawn\nIt's just us, and trust ya bottom bitch, my stuff the fuckin' bomb\nI'm the motherfuckin' fucker, fuck a niggas fuckin' dumb\nThis your favorite fuckin' album and ain't even fuckin' done\nI'm good! IGH!\n\n[Chorus] w/ ad-libs\n\n[Chance The Rapper] + (Lili K. + Kaira Lanier)\nEven better that I was, even better than I was\nEven better that I was, even better than I was\n(I'm gonna be, I'm gonna be)\nEven better that I was, even better than I was\nEven better that I was, even better than I was\n(I'm gonna be, I'm gonna be)\nSo, so, so, so, so, so, so so so so so so so so so\n(I'm gonna be, I'm gonna be)\nSo, so, so, so, so, so, so so so so so so...\nYou did a good ass job, you did a good ass job and I'm good\nNa-na-na-na-na-na-naa\nNa-na-na-na-na-na-na, na-na-na-na-na-na-na\nNa-na-na-na-na-na-na, na-na-na-na-na-na-na\nNa-na-na-na-na-na-na - IGH, IGH, IGH, IGH, IGH!!\nIGH~!"}}, "Chance The Rapper f/ BJ the Chicago Kid, Saba": {"Acid Rap": {"Everybody's Something": "\n[Intro: sample of Slum Village's \"Fall In Love\"] + (Chance)\n\"Ladies lovin' my music is like some sex shit\n\"Niggas tryin' to grip up my mic like it's a dick\" (on the mic like it's a dick)\n\"Run around the corner to pick up the new shit\" (the, the shit)\n\"Toss this in the deck so niggas can catch rep\" (Brook!)\n\"Ladies lovin' my music is like some sex shit\" (gyeah)\n\"Niggas tryin' to grip up my mic like it's a dick\" (na-na-na-na)\n\"Run around the corner to pick up the new shit\" (na-na-na-na-na-na-na-na-na)\n\"Toss this in the deck so niggas can catch rep\" (na-na-na-na-na-na-oohhhh - IGH!)\n\n[Chance The Rapper]\nWhat's good, good? And what's good, evil?\nAnd what's good, gangstas? And what's good, people?\nAnd why God's phone die every time that I call on Him?\nIf his son had a Twitter wonder if I would follow him\nSwallow them synonyms like cinnamon Cinnabon\nKeep all them sentiments down to a minimum\nStudious Gluteus Maxim models is sendin' him\nPics of they genitalia tallied up ten of 'em\nI slurped too many pain-kills, down I'm off a lot\nI got a lot off days but it ain't often that I'm off the clock\nYa kna wha mean? I got the Chicago Blues\nWe invented rock before the Stones got through\nWe just aimin' back cause the cops shot you\nBUCK BUCK BANG BANG - yellin' \"FUCK Fox News!\"\nBooyaka buckle up, mothaFUCK opps too\nAin't no knucklin' up 'em young cause it just not cool\n\n[Interlude: Chance The Rapper]\nNice to see you Father New Year, middle finger Uncle Samuel\nShootin' death with weighted dice and hittin' stains on birthday candles\nI know somebody, somebody loves my ass\nCause they help me beat my demons ass\n\n[Chorus: Chance The Rapper + BJ the Chicago Kid]\nEverybody's somebody's everything (I know you right)\nNobody's nothing (that's right)\nEverybody's somebody's everything (I know you right)\nNobody's nothing (that's right)\nEverybody's somebody's everything (that's right)\nNobody's nothing (I know you right)\n\n[Chance The Rapper]\nRight? (IGH!) I used to tell hoes I was dark light or off white\nBut I'd fight if a nigga said that I talk white\nAnd both my parents was black but they saw it fit that I talk right\nWith my drawers hid but my hard head stayed in the clouds like a lost kite\nBut gravity had me up in a submission hold\nLike I'm dancin' with the Devil with two left feet and I'm pigeon toed\nin two small point ballet shoes with a missin' sole\nand two missin' toes but it's love like Cupid kissin' a mistletoe\n\n[Interlude]\n\n[Saba]\nLike Cassius duckin' the draft and now the fight is over\nThe type to love from a distance not the type that told her\nSpent three days on the rap, trash it and type it over\nWith babies on the block under arms like fightin' odors; coppers and quotas\n+Hold Ya Head+ like 2Pac had taught, obviously they are on a come up\nwith better chances tobogganin' in the fuckin' summer\nConcoctions for the bad days and a condom for the good ones\nAll odds against we tryna get lucky; doper than Lucky\nYou're ending happy that's only a tuggin'\nLike Satan masturbatin' shit come hot but y'all still love me, ah\nHow father time a deadbeat, maybe I'm adopted\nThat'll explain why all of my shit been so timeless - IGH~!\n\n[Chorus: Chance The Rapper + BJ the Chicago Kid]\nEverybody's somebody's everything - NIGGA~!\nNobody's nothing - NIGGA~!\nEverybody's somebody's everything - NIGGA~!\nNobody's nothing (Wu-Tang)\nEverybody's somebody's everything (thats right)\nNobody's nothing (I know you right)\nNobody.."}}, "(Chance The Rapper f/) D.R.A.M.": {"Coloring Book (Mixtape)": {"D.R.A.M. Sings Special": "\n[Verse: D.R.A.M.]\nYou are very special\nYou're special too\nEveryone is special\nThis I know is true\nWhen I look at you\nYou are very special\nYou're special too\nEveryone is special\nThis I know is true\nWhen I look at you"}}, "Chance The Rapper f/ Justin Bieber, Towkio": {"Coloring Book (Mixtape)": {"Juke Jam": "\n[Verse 1: Chance The Rapper]\nWe used to roll at the rink, we used to roll at the rink\nI used to talk way too much, you used to know everything\nYou couldn't stand me, I couldn't stand you\nYou said I'm steady playin', but you steady playin' too\nYour big brother foot work\nYour play sister Juke\nThe rink was the place but in that space and time I was too young for you\nAs you were for me, to worry about Frooties and Chews\nTill I found out all the shawdy's with cooties was cute\nAnd realized what booties can do\n\n[Chorus: Towkio]\nWe gon' get it poppin'\nWe gon' get it Jukin'\nWe gon' throw a party\nWe ain't gotta do shit\nYou came with your best friend\nCame up with for the weekend\nRolling with your parties\nSo tell me what you thinkin'\nSo we gon' have a juke jam\nSo we gon' have a juke jam\nWe can have a party, just listening to music\nLike we used to do\nI'll get close to you\nI remember you\nYou used to \"I remember you\"\n\n[Bridge: Justin Bieber]\nWe've got so much history baby, maybe\nMaybe you and I were meant to be\nMaybe I'm crazy\n\n[Verse 2: Chance The Rapper]\nWe never rolled at the rink\nWe would just go to the rink\nYou ain't buy tokens no more\nYou just hit roll at the rink\nYou had a nigga, I couldn't stand him\nBut when they play \"Take You Down\", Chris Brown\nI am him standing\nI mean it's just dancing\nIt's harmless as fuck\nThen I put my waist through your hips\nAnd your legs and your arms just to harness you up\nThen we hit the floor\nAll the kitties start skating\nTo see grown folks do, what grown folks do\nWhen they grown and they dating\n\n[Bridge: Justin Bieber]\nWe've got so much history baby, maybe\nMaybe you and I were meant to be\nMaybe I'm crazy\nCrazy about you\n\n[Chorus: Towkio]\nWe gon' get it poppin'\nWe gon' get it Jukin'\nWe gon' throw a party\nWe ain't gotta do shit\nYou came with your best friend\nWho came up with for the weekend\nRollin with the parties\nSo tell me what you thinkin'\nSo we gon' have a juke jam\nSo we gon' have a juke jam\nWe can have a party, just listening to music\nLike we used to do\nI'll get close to you\nI remember you\nYou used to \"I remember you\"\n\n[Outro: Justin Bieber]\nWe've got so much history baby (juke)\nMaybe (juke)"}}, "Chance The Rapper f/ 2 Chainz, HaHa Davis, Lil Wayne": {"Coloring Book (Mixtape)": {"No Problem": "\n[Intro: HaHa Davis]\nYou don't want zero problems, big fella!\nYep!\n\n[Refrain: Chance The Rapper]\nIf one more label try to stop me\nIt's gon' be some dreadhead niggas in ya lobby\n\n[Chorus: Chance The Rapper]\nYou don't want no problems, want no problems with me, bih!\nYou don't want no problems, want no problems with me\nJust another day, had to pick up all the mail\nThere go Chano ridin' through the streets, they be like, \"There he go!\"\nYou don't want no problems, want no problems with me, bih!\nYou don't want no problems, want no problems with me\nJust another day, had to pick up all the mail\nThere go Chano ridin' through the streets, they be like, \"There he go!\"\n\n[Verse 1: Chance The Rapper]\nOoh, I be comin', put the hinges in their hands\nCountin' Benjis while we meetin', make 'em shake my other hand\nMilly rockin', scoopin' all the blessings on my lap\nI know you tried to cheat, you shoulda never took a nap\nFuck wrong with you? What you was thinkin'?\nFuck you thought it was?\nYou talk that talk, that nigga lame, that nigga fall in love\nNot me, though, you can keep those\nBoy I'm at your head like Craig did Deebo\nDon't tweak, bro, it's never sweet, ho\nMy shooters come for free, so\n\n[Refrain: Chance The Rapper]\nIf one more label try to stop me\nIt's gon' be some dreadhead niggas in ya lobby\n\n[Chorus: Chance The Rapper]\nYou don't want no problems, want no problems with me\nYou don't want no problems, want no problems with me\nYep, yep!\nPull up, they be like, \"There he go!\"\nYou don't want no problems, want no problems with me\nYou don't want no problems, want no problems with me\nYou don't want no problems, want no problems with me\nYou don't want no problems, want no problems with me\nThey be like, \"There he go!\"\n\n[Verse 2: 2 Chainz]\nPetey Pablo, take your shirt off\nWave 'round your head like a helicopter\nI ain't put enough weed in the blunt\nAll you do is smoke tobacco\nWhere the hell you get them from?\nYeezus said he ain't make them\nMy niggas chasin' bounty hunters\nAnd gettin' chased by their baby mommas\nMy first tat was on my stomach\nGot a pocket full of money\nAnd a mind full of ideas\nSome of this shit may sound weird\nInside of the Maybach\nLook like it came out of Ikea\nRun shit like diarrhea\nBig yacht, no pies there\nAye, aye, captain\nI'm high, captain\nI'm so high\nMe and God dappin'\nThis is my blessin'\nThis is my passion\nSchool of hard knocks\nI took night classes\n\n[Chorus: Chance The Rapper]\nYou don't want no problems, want no problems with me\nYou don't want no problems, want no problems with me\nPull up, they be like, \"There he go!\"\n\n[Verse 3: Lil Wayne]\nI got problems bigger than these boys\nMy deposits, they be on steroids\nLord, free the Carter, nigga me the Carter\nSacrificin' everything, I feel like Jesus Carter\nHold up, I got this sewed up, my soda poured up\nMy woes up, I'm flippin' those bucks, they've been with toe tucks\nI rolled up and let the smoke puff\nI lay down, told yah\nHold up, get too choked up and I think of old stuff\nMove on, put my goons on, they kidnap newborns\nIn the streets my face a coupon\nHer pussy too warm\nAll these niggas come to do harm\nJust bought a new charm\nThe watch, I buy a new arm, you lukewarm\nI'm Uncle Luke with the hoes\nPretty bitches, centerfolds\nTippy toes around my crib in their robes, just their robes\nHalf a milli' in the safe, another in the pillowcase\nCodeine got me movin' slower than a caterpillar race\nFuck is wrong with you? What you thinkin'?\nFuck you thought it was?\nI need Popeye percocets and on the Carter buzz\nAnd if that label try to stop me\nThere gon' be some crazy Weezy fans waitin' in the lobby\nMula, baby\n\n[Chorus: Chance The Rapper]\nYou don't want no problems, want no problems with me\nYou don't want no problems, want no problems with me\nJust another day, had to pick up all the mail\nThere go Chano ridin' through the streets, they be like, \"There he go!\"\nYou don't want no problems, want no problems with me, bih!\nYou don't want no problems, want no problems with me\nJust another day, had to pick up all the mail\nThere go Chano ridin' through the streets, they be like, \"There he go!\"\n\n[Outro: Lil Wayne + Chance The Rapper]\nYou don't want no problems, want no problems with me\nYou don't want no problems, want no problems with me\nYou don't want no problems, want no problems with me\nYou don't want no problems, want no problems with me\nYou don't want no problems, want no problems with me\nYou don't want no problems, want no problems with me\nSay so, got problems, say so\nThey be like, \"There he go!\""}}, "Chance The Rapper f/ Francis &amp; The Lights, Jeremih": {"Coloring Book (Mixtape)": {"Summer Friends": "\n[Intro]\nOh, oh, oh, incredible\nI would... incredible\nEverything...\n\n[Verse 1: Chance The Rapper]\nSocks on concrete, jolly rancher kids\nI was talking back and now I gotta stay at grandma's crib\nBunch of tank top, nappy headed bike-stealing Chatham boys\nNone of my nigga's ain't had no dad\nNone of my nigga's ain't have no choice\nJJ, Mikey, Lil Derek and them\n79th street was America then\nIce cream truck and the beauty supply\nBlockbuster movies and Harold's again\nWe still catching lightening bugs\nWhen the plague hit the backyard\nHad to come in at dark cause the big shawty's act hard\nOkay now Dave grandpa grand crossing\nFirst day, nigga's shooting\nSummer school get to losing students\nBut the CPD getting new recruitment\nOur summer don't, our summer, our summer don't get no shine no more\nOur summer die, our summer time don't got no time no more\n\n[Chorus: Chance The Rapper] &amp; (Francis &amp; The Lights)\n(You're my friend)\nSummer friends don't stay\nSummer friends don't stay around\nSummer friends, summer friends\nSummer friends don't stay\nSummer friends don't stay, hey\nStay around\n\n[Verse 2: Chance The Rapper]\nOh I used to kill 'em with the long hair\nMomma had salon doing perms out the armchair\nYeah we're working late, he treat the crib like it's a timeshare\nI would mow some lawns for my ones like a lawn chair, hugh, hugh!\nNow I'm the same way, over time all the time, every night, hey\nReady my blessing, now I'm ready how I wait\nNever let a friendship get in my way\nNever let a blog get in my way\nMake the whole song do whatever I say\n79, 79, 79, 79 place\n79, 79, 79, 79 place\nSome of my homegirls got lost in the paperwork\nThey was good friends but I faked the clerk\nCause if it ain't work, can't make it work\nIt's been a minute since I called on a friend\nFucked up and fucked all my friends\nAll my friends, all my...\n\n[Chorus: Chance The Rapper] &amp; (Francis &amp; The Lights)\nStick around\nSummer friends, summer...\n(You're my friend...)\nSummer friends don't stick around\nStick around\n(And some of us...)\n79, 79, 79, 79, hey\n79, 79, 79, 79, hey, hey, hey\n(You're my friend)\n79, 79, 79, 79, hey, 79\n(So put your head on my shoulder)\nCity wide, city wide, city wide, hey\nCity wide, city wide, city wide, hey\nCity wide, city wide, city wide, hey\nCity wide, city wide, city wide, hey\nCity wide, city wide, city wide\nCity wide, city wide, city wide\nCity wide, city wide, city wide\nCity wide, city wide, city wide\nCity wide, city wide, city wide\nCity wide, city wide, city wide...\n(I will wait around for you)\n(I will wait around for you)\n(So lay your head...)\n\n[Interlude]\nMay the Lord give your journey mercy\nMay you be successful, grant you favor\nAnd bring you back safely, I love you\n\n[Outro: Jeremih]\nWhen I was so young before I could remember\nI would always treat my gang like family members\nEven when the changing nigga never changed up\nI always bring my friends, my friends up\nWhen I was so young before I could remember\nI would always treat my gang like family members\nEven when the changing nigga never changed up\nI always bring my friends, my friends up"}}, "Chance The Rapper f/ Byron Cage, Jamila Woods": {"Coloring Book (Mixtape)": {"Blessings": "\n[Chorus: Jamila Woods &amp; Chance The Rapper]\nI'm gon' praise him, praise him till I'm gone\nI'm gon' praise him, praise him till I'm gone\nWhen the praises go up, the blessings come down\nWhen the praises go up, the blessings come down\nIt seems like blessings keep falling in my lap\nIt seems like blessings keep falling in my lap\n\n[Verse 1: Chance The Rapper]\nI don't make songs for free I make 'em for freedom\nDon't believe in kings, believe in the kingdom\nChisel me into stone, prayer whistle me into song air\nDying laughing with Krillin saying something 'bout blonde hair\nJesus black life ain't matter, I know I talked to his daddy\nSaid you the man of the house now, look out for your family\nHe has ordered my steps, gave me a sword with a crest\nAnd gave Donnie a trumpet in case I get shortness of breath\n\n[Chorus: Jamila Woods &amp; Chance The Rapper]\nI'm gon' praise him, praise him till I'm gone\nDon't be mad\nI'm gon' praise him, praise him till I'm gone\nWhen the praises go up\nGood God\nThe blessings come down\nThe blessings come down\nWhen the praises go up, the blessings come down\nWhen the praises go up, the blessings come down\nThe blessings come down\nWhen the praises go up, the blessings come down\nIt seems like blessings keep falling in my lap\nIt seems like...\nWhen the praises go up, the blessings come down\nWhen the praises go up, the blessings come down\nGood God\n\n[Verse 2: Chance The Rapper]\nThey booked the nicest hotels on the 59th floor\nWith the big wide windows, with the suicide doors\nAin't no blood on my money, ain't no Twitter in heaven\nI know them drugs isn't close, ain't no visit in heaven\nI know the difference between blessings and worldly possessions\nLike my ex girl getting pregnant and her becoming my everything\nWar with my wrongs, I'm writing four different songs\nI never forced you to forfeit it, I'm a force to be reconciled\nThey want four minute songs\nYou need a four hour praise dance performed every morn\nI'm feeling shortness of breath, so Nico grab you a horn\nHit Jericho with a buzzer beater to end a quarter\nWatch brick and mortar fall like dripping water, ugh!\n\n[Bridge: Byron Cage]\nThere are obstacles in life\nMany many trials and tribulations that come up\nBut you got to realize and know\nThat even Jericho walls must fall\nEvery wall must fall\n\n[Chorus: Jamila Woods &amp; Byron Cage]\nI'm gon' praise him, praise him till I'm gone\nI'm gon' praise him, praise him till I'm gone\nWhen the praises go up, the blessings come down\n(Are you ready for your blessings?)\nWhen the praises go up, the blessings come down\n(Are you ready for your blessings?)\nWhen the praises go up, the blessings come down\n(Are you ready for your blessings?)\nWhen the praises go up, the blessings come down\n(Are you ready for your miracle?)\n(Are you ready for your blessings?)\n(Are you ready for your blessings?)\n(Are you ready for your miracle?)\n\n[Outro: Chance The Rapper]\nBlessings keep falling in my lap"}}, "Chance The Rapper f/ Noname Gypsy ": {"Israel (Sparring) {S}": {"Israel (Sparring)": "\n[Chance The Rapper]\nSparrin' is trainin', chain snatchin' the slaves\nBut a rap song is a match in a cave\nDim lit, wet wick, wicked rappin' its way\nDrunk off of light, lies, laughin' claimin' asylum while shinin' in shade\nI can't stay silent, I go violent when my violets is gray\nAnd my roses is black\nFuck the pharaohs and pharisees, Moses is back\nI don't need to see a sphinx to know they noses was black\nI don't know one Temptation that had Otis' back, sparrin' is trainin', this a jumpin' jack\nI'm the scariest +jack+ in the pumpkin patch\nFloat like my jumper wet, sting like a bumblebee\nI swing like a lumberjack, go back when I'm up at bat\nThey tried to label me a non-rapper\nI'm an independent contractor, card cracker\nSparrin' is trainin' without the trainin' wheels\nYou made it, you made it, you made it, yeah you made a deal\nYou played it straight, hated, graduated, waited, waited, you still a waiter still\nMice will always find out ways to steal\nPicture me, fifth of Hennessy and the Swisher Sweet\nFake identity 'til a plug named Trinity shook me\n\"Wake up, wake up!\" like remember me?\nSaid one plus one make three and you finna see\nYou ain't as grown as you finna be\nYou got them young nigga tendencies\n\n[Noname Gypsy]\nHmm, sentimental energy\nI let the lightin' beside him, I stand like angel\nSparrin' is trainin' for an apathetic halo\nApologetic, non religious, consequential fable\nLike good is good, the love in me is goodly, or godly\nThe Bible say mistakes is necessary\nSo I Mississippi monologue to granny house\nMy soloist is sold out to attentive God\nCornbread on my table when I say my prayers\nOn airs to stairs where shadiness is time to rest or manifest\nSparrin' is trainin', I know they think me bumblebee\nAfro-Americano, Sunny D\nBut bet I sting, no die\n\n[both] Sparrin' is trainin'\n\n[Chance The Rapper]\nJacob wrestled with God\nin the desert 'til He broke him and He blessed him and He rescued his heart\nI struggle with love, I juggle my loves\nI cuddle and coddle, ship wreckin' bottle, I huddle in hugs\nSparrin' is trainin' bra/bruh, Ramses watchin' rainin' frogs\nJigga watchin' Damon, +Damon+ watchin' \"Wayans Bros\"\nA tandem unicycle with two pilots in different maps\n\n[Noname] You givin' back?\n[Chance] I'm givin' back\n\n[Noname Gypsy]\nTit for tat\nSynagogue and bottle caps, a body in the underpass says \"Where's my Jesus?\"\nPledge allegiance to the money now\nWe runnin down to kiddie parks where darker kids be casualty\nLike come with me, to the museum\n\n[both] Excuse them, they know of what they do\n\n[Chance The Rapper]\nSparrin' is trainin', don't let Denzel +Training Day+ you\nSensei could catch a fade too\nWe be on that elegant, hella melanin\nBarely, barely since the crayons and jellybeans\n\n[Outro: Chance The Rapper] + (Noname Gypsy)\nAnd now you know Noname ain't never for none\n(Aiyyo, you know Chano ain't never for none)\nAnd now you know Noname ain't never for none\n(Aiyyo, you know Chano ain't never for none)\nHaha~! And you don't stop (hehehahah)\nBoom, boom bap and you don't stop (ay, ay! Hahahah)\nI told you that was gonna be fun though\n(Now that man, I was just)"}}}