{"Donnie Trumpet &amp; The Social Experiment f/ Raury": {"Surf": {"Miracle": "\n[Intro: The Social Experiment] + (Raury)\nOoooohhhh, ooooohhhh, oooohhh..\n(If it's a miracle, to be alive and well)\n(If we fell, we feel we'd be okay...)\nOoooohhhh, ooooohhhh\n(If it's a miracle.. to be alive and well)\n(If we fell, we feel we'd be okay, okay, okay, okay, okay...)\n\n[Chance The Rapper]\nSit with the beat; the chair isn't fair\nwith you sittin' right there with your hair in a knot\nNot a care in the world or a pot for the piss\nwhich we share cause a pair costs a lot\nNot a pear in the world that the world wouldn't miss much as this\nAnd if it isn't the same then it's apples and lemonade\ncan't stand for a Minute Maid man with an iPod\nIf I got locked up, would you see me at the end of my sentence? White dot\nBuy pot with what I got, which I got from, ahh, fuck!\nStill ain't did shit with the beat, the stair isn't there\nwhen your feet needed therapy and their approval\nA shoulder to lean on from when it gets shiverin' cold with the heat on\nIn a trance with the beat gone, realizin' that you should never speak on things done\nPeople keep it a secret and keep goin', ain't no reason to keep on thinkin'\nThere's somethin' deeper, there's China up under my garden\ntryna break bread, stop beggin' my pardon\nMy lead is astray, let's get an apartment\nwith a dog and a song that I wrote you this mornin'\nUH~!\n\n[Raury] + (Chance The Rapper)\nIf it's a miracle, to be alive and well\nIt's a miracle (it's a miracle, it's a miracle)\nIf it's a miracle, to be alive and well (it's a miracle, uh-oh)\nSnow is meltin', water's pourin'\nSignal's turnin', it's a miracle (it's a miracle)\nHomies breathin', families eatin'\nMama singin', it's a miracle (it's a miracle)\nSnow is meltin', water's pourin'\nSignal's turnin', it's a miracle - if it's a miracle\nMama singin', it's a miracle\nSnow is meltin', the water's pourin'\nThe signal's turnin , it's a miracle\nThe homies breathin', the families eatin'\nMama singin', it's a miracle\nSnow is meltin', water's pourin'\nSignal's turnin', it's a miracle\nThe homies breathin', the families eatin'\nMama singin', it's a miracle\n\n{*The Social Experiment ad-libs to the end of the song*}"}}, "Donnie Trumpet &amp; The Social Experiment": {"Surf": {"Familiar": "\n[Chorus: Chance The Rapper]\nCardboard, cutout; sharp teeth, smart mouth\nSmile big, small waist; big hips, cut paste\nForgive me but you look familiar...\nProm queen, mean chick; teen mom, bad bitch\nReal bad, advice; can't fool, me twice\n(Forgive me but you look familiar...)\n{You're regular!}\n\n[Chance The Rapper]\nShe the latest model but these hoes retros\nOne in a million but these bitches special\nIt's two shoes in a pair, two peas in a pod\nThree P's in appropriate, groupies in a mob\nUsually I like them to look just like you\nBut you just so usual, you just look used\nI just need somethin' out of the norm\nForeign just don't seem foreign no more\nJust give me the porn, it's like four in the morn'\nTryin' to raise the bar with porn in the torrent\nGot a lot of wifeys, more than a Mormon\nCNC's, I ain't even in performin\nBut we met in a life where we were both cats\nOur owners were neighbors, how funny is that?\nWhat's funnier is your's had eight different cats\nSame shade of black and I'm blind as a bat\n\n[Chorus: Chance The Rapper]\nCardboard, cutout; sharp teeth, smart mouth\nSmile big, small waist; big hips, cut paste\nForgive me but you look familiar...\n(You're regular!)\n\n[King Louie]\nThese bitches regular and they smoke regular\nIf these bitches bad then bad bitches regular (what?)\nCounty bound ass bitches actin' like the federals\nIf this bitch from Paris then Paris is terrible (woo)\nI don't want to go there no more (woo)\nEven though I've been there before (huh)\nAnd even then they was regular (basic!)\nAye 'Ye, where Kim at? (what?)\nKris Jenner, that's a kidnap (whattup?)\nStacey Dash, where you been at? (huh)\nCause these bitches +Clueless+ here (woo)\nMama say you're special then your mama ain't the truest\n... With her lyin' ass (feel good)\n... With her fine ass\n... With that giant ass\n... She regular too, hah\n\n[Chorus: Chance The Rapper]\nCardboard, cutout; sharp teeth, smart mouth\nSmile big, small waist; big hips, cut paste\nProm queen, mean chick; teen mom, bad bitch\nReal bad, advice; can't fool, me twice\nForgive me but you look familiar...\n\n[Quavo]\nYo, yo, oohh\nOhh! Migo! Quavo!\n\nLong hair, don't care (don't)\nGirl you look familiar (woo!)\nAnd her mama doesn't like me (mama!)\ncause I'm a rapper, so icy (icy!)\nWhere she come from? Damn I don't know (no!)\nBut I think I seen her in Chance and Migos' video (video)\nHer body look like a Coke bottle (bottle)\nBut I'ma let her do the swallow (blaaa!)\nHeard she chasin' after my dollar (woo!)\nHit the bucket from the back, make her holla (smash)\nIf she get your number, know that she gon' call ya (blrrrt!)\nShe don't fuck with nothin' but ballers (ball)\nI got to stop her (stop!)\nCall me Quavo Captain America (ohh!)\nI'm not savin' her, no I'm not cuffin' her (no!)\nNah! (gone!)\n\n[Chance The Rapper]\nForgive me but you look familiar\nForgive me but you look familiar", "Slip Slide": "\n[Intro: Busta Rhymes]\nHahahahah, aiyyo Mr. Chance The Rapper\nI greatly appreciate the way you rolled out the red carpet\nAllowin' me to articulate myself\nand now I stand on my own two below me~!\nYEAH~!!\n\n[Chorus 2X: The Social Experiment]\nI don't wanna slip, slip, slip, SLIDE!\nI'ma stand up on my own two, stand up on my own two\n\n[Busta Rhymes]\nCheck it, yo\nI'm a man understandin' the plan and I'm on\nto be greater than anything, make you a fan in this song\nHow I stand out and wonderin' what planet I'm gone\nThe one and only God of kings come from (huh)\nA hundred grand on, a child I always ran from the wrong\nStandin' on his own two but wanna stand with the strong (hah)\nPlease get to turnin' on the fan cause it's warm\nwhile I build just a little 'bout the man I was born to be\nThis whole planet belongs to me (yeah)\nWe all feel the same so it belongs to we (yeah)\nWe talkin' all night but this is my birth right\nPlease can you get to bringin' the crown to me? (hahahah)\nYeah, I know you all for it\nYou'll only be deemed worthy if you stand tall for it\nWhen you and your men were sittin', yeah I know you all saw it!\nThis great ship we got goin' on - don't slip\n\n[Chorus] - 2X w/ BJ The Chicago Kid &amp; Janelle Monae ad-libs\n\n[B.o.B]\nYeah... yeah\nI was born on my own two feet watchin' Bruce Lee\n'Fore I grew teeth, I had a pen and some loose leaf\nPots and pans when the roof leaked\n'Fore I ever smoked mids, 'fore I ever blew trees\nUsed to drive a hooptie that broke down on me usually\nNas was lookin' at me, pockets was lookin' through me\nNever planned on college, I dropped out as a student\nMy GPA started with a +Decimal+ like Dewy\nThat's lower than low, that's lower than most\nBut if you thought I wouldn't make it, you slower than slow\nI make the type of music that stoners should know\nIf I plant one of my thoughts, marijuana would grow\nAnd I'd be high enough to go where I wanted to go (reefer)\nMight be covered in glitter but all of it's gold\nA nigga got that loud and it's all for the low (smoke)\nAnd everybody sayin' \"Aww, let's go\"\n\n[Chorus] w/ BJ The Chicago Kid &amp; Janelle Monae ad-libs\n\n[Chance The Rapper]\nIt ain't so easy... (\"yeaaaaah!\")\nIt ain't so hard...\nIt ain't so, it ain't so\nIt ain't so, easy\n\nIt ain't so easy, it's not too hard (\"yeeeeah!\")\nIt ain't so easy, but it's not so hard (\"yeeeeeah!\")\nTo stand up, stand up\nBut it's just too easy, to sit back down\n(\"Yeaaaaah!\")", "Sunday Candy": "\n[Chance The Rapper]\nShe could say in her voice, in her way that she love me...\nWith her eyes, with her smile, with her belt, with her hands, with her money\nI am the thesis of her prayers\nHer nieces and her nephews are just pieces of the layers\nOnly ones she love as much as me is Jesus Christ and Taylor\nI got a future so I'm singin' for my grandma\nYou singin' too but your grandma ain't my grandma\nMine's is hand made, pan fried, sun dried\nSouthside, and beat the devil by a landslide\nPrayin' with her hands tied, president of my fan club, sayin' to her\nSomethin' told me I should bring my butt to church\n\n[Chorus 2X: Jamila Woods]\nYou gotta move it slowly\nTake and eat my body like it's holy\nI've been waitin' for you for the whole week\nI've been prayin' for you, you're my Sunday, candy\n\n[Interlude: Jamila Woods + The Social Experiment]\nCome on in this house, cause it's gonna rain\nRain down Zion, it's gonna rain\nYou better come on in this house, cause it's gonna rain\nRain down Zion, it's gonna rain\n\n[Chance The Rapper]\nI come to church for the candy, your peppermints is the truth\nI'm pessimistic on Monday if I had tweaked and missed you\nYou look so good with that hat on, had to match with the shoes\nCame and dressed in the satin, I came and sat in your pew\nI come to Christmas for dinner, fifty rolls on my plate\nHella holes in my stocking, holdin' your pockets in place\nI like my love with a budget, I like my hugs with a scent\nYou smell like light, gas, water, electricity, rent\nYou sound like \"Why the gospel choir got so tired?\"\nSingin' his praises daily basis so I gotta try it\nYou're my dreamcatcher, dream team, team captain\nMatter fact, I ain't seen you in a minute, let me take my butt to church\n\n[Interlude] - w/ ad-libs\n\n[Chorus] - 1.5X\n\n[Interlude] - w/ ad-libs", "Go": "\n[Chorus: Eryn Allen Kane, Jesse Boykins III, Lili K.]\nPlease don't go, don't go, don't go, don't go\nPlease don't go, don't go, don't go, don't go\nPlease don't go, don't go, don't go, don't go\nPlease don't go, don't go, don't go, don't go\nAh-hooo...\nAh-hooo...\n\n[Mike Golden]\nUh, I never meant to leave (don't go, don't go) but girl I gotta go\nSelfish it may be, but know my heart ain't cold (nah)\nI got some things to see, but tonight get on the floor\nBetter yet, jump on the board, surf's up, this wave gon' take us all\nFrom city, to city, from the GO, to Cali\nTo Paris, in my dreams, once I'm lifted you would know\nYou needed to go let me see, go let me eat, be MG\nI'ma come back just to show you the air that you never will breathe without me\nI'ma\n\n[Chorus] w/ Mike Golden singing along\n\n[The Social Experiment - over Chorus]\nYou should never go away {*4X*}\n\n[Joey Purp]\nUh, you remind me of one of these girls\nor should I say one of these hoes\nYou could be a playmate girl, centerfold\nIn the mirror workin' on your magazine cover pose\nAll you really want is credit cards, billboards\nMagazines, movie screens, money rolls\nYou really are the shit that you see, huh?\nYou know you only see what they show you\nI could show you somethin' different, baby girl\nSometimes the bullshit glisten, baby girl\nStandin' in the club with your eyebrows furrowed\nSecond hand watch on so you know your time's borrowed\nI don't really mean to look at you the wrong way\nBut did the couple free shots get you home, bae?\nWhen you woke up, were you still in the wrong place?\nGuess the little money that he spent on drinks done went a long way\nNow gon' get your panties out the hallway\nTwelve missed calls what your phone say\nOn the ride home, you still take the long way\nHad to +Blame It All on the Alcohol+ like the song say\nDamn, guess you should have listened to the man\nNow you done gon' and went missin' on the man\nSharks in the water still fishin' for the man\nSurf's up, smoke somethin', Young Purple, I'm the man, uh\n\n[The Social Experiment]\nSurf's up, surf's up\n... Surf's up\n... Surf's up\nSurf's up...\n\n[Chorus] w/ Mike Golden singing along\n\n[The Social Experiment]\nSurf's up, surf's up\nSurf's up, surf's up\nSurf's up, surf's up\nSurf's up...", "Wanna Be Cool": "\n[Intro: Chance The Rapper]\nAhh-ahh-ahh, ahh-ahh-ahh, ahh-ahh-ahh ahhh ahhh {*2X*}\nAhh-ahh-ahh, ahh-ahh-ahh, ahhh, ahhh-ah\nAh-ahh...\n\n[Chance The Rapper] + (Jeremih)\nI don't wanna be you, I just wanna be me (yeah yeah)\nI don't wanna be cool, I just wanna be me (be me)\nYou don't wanna be cool (be cool) you just wanna be me (be)\nI don't wanna be cool, I don't wanna be cool, I don't wanna be cool - IGH!\nI don't wanna be cool, I don't like bein' cool (I don't wanna be cool)\nI ain't tryin' to be cool, what's it like bein' cool? (what's it like bein' cool?)\nI just can't stay cool (I don't wanna be cool) I don't wanna be cool (I don't wanna be cool)\nI don't want you to be me (don't want you to be me) you should just be you, uh-huh\nNah nah nah, nah nah nah, nah nah nah (drivin')\nNah nah nah, nah nah nah, nah nah nah (uh-huh)\nNah nah nah, nah nah nah, nah nah nah\nYou just wanna be me! You just wanna be me~!\n\n[Big Sean]\nOkay, I grew up without a chauffeur\nMan I'm talkin' straight out the dirt and sulfur\nOnly birds in my city is vultures\nI mean back before I could afford a faux fur\nI was off in that, debt, me and my mama\nHand-me-downs was the only time I got designer man\nOnly class I'm passing is english and math\nI don't know, maybe because they both got commas\nMaybe because my older bro was on the honor roll\nAnd the other one was always up in front of the honor\nSo I'm in the middle like the line in the divide signs\nSpendin' all my money on girls and Sean John\nWay before anybody called me Sean Don\nI was droppin' fifties man to look like 50\nRockin' pink Polo's, man shit ain't even fit me\nLookin' for the inspiration that's already in me\nAll the confidence I was tryin' to buy myself\nIf you don't like me, fuck it, I'll be by myself\nSpent all this time for you to say I'm fine\nI really should've spent it tryin' to find myself\n\n[Chance The Rapper] + (Jeremih)\n(Whattup?) It's cool with just me, I'm cool being me - IGH!\nI don't wanna be cool (don't wanna be cool) I ain't tryin' to be cool (I ain't tryin' to be cool)\nI just can't stay cool (I can't stay cool) what's it like bein' cool? (what's it like bein'?)\nI don't wanna be cool (yeah) I don't wanna be cool (yeah)\nI don't want you to be me (I don't want you to be me) you just should be you (you should)\n\n[KYLE]\nYeah, is being cool that cool? (really?)\nIs bein' a tool that big of a duel? (is it?)\nIt doesn't matter if a nigga is wearin' Supreme\nIf a cool guy shits, his shit's still gon' stink (still gon' stink)\nIf a cool guy's cool in the middle of the forest\nMan nobody fuckin' cares!\nSo why don't you just be the you that you know you are\nYou know, when nobody else is there?\nYou'll be aware, it's easy, and it's so important\nBein' cool shouldn't cost a fortune (no)\nBaby got her jeans from Goodwill (Goodwill)\nBut I bet that ass'll look gooooooood still\nOkay let's remember that shoppin' at Payless\nIt just means that you pay less, it don't make you bae-less\nIf you don't get re-tweets, it don't mean you say less, okay?\nSo I'ma post this shitty-ass selfie on IG\nAnd I don't care if anybody likes it or likes me, it's cool\n\n[Outro: Chance The Rapper] + (Jeremih)\nI don't wanna be cool, I ain't tryin' to be cool\nI just can't stay cool, what's it like bein' cool?\nI don't wanna be cool, I don't wanna be cool (yeah)\nI don't want you to be me, you just should be you (yeeah)\nNah nah nah, nah nah nah, nah nah nah\n(I don't wanna be cool, I ain't tryna be cool)\nNah nah nah, nah nah nah, nah nah nah\n(I wanna stay cool, I'd rather stay cool)\nNah nah nah, nah nah nah, nah nah nah (ohhh, uh)\nYou just wanna be me! (you just wanna be me!) you just wanna be me~!"}}, "(Donnie Trumpet &amp; The Social Experiment f/) Jamila Woods": {"Surf": {"Questions": "\n[Chorus: Jamila Woods]\nWhy, why, why why\nWhy, why, why why\nWhy, why, why why, why, why\n\n[Jamila Woods]\nRain so hot in the neighborhood\nMy love don't call when she said she would\nFriends who come don't stay for good\nNo, no, no...\nWhy, pigs want take black mama's kids?\nBible say we all from the same rib\nBut some of us go to heaven too soon\nWhy some of us get to heaven too soon?\n\n[Chorus] w/ ad-libs\n\n[Jamila Woods]\nWhy, why, why why (why why)\nWhy, why, why why (why why why)\nWhy, why, why why..."}}, "Donnie Trumpet &amp; The Social Experiment f/ Saba": {"Surf": {"SmthnthtIwnt": "\n[Intro: The Social Experiment]\nHeheheh, ooh yeeeah, ah ah ah\nYou somethin' that I want, you somethin' that I want, ooh ooh ooohh\nYou somethin' that I want, you somethin' that I want, oooohhh\nYou somethin' that I want, you somethin' that I want\n\n[Saba]\nAh; I just totally want utopia to surround my conscious\nSo I can give a fuck about the fabrics that I found in my closet\nWhat's so bounded by sound is that her word never left me\nWhile the departed all countin' sheep, I, been busy countin' my blessings\nUnc been on house arrest since his release, just found him dead in his sleep - DEAD!\nWait, just open your soul and your soul intent\nIt's total legit, I go throw a fit I owed unto him, he wrote from the pen\nYou called on weekends, I pour out to sip if I drank\nI know the Lord give and Lord take but he got me choosin' between church and the music, like Mase\nPray, that's what grandma said, I bow my head, you still alive\nYou are not dead, I'm your pallbearer and that's the blood that I wrote this with~!\n\n(\"Anything! Anything!\")\n\n[Outro: The Social Experiment]\nOoh ooh ooohh\nYou somethin' that I want, you somethin' that I want\nYou somethin' that I want, you somethin' that I want"}}, "Donnie Trumpet &amp; The Social Experiment f/ Chance The Rapper, Erykah Badu": {"Surf": {"Rememory": "\n[Chance The Rapper]\nUh, uh uh\nTake a break when I break my leg, save the day when I take her hand\nI'ma appear to this - whoooooo, ooh\n\nTake a break when I break my leg, save the day when I take her hand\nAnd she break my heart and she take an arm and leg and a car and the kids\nAnd the court's takin' course on me, and of course I'm remorseful\nBut more so for the kids forced to use morse code, poor souls ain't got no voices\nTake a disco nap when disco's dead\nAnd the word goes live and I fixed those heads\nAnd the disc goes flop but the track don't skip, and the words don't jumble\nAnd the milk don't curdle and the cookie don't crumble\nAnd the one eyed man screams \"Marco, this no joke, this code red\", too late\nThe blind townspeople finally found people, kingdom came, freedom reigned\nSee what I'm sayin? Took his name\nWho got that hook up on that Peter Pan? The book is broke, he shook his hand\n\n[Ady Suleiman]\nWho got the hook up on it?\nTell me how you feel inside - mm, tell me, oh yeah, oh yeah\nTell me (oh ma) tell me how you feel inside\nTell me how you feel - tell me\nTell me, tell me how you feel inside\nTell me how you feel inside, ma\nTell me, tell me how you feel tonight\nTell me how you feel, tell me how you feel\nOh, oh, ohhhhhhhh\n\n[Erykah Badu]\nYoung man, lay, lay your head down\nTell me of your day (day) rememory you'll say\nChancelor baby, you're uneasy, I can tell\nBut in your way you're on your way\nRememory, you're safe (ahhhh)"}}, "Donnie Trumpet &amp; The Social Experiment f/ J. Cole, NoName Gypsy": {"Surf": {"Warm Enough": "\n[Chorus: NoName Gypsy - singing]\nWho are you to tell me, I'm not warm enough for summertime?\nI know that I can decide myself\nBut you don't know me like the sun\nYou've never seen my horizon\n\n[NoName Gypsy]\nIf I was everything I never was, drugs got me bubbly, suddenly mumblin' simile meant to be for you now\nThe futile go fishin' for moon over rooftop, a new style for prayin' to everything I ever loved\nMy black boy outer space lookin' like a rain child, but my body move like the sun\nGo run, tell 'em rainbow, we painted it 50 Shades of Grey/gray, stones across the lake\nThe house in the house, deceptive carnations, our wedding, we announced on Sunday for the holy of it\nSolely covet, me and you, for you and I, are blissfully tethered to simple redeemin'\nWhen sadness gets worse and we don't know why\nOur city is bleedin' for crimson, I don't protest, I just dance in my shadows\nHallow be thy empty, when my name don't sing\nShallow waters under bridges, don't forget 'bout me\nWho are you to love me and not call me by my name?\nI'm sunny, I'm sunny, just like you.. NoName\n\n[Chance The Rapper]\nLike the sun, like the sun\n\nWho are you to tell me I can't love you like the way mothers love daughters?\nThe way Mary was closest to Joseph and babies is close to The Father\nYou don't know me and love got a secret handshake and mad inside jokes\nI could tell it's knock knock when my heart beatbox, use our inside voice\nWho are you to tell me I don't want you the way flesh wants freedom?\nThe way greed love need? The way kings need kingdoms?\nYou don't know what I know, what I'm capable of\nWhat I slaved for and traded in favors and gave up for you what I gave up for love\n\n[Chorus]\n\n[J. Cole]\nYou like the flower that I won't let die\nRight before your petals start to wilt, I choose to give you one last try\nFill your vase up with water\nRefusin' to neglect you like your father so I promise that it won't run dry\nGood intentions cause I wanna see us both fly\nBut I often put me first and I been wonderin' why\nI know you probably think you're blessed to have a wonderful guy\nAnd that's the truth but at the same time a wonderful lie\nCause to me you're a dime and I'm still a nickel\nAnd you know niggas say that every coin got two sides\nWell if you knew both minds, not sure you'd like what you find\nI made mistakes, I want to tell you but can't make up my mind\nAs I'm writin' this, I see a red balloon in the sky\nAnd to me, that's a sign tellin' me that these lines\nwere meant to be written, repentin' in the form of a rhyme\nI know the Lord's a forgiver, hope he'll forgive me in time - I'm\n\n[Chorus]"}}, "(Donnie Trumpet &amp; The Social Experiment f/) Eric Butler": {"Surf ": {"Pass the Vibes": "\n{*instrumental plays on to the 0:45 mark*}\n\n{*Eric Butler ad-libs for 16 seconds*}\n\n[Eric Butler]\nShe had some vibes for me, I had no vibes for her (ah-no vibes)\nShe pressed them on to me, I have some vibes for her (I got the vibes now)\nHey! (hey!) pass me the vibes\nI want to play the vibrophooooone\nShe had some vibes for me, I had no vibes for her \n(Hey! - hey! Pass me the vibes)\nShe pressed them on to me, I have some vibes for her \n(I want to play the vibrophooooone)"}}, "Donnie Trumpet &amp; The Social Experiment f/ ": {"Surf": {"Windows": "\n[Chance The Rapper]\nKeep ya head away from windows, keep your arms inside the ride\nTrust me with ya body, trust me with ya life\nBangin' on the windows, baby come inside\nCertainly in trouble, maybe you should hide\nI'ma tell you like\n\n[Chorus 2X: Chance The Rapper]\nDon't you look up to me, don't trust a word I say\nDon't you end up like me, if you learn one thing today\n\n[Chance The Rapper] + (Raury)\nYeah yeah yeah yeah yeah yeah yeah yeah yeah yeah yeah\n(Careful, careful, careful)\nYeah yeah yeah yeah yeah yeah yeah yeah yeah yeah yeah\nYeah yeah yeah yeah yeah yeah yeah yeah yeah yeah yeah\n\n[The Social Experiment - repeat 2X]\nHm na, hm na, hm na na na\nHm na, hm na, hm na na na (hm na-na-na)\n\n[Chorus]\n\n[Chance The Rapper] + (BJ The Chicago Kid) + {Raury}\n(No no no no no no no no no no)\nMm, mmm - woo~!\nCareful.. careful - don't trust a word I say\nCareful {careful} careful\nDon't trust a word I say, careful\nIf you learn one thing today {yeah, yeah!} (yeeeeah)\nCareful {yeah, yeah!}\nCareful {yeah, yeah!}\nBe careful {careful} (carefullllll)\n\n[The Social Experiment, Raury, BJ The Chicago Kid] + (Chance)\nCareful (Don't you look up to me, don't trust a word I say)\nCareful (Don't you end up like me, if you learn one thing today)\nCareful (Don't you look up to me, don't trust a word I say)\nCareful (If you learn one thing today)\nCareful (Don't you end up to me, don't trust a word I say)\nCareful (If you learn one thing today)\nCareful (Careful)\n\n[Outro: Chance The Rapper]\nYou can never be too careful - don't trust a word I say\nDon't trust a, don't trust a word I say\nDon't, don't go trustin' a word I say\nDon't you, don't you, don't you, don't you\nDon't BE so careful!\nDon't trust a word I say"}}, "Donnie Trumpet &amp; The Social Experiment ": {"Surf ": {"Just Wait": "\n[Intro]\nStand up, be loud!\n\n{*instrumental plays on until the 1:53 mark while Chance ad-libs in the background*}\n\n[Chance The Rapper - w/ echoes]\nYou spend the night, spend the money\nSend off flight, for the tummy\nBit of a +Pickle+, she tuck her tummy/Tommy\n+Rugrat+, bare skin, fair skin\nSince Pan, afro-merican\nActor, in air, air's thin\nNew floor, ery'thing, ery'thing\nOoh Lord, ery'thing, ery'thing\n\n[Chorus: Chance The Rapper] + (The Social Experiment)\nWhat a delicate heart, what a hard head\nWhat a delicate heart, what a hard head\n(Good things come, to those that wait)\nGood things come to those that wait\nWhat a delicate heart, what a hard head\nWhat a delicate heart, what a hard head\n(Good things come to those that wait)\n(Good things come to those that wait)\n\n[Chance] Good things come\n\n[The Social Experiment - repeat 4X]\nGood things come, good things come, good things come, good things come\nThen they go, then they go, then they go, then they go"}}, "(Donnie Trumpet &amp; The Social Experiment f/) D.R.A.M.": {"Surf": {"Caretaker": "\n[D.R.A.M.]\nHey-yeeeeah (hey-yeah)\nHey-yeah (hey-yeah)\nWhoa whoa whoa\n\nI'll take care of you, mm, mm (hey-yeeeah)\nEven if you got a man now, cause I been fuckin' fans now\nStill I'll take care of you, mm-mm, mm (hey-yeeeah)\nEven if you gotta man now, I would have to understand now\nCause I've been baaaaaad\nOhh but you know I still got you baby\nI've been baaaaaad\nI had to do what I had to do\nI've been baaaaaad\nBut you know I still love you\nI've been baaaaaad\nSorry, but still I'll take care of you (hey-yeeeah)\nEven if you've got a man now, I'd be forced to understand now\nOoohh"}}}